[
  {
    "link": "https://arxiv.org/pdf/2511.21671v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Nicholas Davidson",
      "Jonathan R. Kujawa",
      "Robert Muth"
    ],
    "title": "Superalgebra deformations of web categories: Affine and cyclotomic webs",
    "abstract": "Let $\\mathbb{k}$ be a characteristic zero domain. We define and study a diagrammatic monoidal $\\mathbb{k}$-linear supercategory $\\mathbf{Web}^{aff}_{A}$ associated to any locally unital Frobenius $\\mathbb{k}$-superalgebra $A$. This category can be viewed variously as an affinization of the finite web category $\\mathbf{Web}_{A}$ previously defined by the authors and Zhu, as a thickening of the degenerate affine wreath product algebras defined by Savage, or as a Frobenius deformation of affine web categories defined by Song and Wang. We show that there is an asymptotically faithful family of functors from $\\mathbf{Web}^{aff}_{A}$ to the monoidal supercategory of endofunctors of $\\mathfrak{gl}_n(A)$-modules for every $n \\geq 1$, and use this to establish a basis of `decorated double coset diagrams' for morphism spaces in $\\mathbf{Web}^{aff}_{A}$. We also define and establish basis results for the cyclotomic quotient category $\\mathbf{Web}^Λ_{A}$ associated with a cyclotomic datum $Λ$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21656v1",
    "categories": [
      "math.CA",
      "math.CO",
      "math.MG"
    ],
    "authors": [
      "William O'Regan",
      "Pablo Shmerkin",
      "Hong Wang"
    ],
    "title": "Simple proofs of discretised projection theorems",
    "abstract": "We give a simple, short and self-contained presentation of Bourgain's discretised projection theorem from 2010, which is a fundamental tool in many recent breakthroughs in geometric measure theory, harmonic analysis, and homogeneous dynamics. Our main innovation is a short elementary argument that shows that a discretised subset of $\\R$ satisfying a weak ``two-ends'' spacing condition is expanded by a polynomial to a set of positive Lebesgue measure.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21632v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "André de Laire",
      "Olivier Goubet",
      "María Eugenia Martínez",
      "Claudio Muñoz",
      "Felipe Poblete"
    ],
    "title": "Dynamics of generalized abcd Boussinesq solitary waves under a slowly variable bottom",
    "abstract": "The Boussinesq $abcd$ system is a 4-parameter set of equations posed in $\\mathbb R_t\\times\\mathbb R_x$, originally derived by Bona, Chen and Saut as first-order 2-wave approximations of the incompressible and irrotational, two-dimensional water wave equations in the shallow water wave regime, in the spirit of the original Boussinesq derivation. Among the various particular regimes, each determined by the values of the parameters $(a, b, c, d)$ appearing in the equations, the \\emph{generic} regime is characterized by the conditions $b, d > 0$ and $a, c < 0$. If additionally $b=d$, the $abcd$ system is Hamiltonian.\n  In this paper, we investigate the existence of generalized solitary waves and the corresponding collision problem in the physically relevant \\emph{variable bottom regime}, introduced by M.\\ Chen. More precisely, the bottom is represented by a smooth space-time dependent function $h=\\varepsilon h_0(\\varepsilon t,\\varepsilon x)$, where $\\varepsilon$ is a small parameter and $h_0$ is a fixed smooth profile. This formulation allows for a detailed description of weak long-range interactions and the evolution of the solitary wave without its destruction. We establish this result by constructing a new approximate solution that captures the interaction between the solitary wave and the slowly varying bottom.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20825v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Mingcheng Sheng"
    ],
    "title": "Spectral orthogonality of special flows",
    "abstract": "In this paper, we study the spectral orthogonality problem for special flows built over irrational rotations under two different types of roof functions:\n  1) the roof functions are real analytic.\n  2) the roof functions are piecewise $C^1$ with one discontinuity. These flows are also known as von-Neumann flows.\n  We show that if $\\{T^f_α\\}$ is as in 1) and weak mixing, then for a $G_δ$ dense set of $β$, we have that $\\{T^f_β\\}$ is weak-mixing and is spectrally orthogonal to $\\{T^f_α\\}$. On the other hand, if $\\{T^f_α\\}$ is as in 2), then for a full measure set of $β$, the flows $\\{T^f_α\\}$ and $\\{T^f_β\\}$ are spectrally orthogonal.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20802v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Chandrasekhar Gokavarapu"
    ],
    "title": "Exact Categories and Homological Foundations of Non-Commutative n-ary Gamma. Semirings",
    "abstract": "This paper establishes the homological and geometric foundations of non-commutative n-ary Gamma-semirings, unifying two previously distinct directions in Gamma-algebra: the derived Gamma-geometry developed for the commutative ternary case and the structural and spectral theory for general non-commutative n-ary systems. We introduce categories of left, right, and bi-Gamma-modules that respect positional asymmetry and prove that they form additive and exact categories in Quillen's sense. Within this setting, we construct projective and injective resolutions, define the derived functors Ext^Gamma and Tor_Gamma, and establish long exact sequences and spectral balance theorems in the n-ary regime. By extending sheaf-theoretic and homological tools to the non-commutative Gamma-spectrum Spec_Gamma^nc(T), we obtain a coherent framework of non-commutative derived Gamma-geometry that parallels the classical paradigms of Grothendieck and Kontsevich in homological algebra and non-commutative geometry. The framework developed here establishes the foundational exact-categorical and homological structures that enable Morita-type analyses and spectral interpretations in the subsequent parts of this series.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20796v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Pamela E. Harris",
      "J. Carlos Martínez Mori",
      "Alexander N. Wilson"
    ],
    "title": "A Pollak Proof for the Number of Weakly Increasing Parking Functions",
    "abstract": "We develop a circular-street argument, in the style of Pollak, to obtain a new proof that there are $C_n = \\frac{1}{n+1}\\binom{2n}{n}$ weakly increasing parking functions of length $n \\geq 1$, where $C_n$ is the $n$th Catalan number.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20786v1",
    "categories": [
      "math.DS",
      "math.GR"
    ],
    "authors": [
      "Fabien Hoareau"
    ],
    "title": "Polish full groups preserving an infinite measure",
    "abstract": "We extend some results of Carderi and Le Maître on full groups in the probability context to the infinite measure one: there exists at most one Polish group topology (refining the weak topology and coarser than the uniform topology) on an ergodic full group, and the orbit full group of a locally compact group acting in a Borel manner can be endowed with a Polish group topology. Moreover, orbit full groups are complete invariants for orbit equivalence. We then generalize a result from Le Maître on non-Polishability of the group of finitely supported bijections: the finitely supported elements of an ergodic full group carries a Polish group topology if and only if the associated full group comes from a countable equivalence relation. We finish with algebraic and topological results on ergodic (orbit) full groups concerning normal subgroups, contractibility and genericity of aperiodic elements.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20783v1",
    "categories": [
      "math.OC",
      "cs.MS"
    ],
    "authors": [
      "Anderson E. Schwertner",
      "Francisco N. C. Sobral"
    ],
    "title": "A derivative-free trust-region approach for Low Order-Value Optimization problems",
    "abstract": "The Low Order-Value Optimization (LOVO) problem involves minimizing the minimum among a finite number of function values within a feasible set. LOVO has several practical applications such as robust parameter estimation, protein alignment, portfolio optimization, among others. In this work, we are interested in the constrained nonlinear optimization LOVO problem of minimizing the minimum between a finite number of function values subject to a nonempty closed convex set where each function is a black-box and continuously differentiable, but the derivatives are not available. We develop the first derivative-free trust-region algorithm for constrained LOVO problems with convergence to weakly critical points. Under suitable conditions, we establish the global convergence of the algorithm and also its worst-case iteration complexity analysis. An initial open-source implementation using only linear interpolation models is developed. Extensive numerical experiments and comparison with existing alternatives show the properties and the efficiency of the proposed approach when solving LOVO problems.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20708v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ivan Hetman"
    ],
    "title": "Existence of $S(2,9,369)$, new unitals of order $6$ and other Steiner systems with block length $\\ge 7$",
    "abstract": "Whereas Steiner systems $S(2,k,v)$ with block length $k \\le 5$ have large amount of examples and the existence is established for all admissible $v$, for $k\\ge 6$ only few examples are known even for decided cases. In this paper the existence of $S(2,9,369)$ is established and some new examples for other admissible pairs $(k,v)$ are given. In particular, lots of new unitals of order $6$ (or $S(2,7,217)$) together with $S(2,7,175)$, $S(2,7,259)$, $S(2,8,120)$, $S(2,8,504)$, $S(2,9,513)$ are presented. Found examples suggest two conjectures on infinite series of designs.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20685v1",
    "categories": [
      "math.NA",
      "cs.LG"
    ],
    "authors": [
      "Peiqi Li",
      "Jie Chen"
    ],
    "title": "Dual-Domain Deep Learning Method to Accelerate Local Basis Functions Computation for Reservoir Simulation in High-Contrast Porous Media",
    "abstract": "In energy science, Darcy flow in heterogeneous porous media is a central problem in reservoir sim-ulation. However, the pronounced multiscale characteristics of such media pose significant challenges to conventional numerical methods in terms of computational demand and efficiency. The Mixed Generalized Multiscale Finite Element Method (MGMsFEM) provides an effective framework for addressing these challenges, yet the construction of multiscale basis functions remains computationally expensive. In this work, we propose a dual-domain deep learning framework to accelerate the computation of multiscale basis functions within MGMsFEM for solving Darcy flow problems. By extracting and decoding permeability field features in both the frequency and spatial domains, the method enables rapid generation of numerical matrices of multiscale basis functions. Numerical experiments demonstrate that the proposed framework achieves significant computational acceleration while maintaining high approximation accuracy, thereby offering the potential for future applications in real-world reservoir engineering.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20664v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Vienna B. Rossmanith"
    ],
    "title": "A Modified BGK Collision Operator for Exact Conservation in Numerical Solutions of Boltzmann-BGK",
    "abstract": "Ideal gases can be modeled by the Boltzmann equation from statistical physics. Instead of trying to track the position and velocity of a large number of gas molecules, it is possible to describe the particles with a particle distribution function. The Boltzmann equation provides the rule for evolving the distribution function over time, allowing one to simulate the gas dynamics. In this work, we develop a novel numerical method for solving the 1D1V Boltzmann-BGK equation. Several important ingredients are combined to create an accurate, efficient, robust numerical method valid in all flow regimes. First, we make use of operator splitting to create separate transport and collision sub-steps, each of which is easier to discretize than the whole system; second, we introduce a third-order accurate Lax-Wendroff-type scheme for the transport sub-step; third, we make use of the second-order L-stable TR-BDF method for the collision sub-step. The final component we introduce is a novel treatment of the collision sub-step to guarantee that the total mass, momentum, and energy are conserved even in the presence of a truncated velocity range and quadrature errors in computing moments. The key idea is to multiply the Maxwell-Boltzmann distribution in the collision sub-step by a quadratic Hermite polynomial, where the coefficients in the polynomial are chosen to ensure exact conservation. The resulting scheme is verified on piecewise constant initial data with periodic boundary conditions; exact conservation up to machine precision is demonstrated for mass, momentum, and energy. The resulting method is implemented in a freely available Java code with Python plotting routines.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21329v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Chien-Hua Chen"
    ],
    "title": "CM Drinfeld Modules, Self-isogenous Modular Polynomials, and Volcano Structure",
    "abstract": "In this paper, we develop a view of self-isogenous modular polynomials and the $\\mathfrak{l}$-cyclic isogeny graph for CM Drinfeld modules of arbitrary rank $r$. On the computational side, we give an explicit procedure to construct the modular polynomial $Φ_{J,\\mathfrak{a}}(X,X)$ for Drinfeld modules of rank $r\\geqslant 3$ with $\\mathfrak{a}$ a prime ideal of $\\mathbb{F}_q[T]$. When $\\mathfrak{a}=(T)$, we provide an algorithm to compute $Φ_{J,\\mathfrak{a}}(X,X)$; when $\\mathfrak{a}=(T^2+T+1)$, we give an explicit degree bound on $Φ_{J,\\mathfrak{a}}(X,X)$. On the structural side, we formulate a generalized $\\mathfrak{l}$-cyclic volcano structure and prove that the generalized volcano appears in a component of the full $\\mathfrak{l}$-cyclic isogeny graph for rank-$r$ Drinfeld modules with complex multiplication.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21316v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Vlatko Crnković"
    ],
    "title": "Fractal Analysis of Pseudo Foci in Piecewise Analytic Systems",
    "abstract": "It is well known that the Minkowski dimension of spiral trajectories near a non-degenerate focus in analytic (smooth) systems is in one-to-one correspondence with the cyclicity of the focus in generic unfoldings. We give a complete fractal treatment, in terms of the Minkowski dimension and (non-)degeneracy, of spiral trajectories near pseudo foci of piecewise analytic systems. We hope these results will prove useful in the study of bifurcations of such pseudo foci through inherent geometry of associated spiral orbits.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21283v1",
    "categories": [
      "math.DS",
      "cs.LG"
    ],
    "authors": [
      "Xiaohang Yu",
      "William Knottenbelt"
    ],
    "title": "On the Periodic Orbits of the Dual Logarithmic Derivative Operator",
    "abstract": "We study the periodic behaviour of the dual logarithmic derivative operator $\\mathcal{A}[f]=\\mathrm{d}\\ln f/\\mathrm{d}\\ln x$ in a complex analytic setting. We show that $\\mathcal{A}$ admits genuinely nondegenerate period-$2$ orbits and identify a canonical explicit example. Motivated by this, we obtain a complete classification of all nondegenerate period-$2$ solutions, which are precisely the rational pairs $(c a x^{c}/(1-ax^{c}),\\, c/(1-ax^{c}))$ with $ac\\neq 0$. We further classify all fixed points of $\\mathcal{A}$, showing that every solution of $\\mathcal{A}[f]=f$ has the form $f(x)=1/(a-\\ln x)$. As an illustration, logistic-type functions become pre-periodic under $\\mathcal{A}$ after a logarithmic change of variables, entering the period-$2$ family in one iterate. These results give an explicit description of the low-period structure of $\\mathcal{A}$ and provide a tractable example of operator-induced dynamics on function spaces.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21281v1",
    "categories": [
      "math.DS",
      "math-ph",
      "math.PR",
      "stat.ML"
    ],
    "authors": [
      "Boumediene Hamzi",
      "Houman Owhadi"
    ],
    "title": "A Dynamics-Informed Gaussian Process Framework for 2D Stochastic Navier-Stokes via Quasi-Gaussianity",
    "abstract": "The recent proof of quasi-Gaussianity for the 2D stochastic Navier--Stokes (SNS) equations by Coe, Hairer, and Tolomeo establishes that the system's unique invariant measure is equivalent (mutually absolutely continuous) to the Gaussian measure of its corresponding linear Ornstein--Uhlenbeck (OU) process. While Gaussian process (GP) frameworks are increasingly used for fluid dynamics, their priors are often chosen for convenience rather than being rigorously justified by the system's long-term dynamics.\n  In this work, we bridge this gap by introducing a probabilistic framework for 2D SNS built directly upon this theoretical foundation. We construct our GP prior precisely from the stationary covariance of the linear OU model, which is explicitly defined by the forcing spectrum and dissipation. This provides a principled, GP prior with rigorous long-time dynamical justification for turbulent flows, bridging SPDE theory and practical data assimilation.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21219v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Jiayun Li",
      "Yilin Mo"
    ],
    "title": "Conditional Generative Modeling of Stochastic LTI Systems: A Behavioral Approach",
    "abstract": "This paper presents a data-driven model for Linear Time-Invariant (LTI) stochastic systems by sampling from the conditional probability distribution of future outputs given past input-outputs and future inputs. It operates in a fully behavioral manner, relying solely on the current trajectory and pre-collected input-output data, without requiring explicit identification of system parameters. We refer to this model as a behavioral Conditional Generative Model (CGM). We prove the convergence of the distribution of samples generated by the CGM as the size of the trajectory library increases, with an explicit characterization of the convergence rate. Furthermore, we demonstrate that the gap between the asymptotic distribution of the proposed CGM and the true posterior distribution obtained by Kalman filter, which leverages the knowledge of all system parameters and all historical data, decreases exponentially with respect to the length of past samples. Finally, we integrate this generative model into predictive controllers for stochastic LTI systems. Numerical results verify the derived bounds and demonstrate the effectiveness of the controller equipped with the proposed behavioral CGM.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21200v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Abdelhaq El Khalfi",
      "Hicham Laarabi",
      "Suat Koç"
    ],
    "title": "Commutative rings with $n$-$1$-absorbing prime factorization",
    "abstract": "Let $R$ be a commutative ring with $1\\neq 0$ and $n$ be a fixed positive integer. A proper ideal $I$ of $R$ is said to be an \\textit{$n$-OA ideal} if whenever $a_1a_2\\cdots a_{n+1}\\in I$ for some nonunits $a_1,a_2,\\ldots,a_{n+1}\\in R$, then $a_1a_2\\cdots a_n\\in I$ or $a_{n+1}\\in I$. A commutative ring $R$ is said to be an \\textit{$n$-OAF ring} if every proper ideal $I$ of $R$ is a product of finitely many $n$-OA ideals. In fact, $1$-OAF rings and $2$-OAF $2$-OAF-rings are exactly the general ZPI rings and OAF rings, respectively. In addition to giving various properties of $n$-OAF rings, we give a characterization of Noetherian von Neumann regular rings in terms of our new concept. Furthermore, we investigate the $n$-OAF property of some extension of rings such as the polynomial ring $R[X]$, the formal power series ring $R[[X]]$, the ring of $A+XB[X]$, and the trivial extension $R=A\\propto E$ of an $A$-module $E$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21128v1",
    "categories": [
      "math.GN",
      "math.CT",
      "math.NT"
    ],
    "authors": [
      "J. R. Pérez-Buendía"
    ],
    "title": "El mar que envuelve a las piedras: espacios de Stone, profinitos y su papel en la aritmética contemporánea",
    "abstract": "Stone duality establishes a contravariant equivalence between the category of Boolean algebras and the category of compact, Hausdorff, totally disconnected topological spaces (Stone spaces). These spaces are precisely the profinite spaces and form the natural environment for arithmetic objects such as the $p$-adic integers, absolute Galois groups, and profinite completions. In this article we give a rigorous and self-contained development of the construction of the Stone space associated to a Boolean algebra, prove Stone's representation theorem, and describe profinite spaces as inverse limits of finite systems. From there we introduce the Stone--Čech compactification via its universal property and discuss central arithmetic examples (such as $β\\mathbb{N}$ and profinite completions), emphasizing their structural role in arithmetic geometry and in the framework of Condensed Mathematics of Clausen--Scholze. The text is aimed at advanced undergraduate and beginning graduate students, as well as readers interested in the interface between topology, number theory, and new categorical formulations of topology.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21586v1",
    "categories": [
      "math.DG",
      "math.AT",
      "math.KT"
    ],
    "authors": [
      "Markus Banagl",
      "Eric Leichtnam",
      "Paolo Piazza"
    ],
    "title": "The G-signature Theorem on Witt spaces",
    "abstract": "Let G be a compact Lie group and let X be an oriented Witt G-pseudomanifold. Using intersection cohomology it is possible to define Sign(G,X) in R(G), the G-signature of X. Let g be an element in G. Assuming that the inclusion of the fixed point set associated to g is normally non-singular, we prove a formula for Sign(g,X), the G-signature of X computed at g, thus extending to Witt G-pseudomanifolds the fundamental result proved by Atiyah, Segal and Singer on smooth compact G-manifolds. Along the way, we give a detailed study of the fixed point set of a Thom-Mather G-space X and our main result in this direction is a sufficient condition ensuring that the fixed point set associated to G is included in X in a normally non-singular manner. This latter result provides many examples where our formula applies.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21506v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Marc Kegel",
      "Misha Schmalian"
    ],
    "title": "Links have no characterising slopes",
    "abstract": "We show that there is no analogue of characterising slopes for multi-component links. Concretely, we show that for any ordered link L in S3 with n>1 components and any rational slopes r_1, ..., r_n, there are infinitely many links L_i with non-homeomorphic complements such that the Dehn fillings L(r_1, ..., r_n) and L_i(r_1, ..., r_n) are homeomorphic.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21489v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Pierluigi Colli",
      "Elisabetta Rocca",
      "Jürgen Sprekels"
    ],
    "title": "On the hyperbolic relaxation of the chemical potential in a phase field tumor growth model",
    "abstract": "In this paper, we study a phase field model for a tumor growth model of Cahn--Hilliard type in which the often assumed parabolic relaxation of the chemical potential is replaced by a hyperbolic one. We show that the resulting initial-boundary value problem is well posed and that its solutions depend continuously on two given functions: one appearing in the mass balance equation and one in the nutrient equation, representing, respectively, sources of drugs (e.g. chemotherapy) and antiangiogenic therapy. We also discuss regularity properties of the solutions. Moreover, in the case of a constant proliferation function, we rigorously analyze the asymptotic behavior as the coefficient of the inertial term tends to zero, establishing convergence to the corresponding viscous Cahn--Hilliard tumor growth model. Our results apply to a broad class of double-well potentials, including nonsmooth ones.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21470v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Stephen Brittain",
      "Robert S. Coulter",
      "Alice Man Wa Hui"
    ],
    "title": "A PTR polynomial for the Hughes planes and a new class of permutation polynomials involving Catalan numbers",
    "abstract": "Hughes introduced the projective planes that bear his name in 1957 and they have since been studied extensively. However, until now, no polynomial representation of a planar ternary ring that represents them has been determined. In this paper, we rectify this omission by determining a reduced PTR polynomial for any Hughes plane defined over a regular nearfield. The polynomials obtained provide a new surprising connection: both the Catalan numbers and generalized Catalan numbers occur among the coefficients, depending on the representation. Since every PTR polynomial has connections with several classes of permutation polynomials, we obtain three new infinite classes of permutation polynomials as a consequence of our main result, and these, too, involve the Catalan numbers. The differential uniformity of new permutation polynomials is also determined.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21467v1",
    "categories": [
      "math.AP",
      "math-ph",
      "nlin.PS"
    ],
    "authors": [
      "Tomas Dohnal",
      "Maximilian Hanisch",
      "Runan He"
    ],
    "title": "Polychromatic Localized Waves with Complex Frequencies in Nonlinear Maxwell Equations with Material Dispersion",
    "abstract": "We study the existence of polychromatic solutions of cubically nonlinear Maxwell equations in the whole space and with dispersive media, i.e., with a time delayed polarization. Due to the complex nature of the dielectric function, the frequencies are complex, resulting in a decay in time. The geometry is that of a waveguide in $x$ with the propagation direction being $y$ and the solutions are localized in $x$ and TM-polarized. These are often referred to as breathers. They are given as a Fourier series in $y$ and $t$ with the leading frequency $ω$ being an eigenvalue of a corresponding operator pencil on $\\mathbb{R}$ (in the $x$ variable). Each term in the series corresponds to a different temporal decay rate or a different frequency. The series is constructed iteratively via a sequence of linear ordinary differential equations. Our general result provides the existence under some assumptions on the spectrum and on estimates of the resolvent of the corresponding linear operator. We also produce an example of a waveguide given by the interface of two spatially homogeneous physically relevant media for which these assumptions are satisfied. For such an interface setting the constructed solutions correspond to nonlinear polychromatic surface plasmons.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21457v1",
    "categories": [
      "math.AG",
      "math.NT"
    ],
    "authors": [
      "Victor de Vries"
    ],
    "title": "Evaluating the tame Brauer group of open varieties over local fields",
    "abstract": "In this document we let $U$ be a smooth variety of pure dimension $d$ over a local field $k_v$ with unit ball $\\mathcal{O}_v$ and residue field $\\mathbb{F}$ of characteristic $p>0$ and we set $n$ to be a positive integer such that $p\\nmid n$. For various $u\\in U(k_v)$ we study the evaluation map $u^*:\\mathrm{H}^2(U,μ_n)\\to \\mathrm{H}^2(k_v,μ_n)$. We suppose that $U$ embeds as an open subscheme in a regular scheme $\\mathcal{X}$ that is of finite type over $\\mathcal{O}_v$. We assume that $Z:=\\mathcal{X}\\setminus U$ is a divisor and we endow it with its reduced scheme structure. We show that for $u_1,u_2\\in U(k_v)$ that lift to $x_1,x_2\\in \\mathcal{X}(\\mathcal{O}_v)$ we obtain the same evaluation map $u_1^*=u_2^*$ under the two conditions that first, there is an equality of reductions $\\overline{x_1}=\\overline{x_2}$ in $\\mathcal{X}(\\mathbb{F})$ and second, that $\\mathrm{cl}(x_1\\cap Z)=\\mathrm{cl}(x_2\\cap Z)$ holds in $\\mathrm{H}^{2d}_{|\\overline{x}|}(Z,μ_n^{\\otimes d})$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21393v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Yusong Zhang",
      "Zeng-Qi Wang"
    ],
    "title": "Lopsided HSS Iterative Method and Preconditioner for a class of Complex Symmetric Linear System",
    "abstract": "In this study, we propose the lopsided HSS (LHSS) iteration method for solving a class of complex symmetric indefinite systems of linear equations. This method employs an alternating iterative scheme, where each iteration entails solving two systems of equations with symmetric real coefficient matrices. This design is intended to reduce the high computational costs associated with complex arithmetic. Theoretical analysis shows that the upper bound of the convergence rate depends only on the maximum and minimum eigenvalues of the real symmetric matrices, as well as the iteration parameters. When the eigenvalues satisfy certain conditions, the method guarantees convergence for any positive iteration parameter. Building on this insight, we developed the preconditioned lopsided HSS iteration method (PLHSS). Theoretical results demonstrate that PLHSS exhibits superior convergence properties compared to the original method. Additionally, we derived the optimal parameters for the new approaches and corresponding optimal convergence rate. Furthermore, we derive the PLHSS preconditioner on the basis of the iterative method. The eigenvalues of the preconditioned matrix are well-clustered, and the eigenvectors are orthogonal with a specific inner product. Numerical experiments demonstrate the efficiency of the preconditioned GMRES and COCG methods. LHSS iteration methods and the relevant preconditioners show mesh size independent and parameter-insensitive convergence behavior for the test numerical examples.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21391v1",
    "categories": [
      "math.OA"
    ],
    "authors": [
      "Hannes Thiel"
    ],
    "title": "Distance to regular elements and polar decompositions in a C*-algebra",
    "abstract": "We show that the distance from an element of a C*-algebra to the set of regular elements is the infimum of the $δ>0$ for which the $δ$-cut-down of the element admits a polar decomposition within the algebra. This parallels results of Pedersen and Brown-Pedersen describing the distance to invertible and quasi-invertible elements through polar decompositions of cut-downs whose polar parts are unitaries or extreme partial isometries.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20984v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Kengo Hashimoto"
    ],
    "title": "Impartial Games with Activeness",
    "abstract": "A combinatorial game is a two-player game without hidden information or chance elements. The main object of combinatorial game theory is to obtain the outcome, which player has a winning strategy, of a given combinatorial game. Positions of many well-known combinatorial games are naturally decomposed into a disjunctive sum of multiple components and can be analyzed independently for each component. Therefore, the study of disjunctive sums is a major topic in combinatorial game theory. Combinatorial games in which both players have the same set of possible moves for every position are called impartial games. In the normal-play convention, it is known that the outcome of a disjunctive sum of impartial games can be obtained by computing the Grundy number of each term. The theory of impartial games is generalized in various forms. This paper proposes another generalization of impartial games to a new framework, impartial games with activeness: each game is assigned a status of either ``active'' or ``inactive''; the status may change by moves; a disjunctive sum of games ends immediately, not only when no further moves can be made, but also when all terms become inactive. We formally introduce impartial games with activeness and investigate their fundamental properties.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20967v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Nicholas Van Nimwegen"
    ],
    "title": "Permutations Almost Avoiding Monotone Distant Patterns",
    "abstract": "In a previous work, Bóna and Pantone studied permutations that avoided all but one pattern of length $k$ that began with a length $k-1$ increasing subsequence. We draw the connection between that idea and distant patterns, first discussed heavily in a work by Dimitrov, and study similar permutation classes, where the index not part of the increasing subsequence can vary. We find a large class of Wilf-Equivalences between $k+1$ classes of $k$ patterns of length $k+1$, and outline several classes of unbalanced Wilf-Equivalences related to the first class. Using this, we are also find new bounds on the exponential growth rate on all monotone distant patterns with a single gap constraint.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20787v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Armando Martino",
      "Motiejus Valiunas"
    ],
    "title": "Coset correct means on groups and the probability that two elements commute",
    "abstract": "Amenable groups are those admitting an invariant mean -- a finitely additive probability mean that assigns equal ``weight'' to any two translates of the same set.\n  We introduce coset correct means (CCMs), a class of finitely additive means that, for any subgroup, assigns equal weight to all its cosets, weakening and therefore generalising the notion of an invariant mean. We show that, unlike the case for invariant means, every group admits a CCM and give two constructions -- one via the Ultrafilter Lemma and one via the Hahn--Banach Theorem -- both relying on a Theorem of B. H. Neumann. Using CCMs, we define a degree of commutativity for arbitrary groups, measuring the ``probability'' that two random elements of a group commute. We prove that this degree of commutativity is independent of the choice of CCM and is positive precisely for finite-by-abelian-by-finite groups, recovering and unifying previous characterisations.\n  We also introduce a defect function that quantifies the failure of left invariance for finitely additive means, and define the defect of a group as the infimum of these. We then prove a dichotomy: the defect for a group is either 0 or 1, with 0 characterising amenable groups.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21351v1",
    "categories": [
      "math.CO",
      "cs.DM",
      "math.NT"
    ],
    "authors": [
      "Arthur Forey",
      "Javier Fresán",
      "Emmanuel Kowalski",
      "Yuval Wigderson"
    ],
    "title": "Spectrally indistinguishable pseudorandom graphs",
    "abstract": "We construct explicit families of graphs whose eigenvalues are asymptotically distributed according to Wigner's semicircle law; in other words, that are spectrally indistinguishable from random graphs. However, in other respects they are strikingly dissimilar from random graphs; for example, they are $K_{2,3}$-free graphs with almost the maximum possible edge density.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21210v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Meisam Tavakoli",
      "Fabian Jakob",
      "Guido Carnevale",
      "Giuseppe Notarstefano",
      "Andrea Iannelli"
    ],
    "title": "Accelerated ADMM: Automated Parameter Tuning and Improved Linear Convergence",
    "abstract": "This work studies the linear convergence of an accelerated scheme of the Alternating Direction Method of Multipliers (ADMM) for strongly convex and Lipschitz-smooth problems. We use the methodology of expressing the accelerated ADMM as a Lur'e system, i.e., an interconnection of a linear dynamical system in feedback with a slope-restricted operator, and we use Integral Quadratic Constraints to establish linear convergence. In addition, we propose several parameter tuning heuristics and their impact on the convergence rate through numerical analyses. Our new bounds show significantly improved linear convergence rates compared to the vanilla algorithm and previous proposed accelerated variants, which is also empirically validated on a LASSO regression benchmark.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21324v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Zhangchi Chen",
      "Zihao Ye"
    ],
    "title": "Distributions of bounded real sequences and Astorg-Thaler's question",
    "abstract": "While studying the existence of wandering domains in complex dynamics, Astorg-Thaler posed a question concerning the distribution of bounded real sequences: for $α>1$ that has the Pisot property, is $\\frac{β\\lnα}{α-1}\\in\\mathbb{Q}$ necessary for the existence of an increasing sequence of integers $(n_k)_{k\\geqslant 1}$ such that $(n_{k+1}-αn_k-β\\ln n_k)_{k\\geqslant 1}$ converges to a cycle? When $α$ is an algebraic number, we answer Astorg-Thaler's question in the affirmative.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21061v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "József Balogh",
      "Peter Bradshaw",
      "Ramon I. Garcia",
      "Bernard Lidický"
    ],
    "title": "Density of rainbow triangles and properly colored $K_4$'s",
    "abstract": "T.-W. Chao and H.-H. H. Yu showed in 2023 that a graph with $R$ red, $G$ green, and $B$ blue edges has at most $\\sqrt{2 RGB}$ rainbow triangles. They proved this bound using the entropy method. We give a computer-free flag-algebra proof of this bound, and we also convert our proof into a classical counting proof. The ideas in our proof lead to an even shorter entropy proof. We also show uniqueness of the extremal construction.\n  Additionally, we prove a similar result that gives a sharp upper bound on the number of properly $3$-edge-colored $K_4$'s in graphs with $R$ red, $G$ green and $B$ blue edges.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21333v1",
    "categories": [
      "math.CO",
      "hep-th",
      "math.AC",
      "math.AG"
    ],
    "authors": [
      "Benjamin Hollering",
      "Elia Mazzucchelli",
      "Matteo Parisi",
      "Bernd Sturmfels"
    ],
    "title": "Varieties of Lines in 3-Space",
    "abstract": "We consider configurations of lines in 3-space with incidences prescribed by a graph. This defines a subvariety in a product of Grassmannians. Leveraging a connection with rigidity theory in the plane, for any graph, we determine the dimension of the incidence variety and characterize when it is irreducible or a complete intersection. We study its multidegree and the family of Schubert problems it encodes. Our spanning-tree coordinates enable efficient symbolic computations. We also provide numerical irreducible decompositions for incidence varieties with up to eight lines. These constructions with lines play a key role in the Landau analysis of scattering amplitudes in particle physics.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21602v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Chenxu Feng",
      "Chenxu Hao"
    ],
    "title": "The Exact Limsup Constant for Once-Visited Sites of One-Dimensional Simple Random Walk",
    "abstract": "For a one-dimensional simple random walk, let $g_1(n)$ denote the number of sites visited exactly once at time $n$. Major (1988) proved that $$\\limsup_{n\\to\\infty}\\frac{g_1(n)}{\\log^2n}=C\\qquad a.s.$$ where $C$ is a positive and finite constant. While this result settled the question of existence, the value of $C$ remained unknown.\n  In this paper, we determine that $C=1/16$. The main novelty of our work lies in introducing a self-boosting iterative framework for analysis.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21670v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Titus Lupu",
      "Wendelin Werner"
    ],
    "title": "Intensity doubling for Brownian loop-soups in high dimensions",
    "abstract": "We derive an intensity doubling feature of critical Brownian loop-soups on the cable-graphs of ${\\mathbb Z}^d$ for $d \\ge 7$ that can be described as follows: In the box $[-N, N]^d$ (and with a probability that goes to $1$ as $N$ goes to infinity), the set of all clusters of Brownian loops that do contain proper self-avoiding cycles of diameter comparable to $N$ can be decomposed into two identically distributed families: (a) The collection of clusters that do contain a large Brownian loop from the loop-soup (and therefore do automatically contain such a large cycle) (b) The collection of clusters that contain no macroscopic loop from the loop-soup (more specifically, no loop of diameter greater than $N^β$ when $β> 4/ (d-2)$ is fixed) but nevertheless contain a large cycle. In particular, due to the fact that these two families are asymptotically identically distributed, large cycles formed in case (b) by chains of small Brownian loops (i.e., all of diameter much smaller than $N$) will look like large Brownian loops themselves, and form a second independent \"ghost\" critical loop-soup in the scaling limit. Reformulated in terms of the Gaussian free field on such cable-graphs, this shows that large cycles in the collection of its sign clusters will converge in the scaling limit to a Brownian loop-soup with twice the usual critical intensity. This result had been conjectured by the first author in arXiv:2209.07901 [math.PR] ; our proof builds heavily on the second author's switching property for such loop-soups from arXiv:2502.06754 [math.PR] .",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21646v1",
    "categories": [
      "math.PR",
      "econ.GN",
      "math.AP",
      "math.OC"
    ],
    "authors": [
      "Filippo de Feo",
      "Fausto Gozzi",
      "Andrzej Święch",
      "Lukas Wessels"
    ],
    "title": "Stochastic Optimal Control of Interacting Particle Systems in Hilbert Spaces and Applications",
    "abstract": "Optimal control of interacting particles governed by stochastic evolution equations in Hilbert spaces is an open area of research. Such systems naturally arise in formulations where each particle is modeled by stochastic partial differential equations, path-dependent stochastic differential equations (such as stochastic delay differential equations or stochastic Volterra integral equations), or partially observed stochastic systems. The purpose of this manuscript is to build the foundations for a limiting theory as the number of particles tends to infinity. We prove the convergence of the value functions $u_n$ of finite particle systems to a function $\\mathcal{V}$, {which} is the unique {$L$}-viscosity solution of the corresponding mean-field Hamilton-Jacobi-Bellman equation {in the space of probability measures}, and we identify its lift with the value function $U$ of the so-called ``lifted'' limit optimal control problem. Under suitable additional assumptions, we show $C^{1,1}$-regularity of $U$, we prove that $\\mathcal{V}$ projects precisely onto the value functions $u_n$, and that optimal (resp. optimal feedback) controls of the particle system correspond to optimal (resp. optimal feedback) controls of the lifted control problem started at the corresponding initial condition. To the best of our knowledge, these are the first results of this kind for stochastic optimal control problems for interacting particle systems of stochastic evolution equations in Hilbert spaces. We apply the developed theory to problems arising in economics where the particles are modeled by stochastic delay differential equations and stochastic partial differential equations.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21442v1",
    "categories": [
      "math.AG",
      "math.CO"
    ],
    "authors": [
      "Alheydis Geiger",
      "Francesca Zaffalon"
    ],
    "title": "The Self-Projecting Grassmannian",
    "abstract": "We introduce the self-projecting Grassmannian, an irreducible subvariety of the Grassmannian parametrizing linear subspaces that satisfy a generalized self-duality condition. We study its relation to classical moduli spaces, such as the moduli spaces of pointed curves of genus $g$, as well as to other natural subvarieties of the Grassmannian. We further translate the self-projectivity condition in the combinatorial language of matroids, introducing self-projecting matroids, and we computationally investigate their realization spaces inside the self-projecting Grassmannian.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21616v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Umberto Pappalettera",
      "Francesco Triggiano"
    ],
    "title": "Dissipative solutions to Stochastic 3D Euler equations",
    "abstract": "We construct probabilistically strong solutions to the three-dimensional Euler equations perturbed by additive noise that are $\\mathbb{P}$-almost surely continuous in time, Hölder in space, and satisfy the local energy inequality up to an arbitrarily large stopping time.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20827v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Atsushi Ito",
      "Joaquín Moraga",
      "Debaditya Raychaudhury",
      "Wern Yeong"
    ],
    "title": "Hyperbolicity of adjoint linear series on varieties with positive tangent bundle",
    "abstract": "Let $X$ be a smooth projective variety of dimension $n\\geq 3$, and let $L$ be an ample line bundle on $X$. In this article, we study the algebraic hyperbolicity of a very general section of the adjoint linear series $|K_X+mL|$ when the tangent bundle $T_X$ of $X$ has suitable positivity properties. As a consequence, we show that the linear system $|K_X+mL|$ is hyperbolic (or pseudo-hyperbolic) for $m\\geq 3n+1$, for various classes of polarized pairs $(X,L)$, thus providing new evidence of a conjecture that was proposed by the second and fourth authors. Moreover, when $X$ is abelian, we show that the linear system $|mL|$ is hyperbolic for $m\\geq n$, and the same holds when $m\\geq n-1$, if $|L|$ has no base divisors. It turns out that these bounds for abelian varieties are sharp. We also prove analogous statements for Kummer varieties and certain classes of hyperelliptic varieties.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20789v1",
    "categories": [
      "math-ph",
      "math.SG"
    ],
    "authors": [
      "Ivan Contreras",
      "Nicolas Martinez-Alba",
      "Rajan Amit Mehta"
    ],
    "title": "Graded Contact Geometry and the AKSZ Formalism",
    "abstract": "The AKSZ formalism is a construction of topological field theories where the target spaces are differential graded symplectic manifolds. In this paper, we describe an analogue of the AKSZ formalism where the target spaces are differential graded contact manifolds. We show that the space of fields inherits a weak contact structure, and we construct a solution to the analogue of the classical master equation, defined via the Jacobi bracket. In the $n=1$ case, we recover the Jacobi sigma model, and in the $n=2$ case, we obtain three-dimensional topological field theories associated to Courant-Jacobi algebroids.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20687v1",
    "categories": [
      "math.NA",
      "cs.AI",
      "math-ph"
    ],
    "authors": [
      "Irina Tezaur",
      "Eric Parish",
      "Anthony Gruber",
      "Ian Moore",
      "Christopher Wentland",
      "Alejandro Mota"
    ],
    "title": "Hybrid coupling with operator inference and the overlapping Schwarz alternating method",
    "abstract": "This paper presents a novel hybrid approach for coupling subdomain-local non-intrusive Operator Inference (OpInf) reduced order models (ROMs) with each other and with subdomain-local high-fidelity full order models (FOMs) with using the overlapping Schwarz alternating method (O-SAM). The proposed methodology addresses significant challenges in multiscale modeling and simulation, particularly the long runtime and complex mesh generation requirements associated with traditional high-fidelity simulations. By leveraging the flexibility of O-SAM, we enable the seamless integration of disparate models, meshes, and time integration schemes, enhancing computational efficiency while maintaining high accuracy. Our approach is demonstrated through a series of numerical experiments on complex three-dimensional (3D) solid dynamics problems, showcasing speedups of up to 106x compared to conventional FOM-FOM couplings. This work paves the way for more efficient simulation workflows in engineering applications, with potential extensions to a wide range of partial differential equations.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21041v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Masashi Wakaiki"
    ],
    "title": "Data-driven control of continuous-time systems: A synthesis-operator approach",
    "abstract": "This paper addresses data-driven control of continuous-time systems. We develop a framework based on synthesis operators associated with input and state trajectories. A key advantage of the proposed method is that it does not require the state derivative and uses continuous-time data directly without sampling or filtering. First, systems compatible with given data are described by the synthesis operators into which data trajectories are embedded. Next, we characterize data informativity properties for system identification and for stabilization. Finally, we establish a necessary and sufficient condition for informativity for quadratic stabilization in the presence of process noise. This condition is formulated as linear matrix inequalities by exploiting the finite-rank structure of the synthesis operators.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21023v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Xiaoxu Xu",
      "Guanghui Hu"
    ],
    "title": "Simultaneously recover two constant coefficients and a polygon with a single pair of Cauchy data for the Helmholtz equation",
    "abstract": "This paper is concerned with an inverse boundary value problem for the Helmholtz equation over a bounded domain. The aim is to reconstruct two constant coefficients together with the location and shape of a Dirichlet polygonal obstacle from a single pair of Cauchy data. Uniqueness results are verified under some a priori assumptions and the one-wave factorization method has been adapted to recover the polygonal obstacle as well as the two coefficients. A modified factorization using the Dirichlet-to-Neumann operator is employed to overcome difficulties arising from possible eigenvalues. Intensive numerical examples indicate that our method is efficient.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20988v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Guowei Dai",
      "Yingxin Sun"
    ],
    "title": "A sharp bound for the ratio of the first two eigenvalues of Robin Laplacian",
    "abstract": "The celebrated conjecture by Payne, Pólya and Weinberger (1956) states that for the fixed membrane problem, the ratio of the first two eigenvalues, $λ_2/λ_1$, is maximized by a disk. A more general dimensional version of this conjecture was later resolved by Ashbaugh and Benguria in the 1990s. For the Robin Laplacian, Payne and Schaefer (2001) formulated an analogous conjecture, positing that the ratio $μ_2/μ_1$ is also maximized by a disk for a range of the boundary parameter $σ$. This was later restated by Henrot in 2003. In this work, we affirm this conjecture for all dimensions $N\\geq2$ and for all $σ$ greater than or equal to a critical positive value $σ_*$ which may depend on $Ω$. Furthermore, we prove that the maximum value of $μ_2/μ_1$ is strictly decreasing in $σ$ over the entire interval $(0,+\\infty)$. Our result provides a positive answer to a variant of Yau's Problem 77: by measuring the ratio of the first two eigenfrequencies, one can determine whether an elastically supported drum is circular.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20958v1",
    "categories": [
      "math.QA",
      "math.CT",
      "math.FA",
      "math.OA"
    ],
    "authors": [
      "Alexandru Chirvasitu",
      "Andre Kornell"
    ],
    "title": "A new characterization of Kac-type discrete quantum groups",
    "abstract": "We obtain two related characterizations of discrete quantum groups and discrete quantum groups of Kac type as allegorical group objects in the symmetric monoidal dagger category of quantum sets and relations, of interest to quantum predicate logic and quantum information theory. Specifically, we characterize discrete quantum groups by the existence of an inversion relation and discrete quantum groups of Kac type by the existence of an inversion function. This confirms a conjectured description of discrete quantum groups of Kac type and brings them within the purview of category-internal universal algebra.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20949v1",
    "categories": [
      "math.DG",
      "math.GR"
    ],
    "authors": [
      "Richard Canary",
      "Tengren Zhang",
      "Andrew Zimmer"
    ],
    "title": "A rigidity theorem for complex Kleinian groups",
    "abstract": "Farre, Pozzetti and Viaggi proved that any (d-k)-hyperconvex subgroup of PSL(d,C) is virtually isomorphic to a convex cocompact Kleinian group and that its k-th simple root critical exponent is at most 2. We show that a (d-k)-hyperconvex subgroup is isomorphic to a uniform lattice in PSL(2,C) if and only if its k-th simple root critical exponent is exactly 2. Furthermore, we show that if a strongly irreducible (d-k)-hyperconvex subgroup has k-th simple root critical exponent 2, then it is the image of a uniform lattice in PSL(2, C) by an irreducible representation of PSL(2, C) into PSL(d, C).",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20905v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Anna Lyubarskaja",
      "Dominik Rothenhäusler"
    ],
    "title": "Nonparametric Regression for Random Unbiased Perturbations",
    "abstract": "We study nonparametric regression with covariates $X$ and outcome $Y$ under random unbiased perturbations (RUPs) of the conditional distribution $Y|X$, where the marginal distribution of covariates, $P^X$, remains fixed but the conditional law, $P^{Y|X}$, varies randomly across datasets. Unlike adversarial distribution shift frameworks that yield conservative worst-case guarantees, RUPs induce dataset-level variance inflation rather than systematic bias. We provide examples of RUPs and show that this distributional uncertainty reduces the effective sample size to $n_{\\mathrm{eff}} = n/(1 + n τ)$, where $τ\\in [0,1]$ quantifies the perturbation strength. For local polynomial estimators, we derive an extended bias-variance decomposition that includes a distributional variance term with the same bandwidth scaling as classical sampling variance. This leads to a modified bandwidth selection principle: when distributional uncertainty dominates sampling uncertainty ($τ\\gg 1/n$), optimal bandwidths scale as $τ^{1/(2β+1)}$ rather than the usual $n^{-1/(2β+1)}$, where $β$ indicates the smoothness of the function class considered. We also establish matching minimax lower bounds showing that there exists an RUP for which this effective sample size $n_{\\mathrm{eff}}$ is fundamental. Our results demonstrate that random dataset-level perturbations create a distinct mode of uncertainty that affects both practical tuning and fundamental statistical limits.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21303v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Kai Sheng"
    ],
    "title": "Normalized Solutions for Schroedinger-Bopp-Podolsky Systems in Bounded Domains with General Nonlinearities",
    "abstract": "In this paper, by adapting the perturbation method, we study normalized standing wave solutions for the following nonlinear Schrodinger-Bopp-Podolsky system:\n  - Delta u + q(x) phi u = omega u + f(u) in Omega, - Delta phi + a^2 Delta^2 phi = q(x) u^2 in Omega,\n  where Omega is a smooth bounded domain in R^3, a > 0, and omega is the Lagrange multiplier associated with the L^2 mass constraint integral over Omega of u^2 equals mu, and f: R -> R is a continuous function satisfying some technical conditions. In particular, we prove the existence of normalized solutions for all masses mu in an interval (0, mu_0), under either Navier or Neumann boundary conditions for phi. Moreover, when f is odd, we obtain multiplicity of normalized solutions; and if Omega is star-shaped, we further obtain a normalized ground state solution.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21294v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Minling Li",
      "Changzhen Sun",
      "Chao Wang",
      "Dongyi Wei",
      "Zhifei Zhang"
    ],
    "title": "Transition threshold for the Navier-Stokes-Coriolis system at high Reynolds numbers",
    "abstract": "The transition mechanism from laminar flow to turbulent flow is a central problem in hydrodynamic stability theory. To shed light on this transition mechanism, Trefethen et al.({\\it \\small Science 1993}) proposed the transition threshold problem, aiming to quantify the magnitude of perturbations required to trigger instability and determine their scaling with the Reynolds number. In this paper, we investigate the transition threshold of Couette flow for the three-dimensional incompressible Navier-Stokes-Coriolis system in the high Reynolds number regime ($\\mathrm{Re}\\gg 1$). By exploiting the combined effects of rotation (dispersion) and mixing mechanisms, we derive an improved stability threshold scaling in $\\mathrm{Re}$. Precisely, we show that if the initial perturbation satisfies $$\\|v_{in}-(y, 0, 0)\\|_{\\tilde{H}(\\mathbb T \\times \\mathbb D)}\\leq ε_0 \\,\\mathrm{Re}^{-α},$$ with any $α>\\frac 23$ and $\\tilde{H}=H^6 \\cap W^{3,1}$ for $\\mathbb D=\\mathbb{R}^2$, and with any $α\\geq\\frac 56$ and $\\tilde{H}=H^6$ for $\\mathbb D=\\mathbb{R}\\times\\mathbb{T}$, the corresponding solution of the Navier-Stokes-Coriolis system exists globally in time and remains asymptotically close to the Couette flow. The main analytical challenge arises from the anisotropic nature of the estimates for the zero modes and from the interactions between zero and non-zero modes, which we address using an anisotropic Sobolev space directly tailored to the zero modes. Additionally, we introduce a new dispersive structure for the zero modes and derive suitable Strichartz-type estimates. These tools enable us to exploit both the nonlinear structure and the improved dispersive behavior of certain good components of the zero modes, which play a crucial role in achieving the improved stability threshold.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21279v1",
    "categories": [
      "math.RT",
      "math.RA"
    ],
    "authors": [
      "Emanuele Di Bella",
      "Willem A. de Graaf",
      "Andrea Santi"
    ],
    "title": "Classification of nilpotent and semisimple fourvectors of a real eight-dimensional space",
    "abstract": "In 1981 Antonyan classified the orbits of SL$(8,\\mathbb{C})$ on $\\bigwedge^4 \\mathbb{C}^8$. This is an example of a $θ$-group action as introduced and studied by Vinberg. The orbits of a $θ$-group are divided into three classes: nilpotent, semisimple and mixed. We consider the action of SL$(8,\\mathbb{R})$ on $\\bigwedge^4 \\mathbb{R}^8$ and classify the nilpotent and semisimple orbits as well as the Cartan subspaces. The semisimple orbits are divided into 1441 parametrized classes. Due to this high number a classification of the mixed orbits does not seem feasible. Our methods are based on Galois cohomology.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21241v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Pascal Autissier",
      "Jean-Philippe Furter",
      "Egor Yasinsky"
    ],
    "title": "Iterated polynomials are dense",
    "abstract": "For any infinite field k and any positive integer r, we show constructively that the map sending each polynomial P $\\in$ k[x] to its r-th iterate is dominant in various inductive limit topologies on the space of all polynomials.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21175v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Mattia Brescia",
      "Bernardo Giuseppe Di Siena",
      "Ernesto Ingross",
      "Marco Trombetti"
    ],
    "title": "The Pseudocentre of a Group",
    "abstract": "In 1973, Jim Wiegold introduced the concept of pseudocentre P(G) of a group G as the intersection of the normal closures of the centralizers of its elements. He proved that the pseudocentre of a non-trivial finite group is always non-trivial, giving a new variable on which one can use induction in finite group theory. In the same paper, Wiegold states that no obvious relations seem to hold between the pseudocentre and the canonical characteristic subgroups of a group.\n  The aim of this work is to show that the pseudocentre is indeed much more involved in the structure of an arbitrary group then anyone could have expected. For example, we prove that a soluble group coincides with its pseudocentre if and only if it is abelian, and that the structure of the commutator subgroup strongly influences the structure of the pseudocentre. And this is not the end of the story. In fact, the behaviour of the pseudocentre in arbitrary (possibly infinite) groups can be extremely wild: sometimes it is very difficult even to understand whether the pseudocentre is trivial or not. This wilderness is exampled by some of our main results (see the introduction for a complete list):\n  1) There exists a polycyclic group of Hirsch length 3 in which the pseudocentre is trivial. 2) The pseudocentre of the group of unitriangular matrices over any field is the largest term of the upper central series that is abelian. 3) Free products have a trivial pseudocentre, but there exist amalgamated free products of non-trivial groups coinciding with their pseudocentre. 4) Weakly regular branch groups have a trivial pseudocentre. 5) The pseudocentre of the Thompson group is the derived subgroup. 6) Wreath products can have a totally arbitrary pseudocentre.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21163v1",
    "categories": [
      "math.QA",
      "math.AC"
    ],
    "authors": [
      "Hua Sun",
      "Hui-Xiang Chen",
      "Libin Li",
      "Yinhuo Zhang"
    ],
    "title": "The Projective Class Rings of Drinfeld doubles of pointed rank one Hopf algebras",
    "abstract": "Let $\\Bbbk$ be an algebraically closed field of characteristic $0$. In this paper, we study the Grothendieck ring $G_0(D(H_\\mathcal{D}))$ and the projective class ring $r_p(D(H_\\mathcal{D}))$ of the Drinfeld double $D(H_{\\mathcal{D}})$ of the rank one pointed Hopf algebra $H_{\\mathcal{D}}$. We analyze the tensor products of simple modules with simple modules, simple modules with indecomposable projective modules, and indecomposable projective modules with indecomposable projective modules, providing explicit decomposition rules in each case. Finally, we compute both the Grothendieck ring $G_0(D(H_\\mathcal{D}))$ and the projective class ring $r_p(D(H_\\mathcal{D}))$, and present these two rings in terms of generators and defining relations.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21564v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Adrian Nachman",
      "Peter Perry",
      "Daniel Tataru"
    ],
    "title": "Large data global well-posedness for the modified Novikov-Veselov system",
    "abstract": "The modified Novikov-Veselov system (mNV) is a cubic third order dispersive evolution in two space dimensions. It is also completely integrable, belonging to the same hierarchy as the defocusing Davey-Stewartson II (DS II) system.\n  The mNV system is $L^2$ critical. Some time ago, Schottdorf proved that for small $L^2$ initial data, the mNV equation is globally well-posed. In this article, we consider instead the large data problem, using inverse scattering methods. Our main result asserts that the mNV system is globally well-posed for large $L^2$ data, with the solutions scattering as time goes to $\\pm \\infty$. One key ingredient in the proof, which is of independent interest, is a new nonlinear Gagliardo-Nirenberg inequality for the associated scattering transform.\n  As a byproduct of our main result, we are also able to prove a global well-posedness result for the closely related Novikov-Veselov problem at the critical $\\dot H^{-1} + L^1$ level, for a range of data which can heuristically be described as soliton-free. Here we use the associated Miura map to connect the mNV and the NV flows. In order to characterize the range of the Miura map, we prove another result of independent interest, namely a sharp, scale invariant form of the Agmon-Allegretto-Piepenbrink principle in the critical case of two space dimensions.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21545v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Tarcios Andrey Ferreira",
      "João Paulo dos Santos"
    ],
    "title": "Rigidity of Solitons to the Mean Curvature Flow in $\\mathbb{H}^3$ as Translation Surfaces",
    "abstract": "In the half-space model of the hyperbolic three space with the hyperbolic metric, this same space can be seen as the Lie group, hence, a translation surface is a surface that is given by the product of two curves $α$ and $β$ in this group. Here we present the rigidity of this kind of surfaces for some particular products in the context of minimal surfaces and solitons to the Mean Curvature Flow, also known as self-similar solutions.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21521v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Alex Bols",
      "Boris Kjaer"
    ],
    "title": "Sector theory of Levin-Wen models I : Classification of Anyon Sectors",
    "abstract": "We classify the irreducible anyon sectors of Levin-Wen models over an arbitrary unitary fusion category $\\mathcal{C}$, showing that they are in one-to-one correspondence with equivalence classes of simple objects of the Drinfeld center $Z(\\mathcal{C})$. We achieve this by making explicit how the Levin-Wen Hamiltonian stabilizes subspaces isomorphic to state spaces of the corresponding Turaev-Viro TQFT, and developing a detailed understanding of these state spaces on punctured disks. In particular, we construct Drinfeld insertion operators on such spaces which can move anyons between the punctures, and can change their fusion channels. Using these Drinfeld insertions, we construct explicit string operators that excite anyons above the ground state. The fusion and braiding properties of these anyons will be analysed in a companion paper.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21518v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Olivier Bilenne",
      "Frédéric Meunier"
    ],
    "title": "An exact method for a problem of time slot pricing",
    "abstract": "A company provides a service at different time slots, each slot being endowed with a capacity. A non-atomic population of users is willing to purchase this service. The population is modeled as a continuous measure over the preferred times. Every user looks at the time slot that minimizes the sum of the price assigned by the company to this time slot and the distance to their preferred time. If this sum is non-negative, then the user chooses this time slot for getting the service. If this sum is positive, then the user rejects the service.\n  We address the problem of finding prices that ensure that the volume of users choosing each time slot is below capacity, while maximizing the revenue of the company. For the case where the distance function is convex, we propose an exact algorithm for solving this problem in time $O(n^3|P|^3)$, where $P$ is the set of possible prices and $n$ is the number of time slots. For the case where the prices can be any real numbers, this algorithm can also be used to find asymptotically optimal solutions in polynomial time under mild extra assumptions on the distance function and the measure modeling the population.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21491v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Yun Liu",
      "Chen Cui",
      "Shi Shu",
      "Zhen Wang"
    ],
    "title": "Vertex-based Graph Neural Solver and its Application to Linear Elasticity Equations",
    "abstract": "The numerical solution of linear elasticity equations on unstructured grids presents significant difficulties, especially in the presence of heterogeneous and anisotropic materials. To tackle these challenges, we introduce a novel vertex-based graph Fourier neural solver. This framework seamlessly integrates a block-Jacobi smoothing stage, known for rapidly attenuating certain high-frequency errors, with a learnable Fourier-domain module designed to correct errors across the remained frequency spectrum. Extensive numerical experiments on 2D and 3D problems verify that our proposed solver exhibits superior robustness and efficiency, significantly surpassing the classical smoothed aggregation algebraic multigrid method. Moreover, frequency domain analysis empirically confirms the essential complementarity between the smoother and the neural corrector.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21481v1",
    "categories": [
      "math.LO",
      "math.CO"
    ],
    "authors": [
      "Lorenzo Carlucci",
      "Giordano Celli"
    ],
    "title": "Weihrauch reducibility between Ramsey-type theorems and well-ordering principles at the level of $Σ^0_2$-induction: A pilot study",
    "abstract": "We study the relations under Weihrauch reducibility of the well-ordering preservation principle for the operator $X \\mapsto X^ω$ and the Ordered Ramsey Theorem. Both principles are known to be equivalent to $Σ^0_2$-induction in Reverse Mathematics.\n  We show that the Ordered Ramsey Theorem is Weihrauch-equivalent to the parallel product of the well-ordering preservation principle for the operator $X \\mapsto X^ω$ and the Eventually Constant Tail principle.\n  By previous work from Pauly, Pradic and Soldà, the Ordered Ramsey Theorem is known to be Weihrauch-equivalent to the parallel product of the Eventually Constant Tail principle and the parallelization of the jump of the Limited Principle of Omniscience. We show that the latter pinciple and the well-ordering preservation principle for $X \\mapsto X^ω$ are Weihrauch-incomparable.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21372v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Alessandro Cannone",
      "Silvia Cingolani",
      "Minbo Yang",
      "Shunneng Zhao"
    ],
    "title": "Qualitative properties of single blow-up solutions for nonlinear Hartree equation with slightly subcritical exponent",
    "abstract": "In this paper, we study the qualitative properties of single blow-up solutions to the nonlocal equations with slightly subcritical exponents \\begin{equation*}\n  -Δu=(|x|^{-(n-2)}\\ast u^{p-ε})u^{p-1-ε}\\quad \\mbox{in}~~Ω,~~ u=0\\quad \\mbox{on}~~\\partialΩ,\n  \\end{equation*} where $Ω$ is a smooth bounded domain in $\\mathbb{R}^n$ for $n=3,4,5$, $\\ast$ denotes the standard convolution, $ε>0$ is a small parameter and $p=\\frac{n+2}{n-2}$ is $\\mathcal{D}^{1,2}$ energy-critical exponent. By exploiting various local Pohozaev identities and blow-up analysis, we provide a number of estimates on the first $(n+2)$-eigenvalues and their corresponding eigenfunctions, and examine the qualitative behavior of the eigenpairs $(λ_{i,ε}, v_{i,ε})$ to the linearied problem of the above nonlocal equations for $i=1,\\cdots,n+2$. As a corollary, we derive the Morse index of a single-bubble solution in a nondegenerate setting.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21370v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "A. M. Kabaeva",
      "A. V. Logachov",
      "A. A. Yambartsev"
    ],
    "title": "Bounds for the Success Probability in the Odds Theorem",
    "abstract": "Bruss's odds theorem \\cite{Bruss1} addresses the problem of determining the optimal stopping time for sequences of independent indicator functions. In this note, we derive upper and lower bounds for the success probability under the optimal stopping rule. These bounds depend on the number of independent events under consideration and on a deterministic index specifying the stopping time. Moreover, the bounds are sharp: we provide explicit examples in which the corresponding inequalities are attained with equality.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21684v1",
    "categories": [
      "math.LO",
      "math.CO"
    ],
    "authors": [
      "Brian Ransom"
    ],
    "title": "On BPI in Symmetric Extensions Part 1",
    "abstract": "Historically, proofs of $\\mathrm{BPI}$ in models without choice have relied on a contradiction framework that was introduced by Halpern. We introduce the filter extension property for permutation models and symmetric extensions, which formalizes the naïve approach to extend arbitrary filters to ultrafilters by repeatedly extending filters by minimal increments. We use this framework to give the first direct proof of $\\mathrm{BPI}$ in the generalized Cohen model $N(I,Q)$ -- a model that adds a Dedekind-finite set of mutually $Q$-generic filters over a ground model $M\\vDash\\mathrm{ZFC}$. In the case that the index set $I$ is large, we adapt Harrington's proof of the Halpern-Läuchli theorem to prove the result. We then extend the results from Karagila and Schlicht to show that $I$ can be assumed to be large without loss of generality. The approach given by Harrington's proof is essentially dynamical, and we show that this technique can be used in permutation models to reprove a direction of Blass' theorem: that a dynamical condition called the Ramsey property is sufficient for $\\mathrm{BPI}$ to hold in a permutation model. We then introduce a dynamical generalization of the Ramsey property called the virtual Ramsey property, which abstracts core features of our adaptation of Harrington's proof, and we prove that the virtual Ramsey property is sufficient for $\\mathrm{BPI}$ to hold in a symmetric extension.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21639v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Nikolai A. Krylov"
    ],
    "title": "Lower central series of the Riordan group over the field with two elements",
    "abstract": "The Riordan group ${\\cal R}$ over the field ${\\mathbb F}_2$ is a split extension of the Appell subgroup by the Nottingham group ${\\cal N}({\\mathbb F}_2)$. Using the lower central series of the Nottingham group obtained by C. Leedham-Green and S. McKay, the lower central series of ${\\cal R}({\\mathbb F}_2)$ is calculated. It is also proved that the abelianization of the Riordan group over any commutative ring with identity is isomorphic to the direct product of the abelianization of the corresponding Lagrange subgroup, the additive group of the ring, and its multiplicative groups of units.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21620v1",
    "categories": [
      "math.NA",
      "math.PR"
    ],
    "authors": [
      "Jina Yang",
      "Ky Quan Tran"
    ],
    "title": "Mean-square exponential stability of exact and numerical solutions for neutral stochastic delay differential equations with Markovian switching",
    "abstract": "This paper investigates the mean-square exponential stability of neutral stochastic differential delay equations (NSDDEs) with Markovian switching. The analysis addresses the complexities arising from the interaction between the neutral term, time-varying delays, and structural changes governed by a continuous-time Markov chain. We establish novel and practical criteria for the mean-square exponential stability of both the underlying system and its numerical approximations via the Euler-Maruyama method. Furthermore, we prove that the numerical scheme can reproduce the exponential decay rate of the true solution with arbitrary accuracy, provided the step size is sufficiently small. The theoretical results are supported by a numerical example that illustrates their effectiveness.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21593v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Akash Vyas",
      "Shreyas Kumar",
      "Jayant Kumar Mohanta",
      "Ravi Prakash"
    ],
    "title": "Closed Form HJB Solution for Continuous-Time Optimal Control of a Non-Linear Input-Affine System",
    "abstract": "Designing optimal controllers for nonlinear dynamical systems often relies on reinforcement learning and adaptive dynamic programming (ADP) to approximate solutions of the Hamilton Jacobi Bellman (HJB) equation. However, these methods require iterative training and depend on an initially admissible policy. This work introduces a new analytical framework that yields closed-form solutions to the HJB equation for a class of continuous-time nonlinear input-affine systems with known dynamics. Unlike ADP-based approaches, it avoids iterative learning and numerical approximation. Lyapunov theory is used to prove the asymptotic stability of the resulting closed-loop system, and theoretical guarantees are provided. The method offers a closed-form control policy derived from the HJB framework, demonstrating improved computational efficiency and optimal performance on state-of-the-art optimal control problems in the literature.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21231v1",
    "categories": [
      "math.QA",
      "hep-th",
      "math-ph"
    ],
    "authors": [
      "Aaron Hofer",
      "Ingo Runkel"
    ],
    "title": "Non-semisimple CFT/TFT correspondence I: General setup",
    "abstract": "We extend the TFT construction of CFT correlators of [arXiv:hep-th/0204148] to so-called finite logarithmic CFTs for which the algebraic input data is no longer semisimple but still finite. More specifically, starting from the data of a chiral CFT given in the form of a not necessarily semisimple modular tensor category C we use a three dimensional topological field theory with surface defects based on the surgery TFT of [arXiv:1912.02063] to construct a full CFT as a braided monoidal oplax natural transformation.\n  We make our construction explicit in the example of the transparent surface defect, resulting in the so-called Cardy case. In particular, we consider topological line defects and their action on bulk fields in these logarithmic CFTs, providing a source of examples for non-invertible and non-semisimple topological symmetries.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21421v1",
    "categories": [
      "math.AG",
      "math-ph"
    ],
    "authors": [
      "Norman Do",
      "Paul Norbury"
    ],
    "title": "From double-scaled SYK correlators to Weil-Petersson volumes",
    "abstract": "Okuyama introduced a family of polynomials, whose coefficients depend on a parameter $q$, in his study of correlators in the double-scaled SYK model. He verified in small cases that their coefficients can be expressed in terms of certain $q$-zeta values and that the polynomials recover the Weil-Petersson volumes of moduli spaces studied by Mirzakhani under a certain $q \\to 1$ limit. In this paper, we provide mathematically rigorous proofs of these two phenomena. The authors previously defined natural $q$-deformations of the Weil-Petersson volumes of moduli spaces of curves. We prove that these polynomials appear as the top degree part of Okuyama's polynomials. Our work provides a link between the two topics of the title, which hints at a ``quantum'' Weil-Petersson geometry and a combinatorial-geometric approach to double-scaled SYK correlators.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20877v1",
    "categories": [
      "math.NA",
      "math.OC",
      "math.PR"
    ],
    "authors": [
      "Toby Anderson",
      "Max Collins",
      "Jamie Haddock",
      "Jackie Lok",
      "Elizaveta Rebrova"
    ],
    "title": "Beyond Expectation: Concentration Inequalities for Randomized Iterative Methods",
    "abstract": "Stochastic iterative methods are useful in a variety of large-scale numerical linear algebraic, machine learning, and statistical problems, in part due to their low-memory footprint. They are frequently used in a variety of applications, and thus it is imperative to have a thorough theoretical understanding of their behavior. Most theoretical convergence results for stochastic iterative methods provide bounds on the expected error of the iterates, and yield a type of average case analysis. However, understanding the behavior of these methods in the near-worst-case is desirable. For stochastic methods, this motivates providing bounds on the variance and concentration of their error, which can be used to generate confidence intervals around the bounds on their expected error.\n  Here, we provide upper bounds for the concentration and variance of the error of a general class of linear stochastic iterative methods, including the randomized Kaczmarz method and the randomized Gauss--Seidel method, and a more general class of nonlinear stochastic iterative methods, including the randomized Kaczmarz method for systems of linear inequalities.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21047v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Changjian Xie"
    ],
    "title": "A novel third-order accurate and stable scheme for micromagnetic simulations",
    "abstract": "High-fidelity numerical simulation serves as a cornerstone for exploring magnetization dynamics in micromagnetics. This work introduces a novel third-order temporally accurate and stable numerical scheme for the Landau-Lifshitz-Gilbert (LLG) equation, aiming to address the limitations in accuracy and efficiency often encountered with conventional approaches. Validation via nanostrip simulations confirms two principal advantages of the proposed method: it attains strict third-order temporal accuracy, surpassing many current techniques, and it offers superior computational efficiency, enabling rapid convergence without sacrificing numerical precision. For Gilbert damping coefficients $α$ ranging from $0.1$ to values below $10$, the scheme preserves strong stability and effectively avoids non-physical magnetization states. The magnetic microstructures predicted by this method are in excellent agreement with those from established benchmark methods, affirming its reliability for quantitative physical analysis. Salient distinctions between the proposed scheme and an existing third-order semi-implicit method include:\n  (1) Solving the linear system associated with the existing scheme demands substantially greater computational time, underscoring the need for highly efficient solvers;\n  (2) Although the proposed method shows increased sensitivity to damping parameters, it reliably converges to stable physical states and is effective in simulating magnetic domain wall motion, producing outcomes consistent with prior validated studies;\n  (3) The energy levels computed by the proposed method are significantly lower than those obtained via the existing third-order scheme.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20978v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tao Zhang",
      "Meixia Li",
      "Fan Yang",
      "Chunqin Zhou"
    ],
    "title": "The singular anisotropic Adams' type inequality in $\\mathbb{R}^n$",
    "abstract": "In this paper, using anisotropic rearrangement techniques, we first establish the best constants for the singular anisotropic Adams' type inequality with exact growth in $\\mathbb{R}^n$. Furthermore, by the same trick, we also prove the singular anisotropic Adams' type inequality on bounded domain $Ω\\subset \\mathbb{R}^n$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20971v1",
    "categories": [
      "math.NA",
      "math.FA",
      "math.SP"
    ],
    "authors": [
      "Marwa Ennaceur"
    ],
    "title": "Sharp Ascent--Descent Spectral Stability under Strong Resolvent Convergence",
    "abstract": "We establish sharp stability results for of non--selfadjoint the ascent and descent spectra under strong resolvent convergence (SRS), a natural framework for finite element approximations of non-selfadjoint and singularly perturbed operators. The key quantitative hypothesis is the reduced minimum modulus $γ(T-λ)>0$, which guarantees closed range and enables the transfer of the Kaashoek -- Taylor criteria via gap convergence of operator graphs. At the essential level, B--Fredholm theory extends stability to powers $(T-λ)^m$ provided $γ((T-λ)^j)>0$ for all $1\\le j\\le m$. We introduce a computable finite-element diagnostic $γ_h = σ_{\\min}(M^{-1/2}(A_h-λM)M^{-1/2})$, which serves as a practical surrogate for $γ(T-λ)$ and remains uniformly positive even in convection-dominated regimes when stabilized schemes (e.g., SUPG) are employed. Numerical experiments confirm that $\\liminf_{h\\to0}γ_h>0$ is both necessary and sufficient for spectral stability, while a Volterra-type counterexample demonstrates the indispensability of the closed-range condition for powers. The analysis clarifies why norm resolvent convergence fails for rough or singular limits, and how SRS-combined with quantitative control of $γ_h$--rescues ascent--descent stability in realistic computational settings.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20969v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Jiajie Li",
      "Xiang Ji",
      "Shenggao Zhou",
      "Shengfeng Zhu"
    ],
    "title": "Maximization of Supercapacitor Storage via Topology Optimization of Electrode Structures",
    "abstract": "As widely used electrochemical storage devices, supercapacitors deliver higher power density than batteries, but suffer from significantly lower energy density. In this work, we propose a topology optimization model for electrode structure to maximize energy storage in supercapacitors. The existence of minimizers to the resulting optimal control problem, which is constrained by a modified steady-state Poisson--Nernst--Planck system describing ionic electrodiffusion, has been theoretically established by using the direct method in the calculus of variation. Sensitivity analysis of the topology optimization model is performed to derive variational derivatives and corresponding adjoint equations. A gradient flow formulation discretized by a stabilized semi-implicit scheme is developed to solve the resulting topology optimization problem. Extensive numerical experiments present various porous electrode structures that own large area of electrode-electrolyte interface, demonstrating the effectiveness and robustness of the proposed topology optimization model and corresponding algorithm.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20932v1",
    "categories": [
      "math.CO",
      "math.PR"
    ],
    "authors": [
      "Vu Phan",
      "Ilie Ugarcovici"
    ],
    "title": "On the Expected Duration of a Generalized Bingo Game",
    "abstract": "We investigate the expected number of calls required to achieve Bingo in a generalized (n,m)-Bingo game, where each n x n card is filled by sampling n numbers from m possible values per column. Using the inclusion-exclusion principle, we derive exact formulas for the probability distribution and the expected game length. Our main theoretical result proves that the expected number of calls is a linear function of m.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20881v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "K. Ernest Bognini",
      "Hamdi Ammar"
    ],
    "title": "A new factorization of the generalized period-doubling sequences through kernel words and gaps sequences",
    "abstract": "In this paper, we study some new factorizations of period-doubling sequences over a $k$-letter alphabet, where $k\\geq 2$. First, we define the combinatorial and arithmetic properties of these sequences. Then, we define the kernel words of period-doubling sequences and demonstrate how to factorize a binary sequence using its kernel words. Next, we define gap sequences for period-doubling sequences and explore their relationship with kernel words. Lastly, we present a factorization of period-doubling sequences for $k\\geq 3$ based on kernel words and gap sequences.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20861v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "James P. Cossey",
      "Mark L. Lewis",
      "A. A. Schaeffer Fry",
      "Hung P. Tong-Viet"
    ],
    "title": "Sylow subgroups and the number of irreducible characters of degrees divisible by a prime $p$",
    "abstract": "Let $G$ be a finite group and $p$ a prime. We establish an upper bound for the derived length of a Sylow $p$-subgroup of $G$ in terms of the number of irreducible characters of $G$ whose degrees are divisible by $p$. We also prove that if $B$ is a $p$-block of a finite $p$-solvable group $G$ with defect group $D$, then the derived length of $D$ is at most one more than the number of ordinary irreducible characters of positive height in $B$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20843v1",
    "categories": [
      "math.OC",
      "cs.AI",
      "eess.SY",
      "math.FA",
      "math.NA"
    ],
    "authors": [
      "I. M. Ross",
      "M. Karpenko"
    ],
    "title": "A Review of Pseudospectral Optimal Control: From Theory to Flight",
    "abstract": "The home space for optimal control is a Sobolev space. The home space for pseudospectral theory is also a Sobolev space. It thus seems natural to combine pseudospectral theory with optimal control theory and construct ``pseudospectral optimal control theory,'' a term coined by Ross. In this paper, we review key theoretical results in pseudospectral optimal control that have proven to be critical for a successful flight. Implementation details of flight demonstrations onboard NASA spacecraft are discussed along with emerging trends and techniques in both theory and practice. The 2011 launch of pseudospectral optimal control in embedded platforms is changing the way in which we see solutions to challenging control problems in aerospace and autonomous systems.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21306v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Bingxue Tao"
    ],
    "title": "An extension theorem for quasimorphisms",
    "abstract": "We provide a general sufficient condition for extendability of quasimorphisms on subgroups. This condition recovers the result of Hull--Osin on quasimorphisms on hyperbolically embedded subgroups, and the proof given in this paper is much simpler. We also obtain new results for quasimorphisms on normal subgroups. One result is that for a group $G$ and its normal subgroup $K$, if the quotient $G/K$ is hyperbolic, then any antisymmetric quasi-invariant quasimorphism on $K$ extends to $G$. As an application, the stable commutator length $\\mathrm{scl}_G$ is bi-Lipschitz equivalent to the stable mixed commutator length $\\mathrm{scl}_{G,K}$ on $[G,K]$.\n  Another result concerns about group-theoretic Dehn filling in the sense of Dahmani--Guirardel--Osin. As an application, the quotient of a mapping class group of a surface with boundary by the normal closure of a large power of a pseudo-Anosov element is hierarchically hyperbolic. This gives an affirmative answer to a question of Fournier-Facio--Mangioni--Sisto.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21296v1",
    "categories": [
      "math.LO",
      "math-ph"
    ],
    "authors": [
      "Milan Rosko"
    ],
    "title": "A Constructive Fragment of Physical Propositions",
    "abstract": "We develop a proof-theoretic analysis of the Operational Standard of Matsas, Pleitez, Saa, Vanzella (2024) showing that admissible measurement in Minkowski Spacetime yields only finite observational sequences and thereby restricts the class of physically meaningful propositions to those admitting terminating extraction procedures or uniform stability conditions. These correspond exactly to the arithmetical fragment $Σ^0_1 \\cup Π^0_2$, and the induced realizability structure interprets $Δ_0$ Heyting Arithmetic on the code of observational data. A diagonal argument then establishes an operational form of incompleteness: there exist true arithmetical propositions about admissible extraction that no sound, recursively axiomatizable theory of spacetime can decide. The result is structurally analogous to classical incompleteness but arises from the evidential limits of measurement rather than from ontological assumptions.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21268v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Pasqua D'Ambra",
      "Fabio Durastante",
      "Salvatore Filippone"
    ],
    "title": "Parallel matching-based AMG preconditioners for elliptic equations discretized by IgA",
    "abstract": "Isogeometric analysis (IgA) offers enhanced approximation capabilities for the discretization of elliptic boundary-value problems, yet it results in large, sparse, and increasingly ill-conditioned linear systems due to higher interconnectivity among degrees of freedom. In particular, the discretization with tensor-product B-splines or NURBS of degree $p$ on a mesh with $n$ elements per parametric direction leads to symmetric positive-definite systems of the form $K\\mathbf{u} = \\mathbf{F}$, where the matrix bandwidth and condition number scale unfavorably with both $p$ and spatial dimension $d$. To address the computational challenges posed by such systems, especially in three-dimensional or high-order scenarios, Krylov subspace methods with specialized preconditioners become essential. This paper investigates the efficacy of algebraic multigrid (AMG) preconditioners tailored for IgA-based discretizations, with a focus on performance in modern high-performance computing (HPC) environments. Leveraging the Parallel Sparse Computation Toolkit (PSCToolkit), we explore distributed-memory and GPU-accelerated strategies for solving large-scale problems. The study assesses algorithmic efficiency and scalability across a range of benchmark tests. The results demonstrate that AMG preconditioners can achieve robust and scalable performance, confirming their potential as practical solvers for large IgA systems in engineering and scientific applications.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21259v1",
    "categories": [
      "math.GT",
      "math.GR"
    ],
    "authors": [
      "Susanna Terron"
    ],
    "title": "Constructing Thompson representatives via pointed links",
    "abstract": "We extend Jones' construction to obtain a surjective map from the Brown-Thompson group $F_3$ to the set of pointed links up to pointed isotopy. We then introduce an operation on $F_3$, and use it to define a new monoid $(F_3, \\diamond)$, called the central monoid. Using the extended version of Jones' construction, we obtain a surjective monoid homomorphism from the central monoid to the monoid of pointed links with connected sum. This allows us to introduce a standard form for connected sum representatives in $F_3$, and we extend this construction to a certain family of links by defining disjoint union and linking moves on $F_3$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21137v1",
    "categories": [
      "math.NT",
      "math.RA"
    ],
    "authors": [
      "Yuxuan Yang"
    ],
    "title": "Maximal orders optimal embedding of central simple algebras over number fields",
    "abstract": "Given a number field $F$ and $R$ be the ring of integers of $F$, the problem of embedding a field extension $K/F$ into a central simple algebra $B$ is classical. This paper proves that when the central simple algebra has degree $p$, the $R$-order $S\\subset K$ can be optimal embedded into all maximal $R$-orders $O\\subset B$, unless satisfies the optimal selectivity condition.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21123v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Thomas Dedieu"
    ],
    "title": "Two lectures on the enumeration of curves by means of floor diagrams",
    "abstract": "We discuss, following Mikhalkin, Brugallé, and many others, the counting of curves on toric surfaces with prescribed genus, Newton polygon, and intersection pattern with the toric boundary divisor, both at assigned and unassigned points.\n  The first lecture is dedicated to the proof of a correspondence theorem (for plane curves) with the counting of floor diagrams, using a degeneration of the projective plane to a chain of rational ruled surfaces. This is due to Brugallé and does not involve any tropical geometry.\n  The second lecture explores the relations with tropical geometry, and contains an introduction to toric varieties and tropical geometry. We discuss the correspondence theorem of Mikhalkin, and show how the corresponding tropical enumerative problem can be formulated in terms of the combinatorial problem of counting floor diagrams. We give many examples throughout, inspired by the study of the enumerative geometry of $K3$ surfaces, by degeneration to unions of rational surfaces with dual complex a tiling of the $\\mathbf{S}^2$ sphere.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21096v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Caihong Yang",
      "Jiasheng Zeng",
      "Xiao-Dong Zhang"
    ],
    "title": "A hypergraph analogue of Alon-Frankl Theorem",
    "abstract": "Recently, Alon and Frankl (JCTB, 2024) determined the maximum number of edges in $K_{\\ell+1}$-free $n$-vertex graphs with bounded matching number. For integers $\\ell\\ge r \\ge 2$, the family $\\mathcal{K}_{\\ell+1}^{r}$ consists of all $r$-graphs $F$ with at most $\\binom{\\ell+1}{2}$ edges such that, for some $(\\ell+1)$-set $K$, every pair $\\{x,y\\} \\subseteq K$ is covered by an edge in $F$. In this paper, we study the maximum number of edges in $\\mathcal{K}_{\\ell+1}^r$-free $r$-uniform hypergraphs that have the matching number at most $s$, that is, $\\mathrm{ex}_r(n, \\{\\mathcal{K}_{\\ell+1}^r, M^r_{s+1}\\})$, and obtain the exact value for sufficiently large $n$, along with the corresponding extremal hypergraph. This result can be viewed as a hypergraph extension of the work of Alon and Frankl. In addition, for the $3$-uniform Fano plane $\\mathbb{F}$, we determine the exact value of $\\mathrm{ex}_3(n, \\{\\mathbb{F}, M^3_{s+1}\\})$, and characterize the corresponding extremal hypergraph.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21543v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Dilara Erdemir",
      "Najib Mahdou",
      "El Houssaine Oubouhou",
      "Ünsal Tekir"
    ],
    "title": "On j-Artinian Modules Over Commutative Rings",
    "abstract": "Researchers introduced the notion of j-Artinian rings in [3] and obtained significant results concerning this new class of rings. Motivated by their definition and findings, we extend the study to modules by introducing the concept of j-Artinian modules. Recall from [9] that, if R is a commutative ring with identity, M is an R-module, and j is a submodule of M, then a submodule N of M is called a j-submodule if N \\not\\subseteq j. We say that M is a j-Artinian R-module if every descending chain of j-submodules becomes stationary. In this paper, we provide a characterization of j-Artinian modules. Moreover, we establish an analogue of Akizuki's theorem in this context and discuss its extension to amalgamated structures.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21496v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Masahisa Ebina",
      "Ivan Nourdin",
      "Giovanni Peccati"
    ],
    "title": "Optimal local central limit theorems on Wiener chaos",
    "abstract": "This paper investigates a local central limit theorem for a normalized sequence of random variables belonging to a fixed order Wiener chaos and converging to the standard normal distribution. We prove, without imposing any additional conditions, that the optimal rate of convergence of their density functions to the standard normal density in the Sobolev space $W^{k,r}(\\mathbb{R})$, for every $k \\in \\mathbb{N} \\cup \\{0\\}$ and $r \\in [1,\\infty]$, is determined by the maximum of the absolute values of their third and fourth cumulants. We also obtain exact asymptotics for this convergence under an additional assumption. Our approach is based on Malliavin--Stein techniques combined with tools from the theory of generalized functionals in Malliavin calculus.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21480v1",
    "categories": [
      "math.PR",
      "math-ph",
      "math.CO"
    ],
    "authors": [
      "William Da Silva",
      "Xingjian Hu",
      "Ellen Powell",
      "Mo Dick Wong"
    ],
    "title": "Scaling limits of critical FK-decorated random planar maps with $q=4$",
    "abstract": "We establish the first scaling limit for FK($q$)-weighted planar maps in the critical case $q=4$, resolving a problem that has remained open since Sheffield's seminal work arXiv:1108.2241. In that work, Sheffield proved a scaling limit for $q<4$ via the celebrated hamburger-cheeseburger bijection, which initiated the peanosphere (mating-of-trees) approach to Liouville quantum gravity. We prove that, at criticality, the associated burger count $\\mathcal{S}$ and discrepancy $\\mathcal{D}$ satisfy \\[ \\left(\\frac{\\mathcal{S}_{\\lfloor nt \\rfloor}}{\\sqrt{n}}, \\frac{\\log(n)}{{2π}\\sqrt{n}} \\mathcal{D}_{\\lfloor nt \\rfloor}\\right)_{t\\in\\mathbb{R}} \\stackrel{\\text{d}}{\\longrightarrow} (B^1_t, B^2_{t})_{t\\in\\mathbb{R}}, \\] where $B^1$ and $B^2$ are independent two-sided Brownian motions. To the best of our knowledge, no conjecture for the correct discrepancy scaling factor had previously been formulated. Matching the limiting process with the critical mating of trees arXiv:2109.00275, we establish the first rigorous planar map convergence towards CLE$_4$ and critical ($γ=2$) Liouville quantum gravity, in the peanosphere sense. Our proof is based on a novel approach that reveals the exactly solvable nature of the model through a correspondence with the (bicoloured) fully packed loop-$O(2)$ model on triangulations, and yields critical geometric exponents matching the predictions of conformal field theory.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21478v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Alexis Metz-Donnadieu"
    ],
    "title": "Markov properties for the vertical edge profile in random labelled trees",
    "abstract": "We study a broad class of random labelled trees in which integer-valued labels evolve along the edges according to increments in $\\{-1, 0, 1\\}$. These models include e.g. branching random walks, embedded complete and incomplete binary trees, random Cayley and plane trees with uniform displacements along edges. Motivated by recent work suggesting a Markovian structure in the vertical profile of such trees, we introduce the vertical edge profile, which counts both oriented edges connecting label $k-1$ to label $k$ and oriented edges connecting label $k$ to label $k-1$.\n  We show that the vertical edge profile forms a time-homogeneous Markov chain for a wide class of models, and this remains true (provided we enrich this process by the total mass of the tree below each label) if we condition on the total size of the tree. We give explicit transition kernels in the case of labelled incomplete binary trees, which are closely related to known enumeration formulas. To establish these results, we study a decomposition of labelled trees into excursions above and below fixed label levels, yielding a forest structure with tractable probabilistic laws.\n  We further explain briefly how these findings connect to the theory of super-Brownian motion and the Integrated Super-Brownian Excursion (ISE). In a companion paper, we show that the vertical edge profile converges, after rescaling,to the local time and its derivative of Brownian motion indexed by the Brownian tree.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21469v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Xinye Xiao",
      "Haomin Huang"
    ],
    "title": "A Hamilton-Jacobi Framework in a Field-Road System with Unidirectional Advection under Wentzell-Type Boundary Condition",
    "abstract": "This paper develops a comprehensive Hamilton-Jacobi framework to analyze asymptotic propagation dynamics in a field-road system featuring unidirectional advection and Wentzell-type boundary conditions. We rigorously derive a Hamilton-Jacobi variational inequality as the singular limit of a reaction-diffusion system in the upper half-plane, where the road is modeled as a degenerate one-dimensional medium with enhanced diffusion and tangential drift. By synthesizing viscosity solution theory, optimal control formulation, and variational analysis, we establish the existence, uniqueness, and explicit variational representation of the viscosity solution. The solution is characterized by a fundamental solution constructed via optimal paths, revealing a critical transition in propagation behavior governed by a geometrically derived curve that separates rectilinear and road-assisted regimes. Our framework extends to non-order-preserving systems where classical comparison methods fail, and we provide a detailed asymptotic derivation of the Wentzell boundary condition from flux continuity principles. Furthermore, we generalize the approach to conical domains with intersecting roads, demonstrating the robustness of our variational methodology. Numerical simulations illustrate how advection and diffusion parameters shape the invaded region, highlighting the interplay between field and road dynamics in determining propagation patterns.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21427v1",
    "categories": [
      "math.NT",
      "math.AC",
      "math.AG"
    ],
    "authors": [
      "Rishu Garg",
      "Jitender Singh"
    ],
    "title": "A generalized Dumas irreducibility criterion",
    "abstract": "As an extension of the classical irreducibility result of Dumas, a factorization result for polynomials over any valued field with a Krull valuation of arbitrary rank is proved. Further, a lower degree factor bound on factors of a given polynomial over a valued field with a Krull valuation is proved. These factorization results not only unify several known irreducibility results for polynomials over the said domains but also provide us sharp bounds on degrees of irreducible factors of the underlying polynomials.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21390v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Francesco Balducci",
      "Sergio Segura de León"
    ],
    "title": "Stationary equation of the relativistic heat diffusion in transparent media having $L^1$--data",
    "abstract": "Our objective is to prove existence of a solution to the Dirichlet problem for an equation arising in the theory of radiation hydrodynamics to deal with the radiating energy in transparent media. We study its stationary equation with $L^1$--datum in a bounded domain. This problem was addressed in [11] for regular data (data belonging to $L^N(Ω)$) and a bounded solution was obtained. In our framework, the proof of existence is far from trivial since the solution sought cannot be bounded. Consequently, the Anzellotti theory of pairings does not apply and we have to use new developments to introduce the meaning of solution. We also study the regularity of solutions when data belong to $L^p(Ω)$, with $1<p<N$. Our result is coherent with the regularity found in [11].",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21379v1",
    "categories": [
      "math.RT",
      "math.CT"
    ],
    "authors": [
      "Yixia Zhang",
      "Panyue Zhou"
    ],
    "title": "Triangulated categories arising from n-fold matrix factorizations",
    "abstract": "Let $\\mathcal{A}$ be an additive category and let $T\\colon \\mathcal{A}\\rightarrow \\mathcal{A}$ be an additive functor equipped with a natural transformation $ω\\colon \\mathrm{Id}_{\\mathcal{A}}\\rightarrow T$. We prove that the homotopy category of $n$-fold matrix factorizations of $ω$, denoted ${\\rm HFact}_{n}(\\mathcal{A},T,ω)$, admits a natural structure of a right triangulated category. In particular, when $T$ is an automorphism, the homotopy category ${\\rm HFact}_{n}(\\mathcal{A},T,ω)$ becomes triangulated. Furthermore, if $\\mathcal{A}$ is a Frobenius exact category and $T$ is an autoequivalence, we obtain that the category ${\\rm Fact}_{n}(\\mathcal{A},T,ω)$ of $n$-fold $(\\mathcal{A},T)$-factorizations of $ω$ is a Frobenius exact category. Consequently, the stable category of the Frobenius exact category ${\\rm Fact}_{n}(\\mathcal{A},T,ω)$ is a triangulated category.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21287v1",
    "categories": [
      "math.PR",
      "math.OC",
      "q-fin.MF"
    ],
    "authors": [
      "Ivan Guo",
      "Severin Nilsson",
      "Johannes Wiesel"
    ],
    "title": "Dynamic characterization of barycentric optimal transport problems and their martingale relaxation",
    "abstract": "We extend the Benamou-Brenier formula from classical optimal transport to weak optimal transport and show that the barycentric optimal transport problem studied by Gozlan and Juillet has a dynamic analogue. We also investigate a martingale relaxation of this problem, and relate it to the martingale Benamou-Brenier formula of Backhoff-Veraguas, Beiglböck, Huesmann and Källblad.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20875v1",
    "categories": [
      "math.PR",
      "math.OA"
    ],
    "authors": [
      "Todd Kemp",
      "Akihiro Miyagawa"
    ],
    "title": "Double $q$-Wigner Chaos and the Fourth Moment",
    "abstract": "In this paper, we prove the Fourth Moment Theorem for sequences of (noncommutative) random variables given as sums of two stochastic integrals in two different parity orders of chaos, both in the free Wigner chaos setting and a $q$-Gaussian generalization. Specifically, we prove that convergence to the appropriate central limit distribution is mediated entirely by the behavior of the first four (mixed) moments of the two stochastic integrals, which in turn controls the $L^2$ norms of partial integral contractions of those kernels. The key step in both the free and $q$-Gaussian settings is a polarization identity for fourth cumulants of sums which holds only when the two terms have differing parities. These results are analogous to the recent preprint Fourth-Moment Theorems for Sums of Multiple Integrals by Basse-O'Connor, Kramer-Bang, and Svedsen in the classical Wiener-Itô chaos setting.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21321v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Mengni Li",
      "You Li"
    ],
    "title": "Existence and nonexistence of viscosity solutions for a class of degenerate/singular eigenvalue type equations",
    "abstract": "This paper is devoted to a complete classification on the existence and nonexistence results of viscosity solutions to the general Dirichlet problem for a class of eigenvalue type equations. With the distance function included in the right-hand side, this type of equations can be degenerate and (or) singular near the boundary of uniformly convex domains. One highlight is that all cases related to the exponent of the distance function are investigated. Moreover, when viscosity solutions exist, we derive a series of global estimates based on the distance function. The key ingredients of this paper include adaptions of the Perron method and comparison principle as well as constructions of suitable classical sub-solutions and super-solutions.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21148v1",
    "categories": [
      "math.MG",
      "math.DS"
    ],
    "authors": [
      "Mark Mordechai Etkind",
      "Sigrid Grepstad",
      "Mihail N. Kolountzakis",
      "Nir Lev"
    ],
    "title": "Bounded remainder sets, bounded distance equivalent cut-and-project sets, and equidecomposability",
    "abstract": "We use the measurable Hall's theorem due to Cieśla and Sabok to prove that (i) if two measurable sets $A,B \\subset \\mathbb{R}^d$ of the same measure are bounded remainder sets with respect to a given irrational $d$-dimensional vector $α$, then $A, B$ are equidecomposable with measurable pieces using translations from $\\mathbb{Z} α+ \\mathbb{Z}^d$; and (ii) given a lattice $Γ\\subset \\mathbb{R}^m \\times \\mathbb{R}^n$ with projections $p_1$ and $p_2$ onto $\\mathbb{R}^m$ and $\\mathbb{R}^n$ respectively, if two cut-and-project sets in $\\mathbb{R}^m$ obtained from Riemann measurable windows $W, W' \\subset \\mathbb{R}^n$ are bounded distance equivalent, then $W, W'$ are equidecomposable with measurable pieces using translations from $p_2(Γ)$. We also prove by a different method that for one-dimensional cut-and-project sets the pieces can be chosen Riemann measurable.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21682v1",
    "categories": [
      "math.SG",
      "hep-th",
      "math.AG"
    ],
    "authors": [
      "Elad Kosloff",
      "Jake P. Solomon"
    ],
    "title": "Point-like non-commutative families of bounding cochains",
    "abstract": "We define genus zero open Gromov-Witten invariants with boundary and interior constraints for a Lagrangian submanifold of arbitrary even dimension. The definition relies on constructing a canonical family of bounding cochains that satisfy the point-like condition of the second author and Tukachinsky. Since the Lagrangian is even dimensional, the parameter of the family is odd. Thus, to avoid the vanishing of invariants with more than one boundary constraint, the parameter must be non-commutative. The invariants are defined either when the Lagrangian is a rational cohomology sphere or when the Lagrangian is fixed by an anti-symplectic involution, has dimension $2$ modulo $4$, and its cohomology is that of a sphere aside from degree $1$ modulo $4$. In dimension $2$, these invariants recover Welschinger's invariants.\n  We develop an obstruction theory for the existence and uniqueness of bounding cochains in a Fukaya $A_\\infty$ algebra with non-commutative coefficients. The obstruction classes belong to twisted cohomology groups of the Lagrangian instead of the de Rham cohomology of the commutative setting. A spectral sequence is constructed to compute the twisted cohomology groups. The extension of scalars of an $A_\\infty$ algebra by a non-commutative ring is treated in detail. A theory of pseudo-completeness is introduced to guarantee the convergence of the Maurer-Cartan equation, which defines bounding cochains, even though the non-commutative parameter is given zero filtration.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21571v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Freddie Illingworth",
      "Arjun Ranganathan",
      "Leo Versteegen",
      "Ella Williams"
    ],
    "title": "Relative Turán densities for ordered graphs: all and nothing",
    "abstract": "Reiher, Rödl, Sales, and Schacht initiated the study of relative Turán densities of ordered graphs and showed that it is more subtle and interesting than the unordered case. For an ordered graph $F$, its relative Turán density, $ρ_{<}(F)$, is the greatest $α$ such that every ordered graph $G$ has an $F$-free subgraph with at least $αe(G)$ edges.\n  This paper contains two main results about relative Turán densities. First, we find a family of host graphs that is optimal for all $F$. Second, we characterise the ordered graphs with zero relative Turán density: precisely those with no monotone path of length two.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21144v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Stijn Cambie",
      "Jan Goedgebeur",
      "Jorik Jooken",
      "Tibo Van den Eede"
    ],
    "title": "On the order-diameter ratio of girth-diameter cages",
    "abstract": "For integers $k,g,d$, a $(k;g,d)$-cage (or simply girth-diameter cage) is a smallest $k$-regular graph of girth $g$ and diameter $d$ (if it exists). The order of a $(k;g,d)$-cage is denoted by $n(k;g,d)$. We determine asymptotic lower and upper bounds for the ratio between the order and the diameter of girth-diameter cages as the diameter goes to infinity. We also prove that this ratio can be computed in constant time for fixed $k$ and $g$.\n  We theoretically determine the exact values $n(3;g,d)$, and count the number of corresponding girth-diameter cages, for $g \\in \\{4,5\\}$. Moreover, we design and implement an exhaustive graph generation algorithm and use it to determine the exact order of several open cases and obtain -- often exhaustive -- sets of the corresponding girth-diameter cages. The largest case we generated and settled with our algorithm is a $(3;7,35)$-cage of order 136.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21628v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Andrey Kupavskii",
      "Georgy Sokolov"
    ],
    "title": "A complete solution of the Erdős-Kleitman matching problem for $n\\le 3s$",
    "abstract": "Given integers $n\\ge s\\ge 2$, let $e(n,s)$ stand for the maximum size of a family of subsets of an $n$-element set that contains no $s$ pairwise disjoint members. The study of this quantity goes back to the 1960s, when Kleitman determined $e(sm-1,s)$ and $e(sm,s)$ for all integer $m,s\\ge 1$. The question of determining $e(n,s)$ is closely connected to its uniform counterpart, the subject of the famous Erdős Matching Conjecture.\n  The problem of determining $e(n,s)$ has proven to be very hard and, in spite of some progress during these years, even a general conjecture concerning the value of $e(n,s)$ is missing. In this paper, we completely solve the problem for $n\\le 3s$. In this regime, the average size of a set in an $s$-matching is at most $3$, and it is a delicate interplay between the `missing' $2$- and $3$-element sets that plays a key role here. Four types of extremal families appear in the characterization. Our result sheds light on how the extremal function $e(n,s)$ may behave in general.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21148v1",
    "categories": [
      "math.MG",
      "math.DS"
    ],
    "authors": [
      "Mark Mordechai Etkind",
      "Sigrid Grepstad",
      "Mihail N. Kolountzakis",
      "Nir Lev"
    ],
    "title": "Bounded remainder sets, bounded distance equivalent cut-and-project sets, and equidecomposability",
    "abstract": "We use the measurable Hall's theorem due to Cieśla and Sabok to prove that (i) if two measurable sets $A,B \\subset \\mathbb{R}^d$ of the same measure are bounded remainder sets with respect to a given irrational $d$-dimensional vector $α$, then $A, B$ are equidecomposable with measurable pieces using translations from $\\mathbb{Z} α+ \\mathbb{Z}^d$; and (ii) given a lattice $Γ\\subset \\mathbb{R}^m \\times \\mathbb{R}^n$ with projections $p_1$ and $p_2$ onto $\\mathbb{R}^m$ and $\\mathbb{R}^n$ respectively, if two cut-and-project sets in $\\mathbb{R}^m$ obtained from Riemann measurable windows $W, W' \\subset \\mathbb{R}^n$ are bounded distance equivalent, then $W, W'$ are equidecomposable with measurable pieces using translations from $p_2(Γ)$. We also prove by a different method that for one-dimensional cut-and-project sets the pieces can be chosen Riemann measurable.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21682v1",
    "categories": [
      "math.SG",
      "hep-th",
      "math.AG"
    ],
    "authors": [
      "Elad Kosloff",
      "Jake P. Solomon"
    ],
    "title": "Point-like non-commutative families of bounding cochains",
    "abstract": "We define genus zero open Gromov-Witten invariants with boundary and interior constraints for a Lagrangian submanifold of arbitrary even dimension. The definition relies on constructing a canonical family of bounding cochains that satisfy the point-like condition of the second author and Tukachinsky. Since the Lagrangian is even dimensional, the parameter of the family is odd. Thus, to avoid the vanishing of invariants with more than one boundary constraint, the parameter must be non-commutative. The invariants are defined either when the Lagrangian is a rational cohomology sphere or when the Lagrangian is fixed by an anti-symplectic involution, has dimension $2$ modulo $4$, and its cohomology is that of a sphere aside from degree $1$ modulo $4$. In dimension $2$, these invariants recover Welschinger's invariants.\n  We develop an obstruction theory for the existence and uniqueness of bounding cochains in a Fukaya $A_\\infty$ algebra with non-commutative coefficients. The obstruction classes belong to twisted cohomology groups of the Lagrangian instead of the de Rham cohomology of the commutative setting. A spectral sequence is constructed to compute the twisted cohomology groups. The extension of scalars of an $A_\\infty$ algebra by a non-commutative ring is treated in detail. A theory of pseudo-completeness is introduced to guarantee the convergence of the Maurer-Cartan equation, which defines bounding cochains, even though the non-commutative parameter is given zero filtration.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20824v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Nour G. Al Hassanieh",
      "Alex H. Barnett",
      "Leslie Greengard"
    ],
    "title": "Truncated kernel windowed Fourier projection: a fast algorithm for the 3D free-space wave equation",
    "abstract": "We present a spectrally accurate fast algorithm for evaluating the solution to the scalar wave equation in free space driven by a large collection of point sources in a bounded domain. With $M$ sources temporally discretized by $N_t$ time steps of size $Δt$, a naive potential evaluation at $M$ targets on the same time grid requires $\\mathcal O(M^2 N_t)$ work. Our scheme requires $\\mathcal{O}\\left((M + N^3\\log N)N_t\\right)$ work, where $N$ scales as $\\mathcal O(1/Δt)$, i.e., the maximum signal frequency. This is achieved by using the recently-proposed windowed Fourier projection (WFP) method to split the potential into a local part, evaluated directly, plus a smooth history part approximated by an $N^3$-point equispaced discretization of the Fourier transform, where each Fourier coefficient obeys a simple recursion relation. The growing oscillations in the spectral representation (which would be present with a naive use of the Fourier transform) are controlled by spatially truncating the hyperbolic Green's function itself. Thus, the method avoids the need for absorbing boundary conditions. We demonstrate the performance of our algorithm with up to a million sources and targets at 6-digit accuracy. We believe it can serve as a key component in addressing time-domain wave equation scattering problems.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21571v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Freddie Illingworth",
      "Arjun Ranganathan",
      "Leo Versteegen",
      "Ella Williams"
    ],
    "title": "Relative Turán densities for ordered graphs: all and nothing",
    "abstract": "Reiher, Rödl, Sales, and Schacht initiated the study of relative Turán densities of ordered graphs and showed that it is more subtle and interesting than the unordered case. For an ordered graph $F$, its relative Turán density, $ρ_{<}(F)$, is the greatest $α$ such that every ordered graph $G$ has an $F$-free subgraph with at least $αe(G)$ edges.\n  This paper contains two main results about relative Turán densities. First, we find a family of host graphs that is optimal for all $F$. Second, we characterise the ordered graphs with zero relative Turán density: precisely those with no monotone path of length two.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20805v1",
    "categories": [
      "math.CO",
      "math.AG"
    ],
    "authors": [
      "Desmond Leitz",
      "Ralph Morrison",
      "Søren Newman-Taylor",
      "Vincent X. Wang"
    ],
    "title": "The $d$-gonal locus in the moduli space of tropical plane curves",
    "abstract": "We introduce and study the locus $\\mathbb{M}_{g,d}^\\textrm{nd}$ of genus $g$ tropical plane curves of gonality $d$ inside the moduli space $\\mathbb{M}^{\\textrm{nd}}_{g}$ of tropical plane curves of genus $g$. Each such tropical curve arises from a Newton polygon, and we conjecture that the gonality of the tropical curve is equal to an easily computed parameter of this polygon called the expected gonality, closely related to the lattice width of the polygon. Let $\\mathbb{M}_{g,{\\underline{d}}}^\\textrm{nd}$ denote the locus of tropical curves whose associated Newton polygon has expected gonality $d$. We prove that for fixed $d$ and sufficiently large genus $g$, the dimensions of these two loci agree: \\[ \\\\dim\\left(\\mathbb{M}_{g,d}^\\textrm{nd}\\right) =\\dim\\left(\\mathbb{M}_{g,{\\underline{d}}}^\\textrm{nd}\\right). \\] Our results provide evidence that, in sufficiently high genus compared to expected gonality, the gonality of a tropical curve is determined by the expected gonality of the Newton polygon from which it arises.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20794v1",
    "categories": [
      "math.FA",
      "math.PR",
      "math.ST"
    ],
    "authors": [
      "Tuan Pham",
      "Alessandro Rinaldo"
    ],
    "title": "A note on time-uniform concentration inequality for matrix products",
    "abstract": "This short note contains a simple argument that allows us to go from fixed-time to any-time bounds for the concentration of matrix products. The result presented here is motivated by the analysis of Oja's algorithms.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20772v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tadele Mengesha",
      "Miriam Abbate"
    ],
    "title": "A note on the $L^{p}$-solvability of a strongly-coupled nonlocal system of equations",
    "abstract": "The goal of this paper is to study the $L^p$-solvability of the strongly-coupled nonlocal system \\[\n  \\mathbb{L} \\mathbf{u} (\\mathbf{x}) + λ\\mathbf{u}(\\mathbf{x})= \\mathbf{f}(\\mathbf{x}) \\quad \\text{in $\\mathbb{R}^{d}$ } \\] where $\\mathbb{L}$ is a linear nonlocal coupled vector-valued operator associated with a kernel $K$ comparable to $|\\mathbf{y}|^{-(d+2s)}$ for $s \\in (0,1)$, satisfying certain ellipticity and cancellation conditions. For any $\\mathbf{f} \\in [L^p(\\mathbb{R}^d)]^d$, $1< p < \\infty$, the existence of a unique strong solution $\\mathbf{u} \\in [H^{2s,p}(\\mathbb{R}^d)]^d$ is proved via the method of continuity. To apply this method, we establish the continuity of the operator $\\mathbb{L}$ and the necessary \\textit{a priori} estimates. These are obtained through the study of the corresponding parabolic system. The proof strategy follows and extends recent ideas developed for the scalar setting, combining commutator estimates, Sobolev embeddings, a level set estimates and a bootstrap argument.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21293v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Jon Merladet Urigüen",
      "Ashot Minasyan"
    ],
    "title": "Property (VRC) and virtual fibering for amalgamated free products",
    "abstract": "This paper focuses on studying properties of amalgamated free products $G=G_1*_{G_0} G_2$, where the amalgamated subgroup $G_0$ is virtually cyclic.\n  First, we prove that if the factors $G_1$ and $G_2$ are finitely generated virtually abelian groups then $G$ can be mapped to another virtually abelian group so that this homomorphism is injective on each factor.\n  We then present several applications of this result. In particular, we show that if $G_1$ and $G_2$ have property (VRC) (that is, every cyclic subgroup is a virtual retract), then the same is true for $G$. We also prove that $G$ inherits some residual properties (such as residual finiteness or virtual residual solvability) from the factors $G_i$, provided $G_0$ is a virtual retract of $G_i$, for $i=1,2$.\n  Finally, we give necessary and sufficient conditions for $G$ to be (virtually) $F_m$-fibered. In particular, we fully characterize when an amalgamated product of two (finitely generated free)-by-cyclic groups over a cyclic subgroup is free-by-cyclic or virtually free-by-cyclic.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21292v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Xubin Hu",
      "Liming Ma"
    ],
    "title": "The automorphism groups of a maximal function field with the second largest genus and its algebraic geometry codes",
    "abstract": "In this manuscript, we investigate the automorphism group of a maximal function field with the second largest possible genus over finite field of even characteristic, which is called the Abdón--Torres function field. As an application, we determine the automorphism groups of one-point algebraic geometry codes from such a maximal function field. It turns out that the automorphism groups of one-point algebraic geometry codes agree with that of the Abdón--Torres function field except for the trivial cases. Moreover, we provide a family of maximal function fields with explicit defining equations via considering fixed subfields with respect to some subgroups of automorphism group of the Abdón--Torres function field.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21252v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Gerd Steinebach"
    ],
    "title": "Rodas6P and Tsit5DA - two new Rosenbrock-type methods for DAEs",
    "abstract": "Two new Rosenbrock methods for solving index-1 differential algebraic equations are presented. Rodas6P is a sixth-order method based on the same design principles as the Rodas3P, Rodas4P, and Rodas5P methods. Tsit5DA is based on an explicit solution approach for the differential equations and a linear-implicit approach for the algebraic equations. Such a fourth-order method has already been presented in Rentrop, Roche & Steinebach, 1989. Tsit5DA now provides a significantly improved fifth-order method which is based on the well known Tsit5 method. The theoretical properties of the new methods are verified by some order tests and benchmarks.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21246v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Kostiantyn Drach",
      "Jonguk Yang"
    ],
    "title": "Rigidity of bounded-type Siegel polynomials",
    "abstract": "In this paper, we study rigidity of polynomials of arbitrary degree in the presence of neutral dynamics. Specifically, we focus on {non-renormalizable} (in the sense of Douady and Hubbard) complex polynomials of degree $d \\geqslant 2$ that possess a Siegel disk of bounded type rotation number. We refer to such maps as {atomic Siegel polynomials of bounded type}. In this setting, our main results are: (A) Atomic Siegel polynomials of bounded type have locally connected Julia sets; (B) these Julia sets are quasiconformally rigid, i.e., they do not support invariant line fields; (C) any two combinatorially equivalent atomic Siegel polynomials of bounded type coincide up to an affine change of coordinates. In particular, item (C) verifies the notorious {Combinatorial Rigidity Conjecture} for atomic Siegel polynomials of bounded type and arbitrary degree. By bringing neutral Siegel dynamics into the picture, we extend the celebrated higher-degree rigidity theorems of Avila--Kahn--Lyubich--Shen and Kozlovski--van Strien, which until now applied only in the Yoccoz setting, i.e., for finitely many times renormalizable polynomials without irrationally indifferent periodic points.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21204v1",
    "categories": [
      "math.MG",
      "math.FA",
      "math.PR"
    ],
    "authors": [
      "Alessandro Pinzi"
    ],
    "title": "A study of the metric measure space of probability measures via a purely atomic superposition principle",
    "abstract": "We study the continuity equation on the metric measure space $(\\mathcal{P}_p(X),W_p,Q)$, when $X$ is either the Euclidean space or a compact, oriented, and boundaryless Riemannian manifold, for some suitable reference measure $Q \\in \\mathcal{P}_p(\\mathcal{P}_p(X))$, which by construction are concentrated over purely atomic measures. In fact, we consider the equation $\\partial_t M_t +\\operatorname{div}_{\\mathcal{P}}(b_t M_t) = 0$, where $(M_t)_{t\\in[0,T]} \\subset\\mathcal{P}(\\mathcal{P}(X))$ and $b:[0,T]\\times X \\times \\mathcal{P}(X) \\to TX$, assuming that $M_t\\ll Q$ for all $t\\in[0,T]$, to then show when the purely atomic property is inherited by the liftings of the curve $M_t$ given by the nested superposition principle.\n  On the Euclidean space, the main assumption is that the $r$-capacity of the diagonal $Δ\\subset \\mathbb{R}^d \\times \\mathbb{R}^d$ is zero with respect to $ν\\otimes ν$, where $ν$ is the barycenter of the reference measure $Q$. We will give sufficient conditions to ensure it, and in particular, thanks to the Nash embedding theorem, this analysis will allow us to extent the main results from the Euclidean space to Riemannian manifolds.\n  Finally, we exploit this atomic superposition principle to show the lack of the Sobolev-to-Lipschitz property and the Poincaré inequality for functions in $W^{1,p}(\\mathcal{P}_p(X),W_p,Q)$. Then, we complete the analysis showing that, however, the $L^2$-Wasserstein space endowed with suitable reference measure $Q$, satisfies a Bakry--Émery curvature condition.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21198v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Wei Qu",
      "Siu-Long Lei",
      "Sean Y. Hon",
      "Yuan-Yuan Huang"
    ],
    "title": "Optimal preconditioning techniques for finite volume approximation of three-dimensional conservative space-fractional diffusion equations",
    "abstract": "A Crank-Nicolson finite volume approximation for three-dimensional conservative space-fractional diffusion equation results in large and dense three-level Toeplitz discrete linear systems. Preconditioned Krylov subspace methods with sine transform-based preconditioners are developed to solve these systems, including the preconditioned conjugate gradient (PCG) method for the symmetric case and the preconditioned generalized minimal residual (PGMRES) method for the non-symmetric case. Moreover, we provide detailed analysis of the convergence of these Krylov subspace methods. Specifically, for the symmetric case, we prove the spectra of the preconditioned matrices are uniformly bounded in the open interval (1/2, 3/2), which results in a linear convergence rate of the PCG method. For the non-symmetric case, we demonstrate that the PGMRES method also achieves a linear convergence rate independent of discretization stepsizes from the residual point of view. These results imply that the iteration counts of the PCG and PGMRES methods are uniformly bounded and independent of the matrix sizes. Numerical experiments in both symmetric and non-symmetric cases in two- and three-dimensions are conducted to confirm the optimal performance of the proposed preconditioned Krylov subspace methods.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21168v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Xianxian Cao",
      "Zhen Guan",
      "Junjun Wang"
    ],
    "title": "A new analytical technique of the fully implicit Crank-Nicolson discontinuous Galerkin method for the Ginzburg-Landau Model",
    "abstract": "In this paper, a fully implicit Crank-Nicolson discontinuous Galerkin method is proposed for solving the Ginzburg-Landau equation. By leveraging a novel analytical technique, we rigorously establish the unique solvability of the constructed numerical scheme, as well as its unconditionally optimal error estimates under both the \\(L^2\\)-norm and the energy norm. The core of the proof hinges on the \\(L^2\\)-norm boundedness of the numerical solution and the refined estimation of the cubic nonlinear term. Finally, two numerical examples are presented to validate the theoretical findings.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21159v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Emily R. Korfanty",
      "Jan Mazáč"
    ],
    "title": "Diffraction of plane waves, spherical waves, and beyond",
    "abstract": "We review the diffraction theory for plane waves and establish its connection to the diffraction of Besicovitch almost periodic functions, extending the theory to an unbounded setting and providing explicit formulas. Then, we give an alternative proof that the diffraction of a spherical wave in $\\mathbb{R}^d$ is a single sphere, which was recently shown in \\cite{BKM25}. After developing a suitable framework for working with spherically symmetric measures, including a radial analogue of the usual Lebesgue decomposition, we introduce the notion of radial almost periodicity. In particular, we define a space of Besicovitch radially almost periodic functions and show that this space contains precisely the functions whose radial part is Besicovitch almost periodic. The paper concludes with a diffraction analysis of these functions.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21112v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Swathi Shetty",
      "Sayinath Udupa N. V.",
      "B. R. Rakshith"
    ],
    "title": "On Coalition Graphs and Coalition Count of Graphs",
    "abstract": "Let $G$ be graph with vertex set $V(G)$ and order $n$. A coalition in a graph $G$ consists of two disjoint sets of vertices $V_1$ and $V_2$, neither of which is a dominating set but whose union $V_1 \\cup V_2$ is a dominating set. A coalition partition, abbreviated $c$-partition, in a graph $G$ is a vertex partition $π=\\left\\{V_1 , V_2,\\dots, V_k\\right\\}$ such that every set $V_i$ of $π$ is either a singleton dominating set, or is not a dominating set but forms a coalition with another set $V_j$ in $π$. The sets $V_i$ and $V_j$ are coalition partners in $G$. The coalition number $C(G)$ equals the maximum order $k$ of a $c$-partition of $G$. For any graph $G$ with a $c$-partition $π=\\left\\{V_1,V_2,\\dots,V_k\\right\\}$, the coalition graph $CG(G,π)$ of $G$ is a graph with vertex set $V_1,V_2,\\dots, V_k$, corresponding one-to-one with the set $π$, and two vertices $V_i$ and $V_j$ are adjacent in $CG(G,π)$ if and only if the sets $V_i$ and $V_j$ are coalition partners in $π$. In [4], authors proved that for every graph $G$ there exist a graph $H$ and $c$-partition $π$ such that $CG(H,π)\\cong G$, and raised the question: Does there exist a graph $H^*$ of smaller order $n^*$ and size $m^*$ with a $c$-partition $π^*$ such that $CG(H^*,π^*)\\cong G$?. In this paper, we constructed a graph $H^*$ of small order and size and a $c$- partition $π^*$ such that $CG(H^*,π^*)\\cong G$. Recently, Haynes et al.[5] defined the coalition count $c(G)$ of a graph $G$ as the maximum number of different coalition in any $c$-partition of $G$. We characterize all graphs $G$ with $c(G)=1$. Further, imposing some suitable conditions on coalition number, we study the properties of coalition count of graph.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21110v1",
    "categories": [
      "math.OA",
      "math.FA"
    ],
    "authors": [
      "A. Arziev",
      "K. Kudaybergenov"
    ],
    "title": "Characterizing convex trace ranges in finite atomic von Neumann algebras",
    "abstract": "The paper is devoted to characterizing convex trace ranges in finite atomic von Neumann algebras. The main result provides us with the necessary and sufficient condition for the range of a faithful normal trace on a finite atomic von Neumann algebra to be convex. In order to prove this result we will prove the following result, which has independent interest. Let ${\\bf a}=(a_1, \\ldots, a_n, \\ldots)$ be a non-increasing positive sequence such that $\\sum\\limits_{n=1}^\\infty a_n=1.$ Then each real number $0\\le r \\le 1$ can be represented in the form \\( r=\\sum\\limits_{n=1}^\\infty \\varepsilon_n a_n, \\,\\,\\, \\varepsilon_n \\in \\{0,1\\}, n\\ge 1, \\) if and only if the sequence ${\\bf a}$ satisfies \\(a_n \\le 1-\\sum\\limits_{k=1}^n a_k \\) for all $n\\ge 1.$ A set $K$ of all sequences that satisfy the last property can be represented as a convex weak-compact subset of $\\ell_1 = c_0^*$. We will describe the set of all extreme points of $K.$",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21102v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Narinder Kumar Wadhawan",
      "Priyanka Wadhawan"
    ],
    "title": "Approximation Of Logarithm, Factorial And Euler Mascheroni Constant Using Odd Harmonic Series",
    "abstract": "We have proved in this paper that natural logarithm of consecutive number ratio, x/(x-1) approximates to 2/(2x - 1) where x is a real number except 1. Using this relation, we, then proved, x approximates to double the sum of odd harmonic series having first and last terms 1/3 and 1/(2x - 1) respectively. Thereafter, not limiting to consecutive number ratios, we extended its applicability to all the real numbers. Based on these relations, we, then derived a formula for approximating the value of Factorial x. We could also approximate the value of Euler-Mascheroni constant. In these derivations, we used only and only elementary functions, thus this paper is easily comprehensible to students and scholars.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21074v1",
    "categories": [
      "math.ST",
      "stat.ME",
      "stat.ML"
    ],
    "authors": [
      "Hongrui Chen",
      "Rong Ma"
    ],
    "title": "Statistical Inference for Manifold Similarity and Alignability across Noisy High-Dimensional Datasets",
    "abstract": "The rapid growth of high-dimensional datasets across various scientific domains has created a pressing need for new statistical methods to compare distributions supported on their underlying structures. Assessing similarity between datasets whose samples lie on low-dimensional manifolds requires robust techniques capable of separating meaningful signal from noise. We propose a principled framework for statistical inference of similarity and alignment between distributions supported on manifolds underlying high-dimensional datasets in the presence of heterogeneous noise. The key idea is to link the low-rank structure of observed data matrices to their underlying manifold geometry. By analyzing the spectrum of the sample covariance under a manifold signal-plus-noise model, we develop a scale-invariant distance measure between datasets based on their principal variance structures. We further introduce a consistent estimator for this distance and a statistical test for manifold alignability, and establish their asymptotic properties using random matrix theory. The proposed framework accommodates heterogeneous noise across datasets and offers an efficient, theoretically grounded approach for comparing high-dimensional datasets with low-dimensional manifold structures. Through extensive simulations and analyses of multi-sample single-cell datasets, we demonstrate that our method achieves superior robustness and statistical power compared with existing approaches.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21026v1",
    "categories": [
      "math.FA",
      "math.RA"
    ],
    "authors": [
      "Marwa Ennaceur"
    ],
    "title": "Spectral Theory and Almost Periodic Structures in Hom--Lie Banach Algebras",
    "abstract": "We develop a systematic functional-analytic framework for Hom--Lie Banach algebras, introducing bounded $α$-twisted derivations and almost periodic elements. Under natural continuity and compactness assumptions, we establish a complete Bohr--Fourier spectral decomposition of such derivations. We prove that the associated almost periodic and ergodic subspaces are not merely topological complements but closed, $α$-invariant subalgebras, stable under the twisted Lie bracket a key structural novelty that enables coherent restriction of the dynamics. We provide explicit constructions of Hom--Banach--Malcev algebras and demonstrate our theory with concrete operator-algebraic applications, including a novel twisted Weyl algebra example, analyzed via the metaplectic representation, where a non-commuting twist enriches the Bohr spectrum from a cyclic group to a two-dimensional lattice.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20987v1",
    "categories": [
      "math.CO",
      "cs.AI",
      "cs.LG",
      "cs.NE"
    ],
    "authors": [
      "Davis Brown",
      "Jesse He",
      "Helen Jenne",
      "Henry Kvinge",
      "Max Vargas"
    ],
    "title": "Even with AI, Bijection Discovery is Still Hard: The Opportunities and Challenges of OpenEvolve for Novel Bijection Construction",
    "abstract": "Evolutionary program synthesis systems such as AlphaEvolve, OpenEvolve, and ShinkaEvolve offer a new approach to AI-assisted mathematical discovery. These systems utilize teams of large language models (LLMs) to generate candidate solutions to a problem as human readable code. These candidate solutions are then 'evolved' with the goal of improving them beyond what an LLM can produce in a single shot. While existing mathematical applications have mostly focused on problems of establishing bounds (e.g., sphere packing), the program synthesis approach is well suited to any problem where the solution takes the form of an explicit construction. With this in mind, in this paper we explore the use of OpenEvolve for combinatorial bijection discovery. We describe the results of applying OpenEvolve to three bijection construction problems involving Dyck paths, two of which are known and one of which is open. We find that while systems like OpenEvolve show promise as a valuable tool for combinatorialists, the problem of finding novel, research-level bijections remains a challenging task for current frontier systems, reinforcing the need for human mathematicians in the loop. We describe some lessons learned for others in the field interested in exploring the use of these systems.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20953v1",
    "categories": [
      "math-ph",
      "hep-th",
      "math.GT"
    ],
    "authors": [
      "Tianyue Liu",
      "Shuang Ming",
      "Xin Sun",
      "Baojun Wu",
      "Tian Yang"
    ],
    "title": "Asymptotics of $b$-$6j$ symbols and anti-de Sitter tetrahedra",
    "abstract": "In this paper, we study the asymptotics of the $6j$-symbols for the principal series of the modular double of $\\mathrm U_q\\mathfrak{sl}(2;\\mathbb R)$, and of their analytic extension -- what we call the $b$-$6j$ symbols, relating them in various cases to the volume of truncated hyperideal tetrahedra in the hyperbolic and the anti-de Sitter geometry. To the best of our knowledge, this is the first time that the anti-de Sitter geometry appears in the asymptotics of quantum invariants. In addition, based on the connection to conformal field theory, we reveal a correspondence between the edge lengths and the dihedral angles of truncated hyperideal anti-de Sitter tetrahedra and the Fenchel-Nielsen coordinates of hyperbolic four-holed spheres. We also provide a concrete instance of $3D/2D$ holography, in the spirit of the AdS/CFT correspondence.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20925v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Tomasz Skalski",
      "Tomasz Stroiński"
    ],
    "title": "Level sets and maximum likelihood estimation for the Ising model",
    "abstract": "Bogdan et al. established a new criterion to determine the existence of a maximum likelihood estimator in discrete exponential families. It uses the notion of the set of uniqueness, which allows to apply the problem to the Ising model from statistical mechanics. We propose a full characterization of the existence of the MLE in the Ising model among the level sets used in related combinatorial problems. Then we establish new bounds for the size of the smallest set of uniqueness for the products of Rademacher functions.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21588v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Soufiane El Amine El Alami",
      "Abderazzak Mouiha",
      "Abdelatif Hafid",
      "Ahmed El Hilali Alaoui"
    ],
    "title": "Machine Learning and Deep Learning in Computational Finance: A Systematic Review",
    "abstract": "This systematic review examines how machine learning (ML) and deep learning (DL) have transformed forecasting, decision-making, and financial modelling, promoting innovation and efficiency in financial systems. Following PRISMA 2020 guidelines, we analyze 22 peer-reviewed and open-access articles (2024 to 2026) indexed in Scopus, applying ML and DL models across credit risk prediction, cryptocurrency, asset pricing, and macroeconomic policy modeling. The most used models include Random Forest, XG-Boost, Support Vector Machine, Long Short-Term Memory (LSTM), Bidirectional LSTM, Convolutional Neural Network (CNN), and hybrid or ensemble approaches combining statistical and AI methods. ML and DL techniques outperform traditional models by capturing nonlinear dependencies and enhancing predictive accuracy, while explainable AI methods (e.g., SHAP and feature importance analysis) improve transparency and interpretability. Emerging trends include cross-domain applications and the integration of responsible AI in finance. Despite notable progress, challenges remain in interpretability, generalizability, and data quality. Overall, this review provides a comprehensive overview of AI-driven computational finance and outlines future research directions.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21583v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Dengjun Guo",
      "Xiaoyutao Luo"
    ],
    "title": "Long time inviscid damping near Couette in Sobolev spaces",
    "abstract": "We give an elementary proof of long time inviscid damping for Sobolev perturbations near the Couette flow $(y,0)$ for the 2D Euler equations on $\\mathbb{T} \\times \\mathbb{R}$. For any $s>1$ and any initial vorticity perturbation of size $O(ε)$ in $H^s$, we obtain velocity damping estimates up to a time scale $ t = O(ε^{-δ_s} )$, where $δ_s=1/3$ when $s\\to 1+$ and $δ_s=1/2$ for $s>2$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21516v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Linbo Wang",
      "Thomas Richardson",
      "James Robins"
    ],
    "title": "Causal Inference: A Tale of Three Frameworks",
    "abstract": "Causal inference is a central goal across many scientific disciplines. Over the past several decades, three major frameworks have emerged to formalize causal questions and guide their analysis: the potential outcomes framework, structural equation models, and directed acyclic graphs. Although these frameworks differ in language, assumptions, and philosophical orientation, they often lead to compatible or complementary insights. This paper provides a comparative introduction to the three frameworks, clarifying their connections, highlighting their distinct strengths and limitations, and illustrating how they can be used together in practice. The discussion is aimed at researchers and graduate students with some background in statistics or causal inference who are seeking a conceptual foundation for applying causal methods across a range of substantive domains.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21453v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Thomas Jackson"
    ],
    "title": "Long-Range Antiferromagnetic Order in the AKLT Model on Trees and Treelike Graphs",
    "abstract": "We extend the result of Fannes, Nachtergaele, and Werner on long-range order in the AKLT model on Cayley trees to include various trees and tree-like graphs that obey certain conditions. Our examples split into three cases: Cayley-like tree-like graphs generated by a finite subgraph, for which we have a simple condition; arbitrary trees with a prescribed growth rate of their volume; and bilayer Cayley trees.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21426v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Fei Ma"
    ],
    "title": "On existence of neutral graph",
    "abstract": "Graph is considered neutral if its assortativity coefficient $r$ is equal to zero. In this paper, we address an outstanding conjecture, i.e., whether is there a neutral graph on $n$ vertices. First, we show that for $n\\geq7$, there is at least one neutral tree, which suggests that we find a representative of any order neutral graph. Additionally, we obtain that given $n\\geq13$, there exist at least one neutral non-tree graph.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21412v1",
    "categories": [
      "math-ph",
      "quant-ph"
    ],
    "authors": [
      "Siyu Li",
      "Ian Marquette",
      "Yao-Zhong Zhang"
    ],
    "title": "New quasi-exatly solvable systems from SUSYQM and Bethe Ansatz",
    "abstract": "We give a systematic construction of new quasi-exactly solvable systems via Bethe ansatz and supersymmetric quantum mechanics (SUSYQM). Methods based on the intertwining of supercharges have been extensively used in the literature for exactly solvable systems. We generalize the state-deleting (Krein-Adler) supersymmetric transformations to quasi-exactly exactly solvable (QES) systems building on the Bethe ansatz method and related Bethe roots. This enables us to construct superpartners for a wide class of known QES systems classified previously through a hidden $sl(2)$ algebra. We present our constructions of factorizations and intertwining relations related to 1st-order SUSYQM and the $n=1$ state for 10 nonequivalent types, denoted I,...,X. In order to have a unified treatment we rely on their ODE standard form as this is also the appropriate setting to obtain the Bethe ansatz equations which constrain the polynomial solutions. This setting also allows one to deal with systems with $n$ states in a unified manner, using analysis based on the Bethe ansatz equations to build the supersymmetric transformations in terms of the Bethe ansatz roots. We derive the Schrödinger potentials for the $n=1$ superpartners of the 10 QES cases and give closed-form solutions for the spectra and wavefunctions of the corresponding QES SUSYQM systems. Furthermore, we present numerical results for higher excited states up to the $n=10$ level. The results obtained may have wider applicability as our framework is built on ODEs with polynomial coefficients.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21396v1",
    "categories": [
      "math.LO",
      "math.CT"
    ],
    "authors": [
      "Rafał Gruszczyński",
      "Paula Menchón",
      "William Zuluaga"
    ],
    "title": "Extended Contact Algebras: Algebraic analysis and duality theory",
    "abstract": "The ternary extended contact relation was introduced in (Ivanova, 2020) as a more expressive counterpart of the standard binary contact relation. The class of Boolean algebras expanded with the relation was named Extended Contact Algebras (ECAs). In this work, we take an algebraic perspective on ECAs, interpreting the ternary relation as a form of entailment. We introduce Pseudo-Inference Algebras, purely algebraic tructures where the ternary relation is replaced by a monotone ternary operator, capturing the logical character of extended contact. We show that the subclass of relational Pseudo-Inference Algebras corresponds precisely to ECAs and generates a subvariety of strict PSI-Algebras, which forms a discriminator variety. Furthermore, we extend Stone duality to this ternary context, introducing descriptive PSI-frames and establishing three interrelated dualities that differ in their morphisms while sharing the same class of topological objects. The framework developed in the paper provides a nified relational semantics for Boolean algebras equipped with monotone ternary operators, connecting spatial and logical notions within a categorical and topological setting.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21360v1",
    "categories": [
      "math.FA",
      "math.OA"
    ],
    "authors": [
      "Sachin Manjunath Naik",
      "P. Sam Johnson"
    ],
    "title": "On unbounded complementable operators",
    "abstract": "The concept of complementability is extended from bounded operators to densely defined operators on Hilbert spaces. By introducing appropriate projections and decomposition techniques, a framework is developed for analyzing complementability in this broader context. The results provide new insights into the structure of unbounded operators, contributing to the ongoing development of operator theory.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21341v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Xiao-Yu Yan",
      "Wen-Hui Ai"
    ],
    "title": "Spectrality and non-spectrality of a class of Moran measures with three-element digits",
    "abstract": "A Borel probability measure \\( μ\\) with compact support on \\( \\mathbb{R}^n \\) is called spectral measure if there exists a discrete set \\( Λ\\subset \\mathbb{R}^n \\) such that \\( E_Λ:= \\{e^{2πi \\langle λ, x \\rangle}: λ\\in Λ\\} \\) forms an orthonormal basis of \\( L^2(μ) \\). In this paper, we study the spectrality and non-spectrality of a class of Moran measures with three-element digits on \\( \\mathbb{R} \\). Let $p_n\\in 3\\mathbb Z\\setminus\\{0\\}$ and $\\mathcal{D}_n=\\{0,a_n,b_n\\}$ with $\\{a_n,b_n\\}=\\{-1,1\\}\\pmod 3$. It is know that the infinite convolution of uniformly discrete probability measures $$μ_{\\{p_n\\},\\{\\mathcal D_n\\}}:=δ_{p_1^{-1}\\{0,a_1,b_1\\}}\\astδ_{(p_1p_2)^{-1}\\{0,a_2,b_2\\}}\\ast\\cdots $$ is a Moran measure with compact support if and only if \\begin{align*} \\sum_{n=1}^{\\infty}|p_{1}p_{2}\\cdots p_n|^{-1}d_n<\\infty,\\quad \\mbox{where}\\;d_n=\\max\\{0,|a_n|, |b_n|\\}. \\end{align*} Without the condition $\\sup_{n\\geq 1}\\{\\frac{|a_n|+|b_n|}{|p_n|}\\}<\\infty$, we give two sufficient conditions under which that $μ_{\\{p_n\\},\\{\\mathcal D_n\\}}$ is a spectral measure. If $p_n=p>2$ and $\\mathcal{D}_n=\\{0,a_n,b_n\\}$ with $\\gcd(a_n,b_n)=1$, we also find an useful condition to guarantee that $μ_{p,\\{\\mathcal D_n\\}}$ is not a spectral measure. Our results extend some known theorems in An et al. [JFA, 2019] and Lu et al. [JFAA, 2022].",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20915v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Noah Jensen",
      "Stephanie Treneer"
    ],
    "title": "Toward a Canonical Representation of Blocked Rectangular Grids with an Application to Finite Tiling Problems",
    "abstract": "Given the collection of all $m\\times n$ rectangular grids which have a fixed number $1\\leq r\\leq mn$ of blocked cells, we explicitly describe a proper subset of the collection which is guaranteed to contain at least one grid from each equivalence class under symmetry, eliminating the majority of redundant grids. We analyze the extent to which redundant grids remain in the reduced set, and give general cases in which our methods exactly produce a complete set of canonical representatives for the equivalence classes. As an application of our results, we specify collections of polyomino tiling problems and find all solvable grids in each collection.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21224v1",
    "categories": [
      "math.NA",
      "physics.flu-dyn"
    ],
    "authors": [
      "Ruofeng Feng",
      "Jack R. C. King",
      "Steven J. Lind"
    ],
    "title": "A p-adaptive high-order mesh-free framework for fluid simulations in complex geometries",
    "abstract": "This paper presents a novel p-adaptive, high-order mesh-free framework for the accurate and efficient simulation of fluid flows in complex geometries. High-order differential operators are constructed locally for arbitrary node distributions using linear combinations of anisotropic basis functions, formulated to ensure the exact reproduction of polynomial fields up to the specified p order. A dynamic p-refinement strategy is developed to refine (increase) or de-refine (decrease) the polynomial order used to approximate derivatives at each node. A new refinement indicator for mesh-free methods is proposed, based on local error estimates of the Laplacian operator, and is incorporated into the solution procedure at minimal added computational cost. Based on this error indicator, a refinement criterion is established to locally adjust the polynomial order p for the solution. The proposed adaptive mesh-free scheme is then applied to a range of canonical PDEs, and its potential is demonstrated in two-dimensional simulations of a compressible reacting flow in porous media. For the test cases studied, the proposed method exhibits potential to save up to 50% of computational costs while maintaining the specified level of accuracy. The results confirm that the developed p-adaptive high-order mesh-free method effectively captures highly non-linear regions where high-order approximation is necessary and reduces computational costs compared to the non-adaptive method, preserving high accuracy and solution stability.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21171v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Lennart Gehrmann",
      "Xavier Guitart",
      "Marc Masdeu"
    ],
    "title": "Evaluation of Bianchi Rigid Meromorphic Cocycles at Big ATR Points",
    "abstract": "We develop the tools required to effectively evaluate the Bianchi rigid meromorphic cocycles introduced by Darmon-Gehrmann-Lipnowski at big ATR points, and use them to obtain the first numerical verification of the conjectured algebraicity of these special values. Moreover, our computations suggest that these special values exhibit behaviour analogous to that of the special values of Borcherds products on Hilbert modular surfaces at big CM points.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21645v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "R. Alonso",
      "B. Lods",
      "I. Tristani"
    ],
    "title": "The hydrodynamic limit of viscoelastic granular gases",
    "abstract": "We obtain the first rigorous derivation of an incompressible Navier-Stokes-Fourier system with self-consistent and time-dependent forcing terms from the inelastic hard-spheres Boltzmann equation associated to the relevant case of viscoelastic granular gases. The model's inelasticity is measured by the so-called restitution coefficient which, for viscoelastic particles, depends on the relative velocities of particles. Through a suitable self-similar change of variables, a balanced dynamic between energy inflow and outflow naturally emerges in the model which permits its analysis. In contrast, such balanced dynamic does not emerge naturally in the constant restitution case and has to be imposed in our previous contribution (Alonso, Lods, Tristani, Mémoires SMF). The exact self-similar rescaling, which allows to capture nontrivial inelastic-hydrodynamic effects, presents itself explicitly in terms of the Knudsen number and the restitution coefficient. The consequence of such scaling is a non-autonomous rescaled Boltzmann equation whose solutions converge, in a specific weak sense, towards the aforementioned hydrodynamic limit. The incompressible Navier-Stokes-Fourier system obtained by this process appears to be new in this context. As a byproduct of the analysis, we determine the exact dissipation rate of the granular temperature known as \\emph{Haff's law}.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21603v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Marvin Lob",
      "Rahul Singh",
      "Suhas Vijaykumar"
    ],
    "title": "Uniform inference for kernel instrumental variable regression",
    "abstract": "Instrumental variable regression is a foundational tool for causal analysis across the social and biomedical sciences. Recent advances use kernel methods to estimate nonparametric causal relationships, with general data types, while retaining a simple closed-form expression. Empirical researchers ultimately need reliable inference on causal estimates; however, uniform confidence sets for the method remain unavailable. To fill this gap, we develop valid and sharp confidence sets for kernel instrumental variable regression, allowing general nonlinearities and data types. Computationally, our bootstrap procedure requires only a single run of the kernel instrumental variable regression estimator. Theoretically, it relies on the same key assumptions. Overall, we provide a practical procedure for inference that substantially increases the value of kernel methods for causal analysis.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21153v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Takashi Goda",
      "Roswitha Hofer",
      "Kosuke Suzuki"
    ],
    "title": "Disproving the quasi-uniformity of the Halton sequences and some of Halton-type sequences",
    "abstract": "In this short article, we prove that the Halton sequence, one of the most well-known low-discrepancy sequences, is not quasi-uniform in any dimension $d \\ge 2$ with any pairwise relatively prime bases. We further disprove the quasi-uniformity of some Halton-type sequences, including the Faure sequence, which provides an alternative proof of the known results.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21527v1",
    "categories": [
      "math.OC",
      "math.DS"
    ],
    "authors": [
      "Andrei Agrachev",
      "Ivan Beschastnyi",
      "Michele Motta"
    ],
    "title": "Singular extremals of optimal control problems with $L^1$ cost",
    "abstract": "We study the optimal control problem for a control-affine system, where we want to minimize the $L^1$ norm of the control. First, we show how Pontryagin Maximum Principle (PMP) applies to this problem and we divide the extremal trajectories into two categories: regular and singular extremals. Then, we obtain a strong generalized Legendre-Clebsch condition for singular extremals and we show that this condition together with the absence of conjugate points is sufficient to ensure local strong optimality. We provide also some geometric examples where we apply our results. Finally, we prove that generalized Legendre-Clebsch condition is necessary for optimality.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21455v1",
    "categories": [
      "math.PR",
      "math.CV"
    ],
    "authors": [
      "Marcus Michelen",
      "Oren Yakir"
    ],
    "title": "A simple proof of local universality for roots of Kac polynomials",
    "abstract": "Let $f_n$ be a random polynomial of degree $n$ with i.i.d.\\ mean-zero and finite variance random coefficients. It is well known that the roots of $f_n$ cluster uniformly around the unit circle as $n$ grows large. We give a simple and self-contained proof of local universality for the correlation functions of the roots at the microscopic scale $1/n$ around a fixed point on the circle. While previous proofs of local universality were focused on studying the logarithmic potential of $f_n$, we instead directly compare the scaled random polynomial to a limiting Gaussian analytic function, and establish convergence of correlations via a soft argument, using only basic complex analysis and an anti-concentration bound of Esseen.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21055v1",
    "categories": [
      "math.DG",
      "math.AP"
    ],
    "authors": [
      "Spiro Karigiannis",
      "Sébastien Picard",
      "Caleb Suan"
    ],
    "title": "Flows of conformally coclosed $G_2$-structures with dilaton",
    "abstract": "We study flows of $G_2$-structures guided by the principle of dimensional reduction: natural geometric flows in $G_2$-geometry reduce to natural flows in complex geometry. Our main examples are the $G_2$-Laplacian coflow, which lifts the Kähler--Ricci flow, and a 7-dimensional lift of the anomaly flow on complex threefolds. The $G_2$-lift of the anomaly flow deforms conformally coclosed $G_2$-structures. We compare the $G_2$-anomaly flow to the $G_2$-Laplacian coflow, and investigate short-time existence and fixed points.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21643v1",
    "categories": [
      "math-ph",
      "cond-mat.dis-nn",
      "cond-mat.stat-mech",
      "math.PR"
    ],
    "authors": [
      "Gernot Akemann",
      "Yan V. Fyodorov",
      "Dmitry V. Savin"
    ],
    "title": "Spectral Density and Eigenvector Nonorthogonality in Complex Symmetric Random Matrices",
    "abstract": "Non-Hermitian random matrices with statistical spectral characteristics beyond the standard Ginibre ensembles have recently emerged in the description of dissipative quantum many-body systems as well as in non-ergodic wave transport in complex media. We investigate the class AI$^†$ of complex symmetric random matrices, for which available analytic results remain scarce. Using a recently proposed framework by one of the authors, we analyze this class for Gaussian entries and derive an explicit, closed-form expression for the joint distribution of a complex eigenvalue and its right eigenvector for arbitrary matrix size $N\\ge 2$ in the entire complex plane. From this, we obtain the distribution of the eigenvector non-orthogonality overlap and the mean eigenvalue density, both for finite $N$ and in the large-$N$ limit. Notably, at the spectral edge both the eigenvalue density and eigenvector statistics exhibits a limiting behavior that differs from the Ginibre universtality class. This behavior is expected to be universal, as further supported by numerical evidence for Bernoulli random matrices.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21286v1",
    "categories": [
      "math.AG",
      "math.DS"
    ],
    "authors": [
      "Gebhard Martin",
      "Giacomo Mezzedimi",
      "Davide Cesare Veniani"
    ],
    "title": "The Enriques surface of minimal entropy",
    "abstract": "Lehmer's number $λ_{10}$ is the smallest dynamical degree greater than $1$ that can occur for an automorphism of an algebraic surface. We show that $λ_{10}$ cannot be realized by automorphisms of Enriques surfaces in odd characteristic, extending a result of Oguiso over the complex numbers. In contrast, we prove that in characteristic $2$ there exists a unique Enriques surface that admits an automorphism with dynamical degree $λ_{10}$. We also provide explicit equations for the surface as well as for all conjugacy classes of automorphisms that realize $λ_{10}$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21441v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Patric Dolmeta",
      "Matteo Giordano"
    ],
    "title": "Hierarchical Besov-Laplace priors for spatially inhomogeneous binary classification",
    "abstract": "We study nonparametric Bayesian binary classification, in the case where the unknown probability response function is possibly spatially inhomogeneous, for example, being generally flat across the domain but presenting localized sharp variations. We consider a hierarchical procedure based on the popular Besov-Laplace priors from inverse problems and imaging, with a carefully tuned hyper-prior on the regularity parameter. We show that the resulting posterior distribution concentrates towards the ground truth at optimal rate, automatically adapting to the unknown regularity. To implement posterior inference in practice, we devise an efficient Markov chain Monte Carlo (MCMC) algorithm based on recent ad-hoc dimension-robust methods for Besov-Laplace priors. We then test the considered approach in extensive numerical simulations, where we obtain a solid corroboration of the theoretical results.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21680v1",
    "categories": [
      "math.DS",
      "math.CO",
      "math.NT"
    ],
    "authors": [
      "Ryan Alweiss"
    ],
    "title": "New Obstacles to Multiple Recurrence",
    "abstract": "We show that there is a set which is not a set of multiple recurrence despite being a set of recurrence for nil-Bohr sets. This answers Huang, Shao, and Ye's \\enquote{higher-order} version of Katznelson's Question on Bohr recurrence and topological recurrence in the negative. Equivalently, we construct a set $S$ so that there is a finite coloring of $\\mathbb{N}$ without three-term arithmetic progressions with common differences in $S$, but so that $S$ lacks the usual polynomial obstacles to arithmetic progressions.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21679v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Badr Elmansouri",
      "Anas Ouknine",
      "Youssef Ouknine"
    ],
    "title": "Multivalued backward stochastic differential equations with jumps and moving boundary",
    "abstract": "We prove existence and uniqueness for a one-dimensional multivalued backward stochastic differential equation with jumps. The equation involves a time-indexed family of maximal monotone operators $k_t(\\cdot)$ associated with increasing functions $k(t,\\cdot)$ taking values in $\\mathbb{R}_-$ and having domains that are intervals with time-dependent boundaries. Existence is obtained by a penalization method under a Lipschitz condition on the driver in $(y,z)$, a monotonicity condition in the jump parameter $ψ$, square-integrability of the terminal condition and the driver, and local-in-time integrability conditions on $k(\\cdot,y)$. We also address the extension to the case where the operators $k_t(\\cdot)$ act on unbounded intervals.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21648v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Tianchen Zhao"
    ],
    "title": "Extendability of group actions on K3 or Enriques surfaces",
    "abstract": "Let $X$ be a K3 or Enriques surface with good reduction. Let $G$ be a finite group acting (not necessarily linearly) on $X$. We give a criterion for this group action to extend to a smooth model of $X$ in terms of the action of $G$ on the second $\\ell$-adic cohomology groups. In particular, we generalize the result on the extendability of Galois actions on K3 surfaces by Chiarellotto, Lazda, and Liedtke. As an application, we prove that a symplectic linear group action is extendable if the residue characteristic does not divide its order. Lastly, we relate the good reduction of Enriques surfaces with that of their K3 double covers.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21642v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Pablo Rocha"
    ],
    "title": "Estimates for convolution operators on Hardy spaces associated with ball quasi-Banach function spaces",
    "abstract": "Let $0 \\leq α< n$, $N \\in \\mathbb{N}$, and let $X$ be ball quasi-Banach function spaces on $\\mathbb{R}^n$. We consider operators $T_α$ defined by convolution with kernels of type $(α, N)$. Assuming that the powered Hardy-Littlewood maximal operator satisfies some Fefferman-Stein vector-valued maximal inequality on $X$ and is bounded on the associated space, we study the behavior of operator $T_α$ on the Hardy space $H_{X}(\\mathbb{R}^{n})$ associated to ball quasi-Banach function space $X$. We also provide an off-diagonal Fefferman-Stein vector-valued inequality for the fractional maximal operator on the $p$-convexification of ball quasi-Banach function spaces.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21230v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Patrik Knopf",
      "Anastasija Pešić",
      "Dennis Trautwein"
    ],
    "title": "Curvature-driven pattern formation in biomembranes: A gradient flow approach",
    "abstract": "In this work, we study a phase-field model for curvature-driven pattern formation in biomembranes. The model is derived as a gradient flow of an energy functional that approximates the two-phase Canham--Helfrich energy. This leads to a Cahn--Hilliard-type equation with cross diffusion for the relative chemical concentration of one lipid phase, coupled to a fourth-order reaction-diffusion equation describing the height profile of the membrane. We first prove the existence of weak solutions for the case of regular double-well potentials, using a minimizing movement scheme to construct approximate solutions. The analysis is then extended to singular potentials, e.g., the Flory--Huggins potential, by approximating them with a Moreau--Yosida regularization. For both cases, we establish higher regularity, continuous dependence on the initial data, and consequently the uniqueness of weak solutions. Finally, we propose a well-posed finite element discretization of the model and present numerical experiments illustrating the effect of different physical parameters on the resulting membrane patterns. Depending on the parameter regime, we observe purely striped, dotted, or snake-like structures.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21065v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Daniella Catalá",
      "Miriam Vollmayr-Lee",
      "Alejandro Bravo-Doddoli"
    ],
    "title": "Metric Lines in the Space of Curves",
    "abstract": "This paper investigates sub-Riemannian geodesics within the jet space of curves. We establish the existence of two distinct families of metric lines, that is, globally minimizing geodesics, in the $2$-jet space of plane curves. This result provides an initial contribution toward the broader classification of metric lines in jet spaces. Additionally, we present precise criteria, which characterize when a sub-Riemannian geodesic in the $2$-jet space of plane curves can be identified as a metric line.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20901v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Andrea Bonito",
      "Alan Demlow",
      "Joshua M. Siktar"
    ],
    "title": "Alleviating missing boundary conditions in elliptic partial differential equations using interior point measurements",
    "abstract": "We consider an optimal recovery problem for the Poisson problem when the boundary data is unknown. Compensating information is provided in the form of a finite number of measurements of the solution. A finite element algorithm for this problem was given in Binev et al. (2024), where measurements were assumed to be either bounded linear functionals of the solution or point measurements at locations lying anywhere in the closure of the computational domain. In contrast, we focus on the case of point measurements at locations lying in the interior of the domain. This lowers the regularity requirements placed on the solution. Also, a key ingredient in the recovery process is the finite element approximation of Riesz representers associated with the measurements. Our main result is a pointwise error estimate for the Riesz representers. We apply this to obtain improved estimates which measure the performance of the recovery algorithm in various norms.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21548v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Wen-Tai Hsu"
    ],
    "title": "Metastability of diffusion processes in narrow tubes",
    "abstract": "We study the metastable behavior of diffusion processes in narrow tube domains, where the metastability is induced by entropic barriers. We identify a sequence of characteristic time scales $\\{T_ε^i\\}_{1 \\leq i \\leq \\abs{V'}}$ and characterize the asymptotic behavior of the diffusion process both at intermediate time scales and at the first critical time scale. Our analysis relies on a refined understanding of the narrow escape problem in domains with bottlenecks, in particular on estimates for the exit place and on the conditional distribution of the exit time given the exit place, results that may be of independent interest.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21498v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Anna Mazzucato",
      "Anping Pan"
    ],
    "title": "Variational Principle and Stochastic Lagrangian Formulation of Viscous Hydrodynamic Equations",
    "abstract": "In this manuscript, we extend the Lagrangian formulation of \\cite{CI08} for Navier-Stokes Equation to a wider class of hydrodynamic models. Moreover, we prove that such Lagrangian formulation is naturally derived from a stochastic Hamilton-Pontryagin type variational principle. Generalized version of Kelvin circulation theorem in viscous fluids is discussed. We also derive self-contained local well-posedness results of some fluid equations based on Lagrangian-Eulerian formulation using fixed point argument.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21492v1",
    "categories": [
      "math.DG",
      "math.AP",
      "math.CV"
    ],
    "authors": [
      "Jixiang Fu",
      "Shing-Tung Yau",
      "Dekai Zhang"
    ],
    "title": "The Critical LYZ equation in Kähler Geometry",
    "abstract": "We establish the existence of smooth solutions for the LYZ equation at the critical phase $θ=(n-2)\\fracπ{2}$, thereby solving the critical case of a problem posed by Collins-Jacob-Yau\n  and Li concerning the solvability for phase $θ\\leq (n-2)\\fracπ{2}$. As applications, we solve the 3D Hessian equation $σ_2 = 1$ and the 4D Hessian quotient equation $σ_3 = σ_1$ under weaker assumptions than previously required.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21482v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Shalmali Bandyopadhyay",
      "Briceyda B. Delgado",
      "Nsoki Mavinga",
      "Maria Amarakristi Onydio"
    ],
    "title": "Existence results for quasimonotone semilinear coupled elliptic systems via sub-supersolution method",
    "abstract": "We establish the existence of weak solutions of coupled systems of elliptic partial differential equations with quasimonotone nonlinearities in the domain interior and on the boundary. When the nonlinearities satisfy some monotonicity conditions, we employ monotone iteration techniques to establish the existence of minimal and maximal weak solutions between an ordered pair of sub- and supersolution. In the absence of monotonicity, we prove an existence result when the nonlinearities satisfy certain growth conditions. In addition, we provide concrete examples that illustrate the applicability of our theoretical results.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21447v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Seyyed Sadegh Kazemipoor",
      "Hadiseh Ebrahimi"
    ],
    "title": "A Laplacian System With Sign-Changing Weight Function",
    "abstract": "We prove the existence of at least one positive solution for the Laplacian system\\\\ -Δv=λa(x)|v|^{q-2}v+β\\fracβ{α+β}b(x)|u|^α|v|^{β-2}v&$for~$x\\inΩ$$ $$ \\end{array}\\right.$$ On a bounded region $Ω$ by using the Nehari manifold and the fibering maps associated with the Euler functional for the system.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21433v1",
    "categories": [
      "math.QA",
      "math-ph"
    ],
    "authors": [
      "Nicolas Crampe",
      "Loic Poulain d'Andecy",
      "Luc Vinet"
    ],
    "title": "Polynomials of the Askey scheme as Clebsch-Gordan coefficients",
    "abstract": "Given a semi-simple algebra equipped with a coproduct, the Clebsch--Gordan coefficients are the elements of the transition matrices between direct product representation and its irreducible decomposition. It is well known that the Clebsch--Gordan coefficients of the Lie algebra $sl_2$ are given in terms of the dual Hahn polynomials. Taking the reversed point of view, we show that any finite dimensional family of polynomials belonging to the Askey scheme can be interpreted as Clebsch--Gordan coefficients of an algebra. The Hahn polynomials are thus associated to the oscillator algebra with the Krawtchouk polynomials treated through a limit. The dual Hahn polynomials and Racah polynomials are seen to be associated to $sl_2$ with a more general coproduct than the standard one. The $q$-Hahn polynomials are interpreted as Clebsch--Gordan coefficients of a $q$-deformation of the oscillator algebra and the $q$-Racah polynomials are seen to be connected in this way to $U_q(sl_2)$ with a generalized coproduct.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21384v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Alexandros Groutides"
    ],
    "title": "Euler systems for $\\mathrm{GSp}(4)$ over imaginary quadratic fields",
    "abstract": "We construct an Euler system attached to general-type cohomological cuspidal automorphic representations of $\\mathrm{GSp}(4)$ twisted by a Groessencharacter of an imaginary quadratic field. We then use this to bound strict Selmer groups under standard hypotheses. In addition, our approach gives a way of extending the $\\mathrm{GSp}(4)\\times\\mathrm{GL}(2)$ Euler system of Hsu-Jin-Sakamoto to a motivic statement which also covers certain small weights omitted in op.cit..",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21358v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Geraldo Botelho",
      "Ariel Monção"
    ],
    "title": "L- and M-weakly compact multilinear operators and their adjoints",
    "abstract": "Let $X_1, \\ldots, X_m$ be Banach spaces and let $E_1, \\ldots, E_m,F$ be Banach lattices. Our main results read as follows: (i) The adjoint $A^*$ of a continuous multilinear operator $A \\colon X_1 \\times \\cdots \\times X_m \\to F$ is $M$-weakly compact if and only if $A$ is $L$-weakly compact. (ii) The adjoint $A^*$ of a multilinear operator of order bounded variation $A \\colon E_1 \\times \\cdots \\times E_m \\to F$ is $L$-weakly compact if and only if the linearization of $A$ on the positive projective tensor product is $M$-weakly compact. In our way to prove these results, we develop the basic theory of adjoints of multilinear operators between Riesz spaces, we prove that multilinear operators of order bounded variation between Banach lattices are continuous, and we explore different notions of multilinear operators of $M$-weakly compact-type.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21353v1",
    "categories": [
      "math.NT",
      "math.AG",
      "math.RA"
    ],
    "authors": [
      "V. V. Bavula"
    ],
    "title": "Analogue of the Galois Theory for arbitrary finite field extensions",
    "abstract": "This paper is a finishing touch to the (over 200 years) {\\em classical} `Galois Theory' of {\\em arbitrary} finite field extensions, i.e. the goal of it is to describe intermediate subfields of an arbitrary finite field extension via {\\em invariants} of `natural/obvious' objects that are associated with subfields via two Galois-type correspondences.\n  The classical Galois Theory covers the case of finite Galois field extensions. For finite Galois field extensions the objects are their Galois groups and their invariants.\n  In \\cite{GaloisTh-RingThAp}, we introduce a new (ring theoretic) approach to the Galois Theory which is based on\n  the {\\em principle of maximal symmetry}. In \\cite{AnGaloisTh-NORMAL-Fields}, the maximal symmetry of {\\em normal} finite field extensions yields an analogue of the Galois Theory for them. For a normal finite field extension $L/K$ the `natural/obvious' objects are the subalgebra $\\CD (L/K)\\rtimes G(L/K)$ of $\\End (L/K)$ that is generated by the automorphism group $G(L/K)$ and the algebra $\\CD (L/K)$ of differential operators on $L/K$ and its `invariants'. The `maximal symmetry' means the equality $\\End (L/K)=\\CD (L/K)\\rtimes G(L/K)$ which turns out to be a characteristic property of {\\em normal} finite field extensions, \\cite{AnGaloisTh-NORMAL-Fields}.\n  The aim of this paper is to obtain an analogue of the Galois Theory for {\\em arbitrary} finite field extensions based on results and ideas of \\cite{GaloisTh-RingThAp} and \\cite{AnGaloisTh-NORMAL-Fields}.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21349v1",
    "categories": [
      "math.AP",
      "math.DG"
    ],
    "authors": [
      "Dario Corona",
      "Stefano Nardulli",
      "Ramon Oliver-Bonafoux",
      "Giandomenico Orlandi"
    ],
    "title": "Multiplicity of solutions for Gross-Pitaevskii equations on Riemannian manifolds",
    "abstract": "We provide a multiplicity result for solutions of time-independent Gross-Pitaevskii equations on closed Riemannian manifolds. Such solutions arise as (possibly non-minimizing) critical points of the Ginzburg-Landau energy having prescribed momentum according to a given tangent velocity field. Lower bounds on the multiplicity of solutions are obtained in terms of the topology of the maximum velocity set, in the small momentum and vorticity core size regime. The proof relies on methods from critical point theory and $Γ$-convergence for Ginzburg-Landau functionals as well as on some new results for codimension 2 isoperimetric-type problems in the small flux regime, possibly of independent interest.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20829v1",
    "categories": [
      "math.NT",
      "math.CO"
    ],
    "authors": [
      "Robert Schneider"
    ],
    "title": "Partition-theoretic model of prime distribution, II",
    "abstract": "In recent work by Botkin, Dawsey, Hemmer, Just and the present author, a deterministic model of prime number distribution is developed based on properties of integer partitions that gives almost exact estimates for $π(n)$, the number of primes less than or equal to positive integer $n$, up to $n=10{,}000$. In this follow-up paper, the author summarizes the ideas behind this partition-theoretic model of primes and formulates a computational model that is practically exact in its estimates of $π(n)$ up to $n=100,000$.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20815v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Saddam Hijazi",
      "Nikiema Fulgence",
      "Hannah Burmester",
      "Natalie Rauter",
      "Carmen Gräßle"
    ],
    "title": "Data-driven model order reduction for wave propagation in materials with nonlinearities or damage",
    "abstract": "In this work, we consider wave propagation in materials characterized by nonlinear properties or damage. To accelerate the simulations of the resulting high-dimensional problems, we apply model order reduction methods. Depending on the knowledge of the underlying equations and the availability of their discrete operators, intrusive methods (here projection-based approaches based on proper orthogonal decomposition (POD)) or non-instrusive methods (here data-driven approaches including dynamic mode decomposition (DMD) and operator inference (OpInf)) can be used. We recall the theoretical foundations of the methods and apply them to the problem of wave propagation. In three different numerical examples, we evaluate the performance of the reduction techniques.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20773v1",
    "categories": [
      "math.DG",
      "math-ph"
    ],
    "authors": [
      "Aaron Kennon",
      "Jeffrey Streets"
    ],
    "title": "The canonical symmetry reduction of string backgrounds",
    "abstract": "String backgrounds, defined here as metric connections with skew-symmetric torsion and reduced holonomy, yield generalized Ricci solitons relative to the Lee vector field. By a variational argument using the string action, they are also gradient generalized Ricci solitons relative to a potential function. These two observations combine to yield a canonical symmetry, and in this work we derive fundamental features of the transverse geometry, and rigidity phenomena. We prove in a unified conceptual fashion that the transverse geometry satisfies the string generalized Ricci soliton equations (a simplified Hull-Strominger system) in many settings including almost Hermitian, almost contact, $SU(3)$, $G_2$, and $\\mathrm{Spin}(7)$ geometry. We also show that the transverse geometry is always conformally co-closed, with the conformal factor given by the associated soliton potential.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20743v1",
    "categories": [
      "math.LO",
      "cs.LO"
    ],
    "authors": [
      "Matthew Frank"
    ],
    "title": "The Dual of Quantifier Elimination: Boolean Elimination over C and R",
    "abstract": "We show that every finite Boolean combination of polynomial equalities and inequalities in C^n admits two uniform normal forms: an $\\exists\\forall$ form and a $\\forall\\exists$ form, each using a single polynomial equation. Both forms have one existentially quantified variable and one universally quantified variable; regardless of the complexity of the original formula, no longer quantifier blocks are needed. The constructions are explicit and have linear degree bounds. Optimality results demonstrate that no purely existential or universal normal form is possible over C.\n  Over R, similar normal forms exist, including a singly-quantified $\\exists$ form for Boolean combinations of equations and inequations, and $\\exists^d$ and $\\forall\\exists$ forms for Boolean combinations involving order inequalities. Prior results establish the existence of a $\\exists$ normal form for R by other methods. Finally, similar forms exist over Q as well.\n  These results may be viewed as a dual to classical quantifier elimination: instead of removing quantifiers at the cost of increased Boolean complexity, they remove Boolean structure at the cost of a short, fixed quantifier prefix.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20724v1",
    "categories": [
      "math.CO",
      "math.LO"
    ],
    "authors": [
      "Karol Duda"
    ],
    "title": "Hall's Harem Theorem with controlled sizes of cycles",
    "abstract": "We prove a new version of Hall's Harem Theorem, where the final matching is realized by a unary function with additional conditions on behavior of cycles. The present paper can be considered as a helpful companion of the paper of the author: arXiv:2105.06304, where a computable version of Hall's Harem Theorem with controlled sizes of cycles is proved. These two versions of Hall's Harem Theorem are independent: none of them follows from the other one.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21030v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Hanamantagouda P. Sankappanavar"
    ],
    "title": "Unorthodox Algebras and their associated Unorthodox Logics",
    "abstract": "This paper grew out of our investigation into a simple, but natural, question: Can 'F implies T' be distinct from F and T? To this end, we introduce five 'unorthodox' algebras that will play a major role, not only in providing a positive answer to the question, but also in their similarity to the 2-element Boolean algebra 2. Yet, they are remarkably dissimilar from 2 in many respects. In this paper, we will examine these five algebras both algebraically and logically. We define, and initiate an investigation into, a subvariety, called RUNO1, of the variety of De Morgan semi-Heyting algebras and show that RUNO1 is, in fact, the variety generated by the five algebras. Then several applications of this theorem are given. It is shown that RUNO1 is a discriminator variety and that all five algebras are primal. It is also shown that every subvariety of RUNO1 satisfies the Strong Amalgamation Property and the property that epimorphisms are surjective (ES). It is shown that the lattice of subvarieties of RUNO1 is a Boolean lattice of 32 elements. The bases for all the subvarieties of RUNO1 are also given. We introduce a new logic called mathcal{RUNO1} and show that it is algebraizable with the variety RUNO1 as its equivalent algebraic semantics. We then present axiomatizations for all 32 axiomatic extensions of mathcal{RUNO1} and deduce that all the axiomatic extensions are decidable. The paper ends with some open problems.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21014v1",
    "categories": [
      "math.QA",
      "math.RT"
    ],
    "authors": [
      "Raymond Matson",
      "Peter Samuelson"
    ],
    "title": "Stated Skeins and DAHAs",
    "abstract": "Skein algebras of surfaces quantize character varieties of topological surfaces, and in low genus, these quantizations are often related to algebras arising in representation theory. For example, Terwilliger defined a universal $SL_2$ spherical double affine Hecke algebra $A$; a combination of results in the literature shows $A$ is isomorphic to the $SL_2$ skein algebra of the punctured torus.\n  Stated skein algebras are a generalization which quantize decorated character varieties. In this paper, we used stated skein algebras to construct a new embedding of $A$ into a rank 6 quantum torus, and we show that each marked 3-manifold with a torus boundary produces a module over $A$. We also determine a generating set for the stated skein algebra of $T^2\\setminus D^2$, and we find many relations; however, finding a complete list of relations is still an open problem.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20966v1",
    "categories": [
      "math.RT",
      "math.CO"
    ],
    "authors": [
      "Takeshi Ikeda",
      "Shinsuke Iwao",
      "Mark Shimozono"
    ],
    "title": "Equivariant homology of the symplectic affine Grassmannian and dual affine Schur $P$-functions",
    "abstract": "We study the torus-equivariant homology $H_*^T(\\mathrm{Gr}_G)$ of the affine Grassmannian $\\mathrm{Gr}_G$, where $G=\\mathrm{Sp}_{2n}(\\mathbb{C})$ is the symplectic group. This homology admits a natural ring structure and a Schubert basis, giving rise to a well-defined Schubert calculus. We realize $H_*^T(\\mathrm{Gr}_G)$ in terms of symmetric functions. Our first main result introduces a new family of symmetric functions, called the \\emph{dual affine Schur $P$-functions}, which represent the Schubert classes. These functions are defined through the action of the affine nil-Hecke algebra, and specialize, in the stable limit as $n\\to \\infty$, to the dual factorial $P$-functions of Nakagawa and Naruse. Our second main result gives a precise comparison between this symmetric function model and the geometric construction of $H_*^T (\\mathrm{Gr}_G)$ due to Ginzburg and Peterson, which identifies it with a coordinate ring of a centralizer family in the Langlands dual group.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20898v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Vertti Hietanen",
      "Mikyoung Lee"
    ],
    "title": "Higher integrability for minimizers under weighted generalized Orlicz growth conditions",
    "abstract": "We investigate variational integrals in a weighted framework under generalized Orlicz growth conditions. Assuming that the weight belongs to a Muckenhoupt class and the growth function satisfies appropriate structural conditions, we prove that the gradient of any local quasiminimizer has local higher integrability. This result extends the previous higher integrability result to the weighted setting, encompassing as particular cases the weighted variable exponent and weighted double phase frameworks. In addition, we establish the existence of minimizers for the associated functional.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20866v1",
    "categories": [
      "math.CO",
      "cs.CG",
      "math.MG"
    ],
    "authors": [
      "Alexey Fakhrutdinov",
      "Oleg R. Musin"
    ],
    "title": "Orthogonal partitions into four parts",
    "abstract": "The famous pancake theorem states that for every finite set $X$ in the plane, there exist two orthogonal lines that divide $X$ into four equal parts. We propose an algorithm whose running time is linear in the number of points in $X$ and prove that this complexity is optimal. We also consider generalizations of the pancake theorem and show that orthogonal hyperplanes can be found in polynomial time.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21302v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Stefano Berrone",
      "Lorenzo Neva",
      "Moreno Pintore",
      "Gioana Teora",
      "Fabio Vicini"
    ],
    "title": "The Zipped Finite Element Method: High-order Shape Functions for Polygons",
    "abstract": "In this paper, we present a new polygonal finite element method, called the Zipped Finite Element Method, for star-shaped polygons. The proposed approach constructs high-order shape functions as linear combinations of standard finite element basis functions defined on a local trivial sub-triangulation of each element. This refinement is used solely for the construction of the shape functions and does not affect the final number of degrees of freedom. The resulting finite element space includes polynomials of the desired order and preserves conformity across elements. Consequently, the method inherits the convergence properties of the finite element framework under suitable mesh assumptions. Numerical experiments confirm the expected rates of convergence.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21288v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Chunkai Xu"
    ],
    "title": "Stronger Bogomolov--Gieseker type inequality on quintic threefold",
    "abstract": "We establish a stronger Bogomolov--Gieseker type inequality for slope-semistable sheaves on the smooth quintic threefold. Our approach combines a refined restriction theorem for tilt-stable objects with explicit Clifford-type bounds for semistable bundles on plane quintic curves. As a consequence, we obtain an explicit piecewise linear inequality on the Chern characters of any slope-semistable sheaf improving upon the classical Bogomolov--Gieseker bound and implying Toda's conjectural inequality.\n  The method also yields a stronger Bogomolov--Gieseker type inequality on smooth quintic surfaces.\n  These results provide new evidence toward the existence of a Bridgeland stability condition of Gepner type on the quintic threefold.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21275v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Henrik Ueberschaer"
    ],
    "title": "A Liouville-type theorem for Schrödinger equations with nonnegative potential",
    "abstract": "Let $u$ be a solution of $Δu=Vu$ on $\\mathbb{R}^d$, where $V$ be continuous, nonnegative and bounded. We prove that the condition $$\\int_{r_j\\leq|x|\\leq r_j+1}|u(x)|^2dx\\to 0,$$ along any sequence $(r_j)$, $r_j\\nearrow+\\infty$, implies $u\\equiv 0$ on $\\mathbb{R}^d$. In particular, this implies the Landis conjecture for solutions satisfying a sufficiently fast algebraic decay. These results are generalized to exterior domains as well as for a class of nonlinear Schrödinger equations under suitable conditions on the zero set of the potential.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21178v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Qi Yan"
    ],
    "title": "Stochastic Curve Shortening Flow with Scale-Dependent Noise",
    "abstract": "In this paper, we study the motion by mean curvature of curves in the plane perturbed by scale-dependent noise. We first introduce a so-called scale-dependent noise from the physics background to the curve shortening flow. To be more precise, the scale-dependent noise defined on a curve is a noise whose intensity is proportional to the length of the curve. To get the well-posedness of stochastic curve shortening flow driven by scale-dependent noise, we equivalently formulate the stochastic curve shortening flow as a one-phase stochastic Stefan problem of its curvature parameterized by the arclength parameter and its length. After rewriting the one-phase stochastic Stefan problem as a quasilinear evolution equation, we apply the theory for quaslinear stochastic evolution equations developed by Agresti and Veraar in 2022 to get maximal unique local strong solution for the stochastic curve shortening flow up to a maximal stopping time which is characterized by a blow-up criterion.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.21170v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Swathi Shetty",
      "Sayinath Udupa N. V.",
      "B. R. Rakshith"
    ],
    "title": "Secure coalitions in graphs",
    "abstract": "A secure coalition in a graph $G$ consists of two disjoint vertex sets $V_1$ and $V_2$, neither of which is a secure dominating set, but whose union $V_1 \\cup V_2$ forms a secure dominating set. A secure coalition partition ($sec$-partition) of $G$ is a vertex partition $π= \\{V_1, V_2, \\dots, V_k\\}$ where each set $V_i$ is either a secure dominating set consisting of a single vertex of degree $n-1$, or a set that is not a secure dominating set but forms a secure coalition with some other set $V_j \\in π$. The maximum cardinality of a secure coalition partition of $G$ is called the secure coalition number of $G$, denoted $SEC(G)$. For every $sec$-partition $π$ of a graph $G$, we associate a graph called the secure coalition graph of $G$ with respect to $π$, denoted $SCG(G,π)$, where the vertices of $SCG(G,π)$ correspond to the sets $V_1, V_2, \\dots, V_k$ of $π$, and two vertices are adjacent in $SCG(G,π)$ if and only if their corresponding sets in $π$ form a secure coalition in $G$. In this study, we prove that every graph admits a $sec$-partition. Further, we characterize the graphs $G$ with $SEC(G) \\in \\{1,2,n\\}$ and all trees $T$ with $SEC(T) = n-1$. Finally, we show that every graph $G$ without isolated vertices is a secure coalition graph.",
    "date": "11-27"
  },
  {
    "link": "https://arxiv.org/pdf/2511.20681v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Leonidas Mindrinos",
      "Nikolaos Pallikarakis",
      "Nikolaos L Tsitsas"
    ],
    "title": "Inverse Electromagnetic Scattering for Doubly-Connected Cylinders using Convolutional Neural Networks",
    "abstract": "In this work, we consider the inverse electromagnetic scattering problem for a magneto-dielectric cylinder covering an impedance cylinder of arbitrary shape. We solve it by introducing a divide-and-conquer framework using specially designed 1D multi-channel, circular-padding Convolutional Neural Networks. The solution of the direct problem provides us with the real and imaginary components of the far-field measurements representing the input data. We first classify the shape of the impedance cylinder and then reconstruct the unknown boundary curve and the impedance function. Through extensive numerical experiments, including noisy scenarios, we demonstrate the efficiency and robustness of our approach.",
    "date": "11-27"
  }
]