[
  {
    "link": "https://arxiv.org/pdf/2512.15208v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "C. R. Jayanarayanan",
      "Rishit R Rajpopat"
    ],
    "title": "On Bhatia-Šemrl Property, Strong Subdifferentiability and Essential Norm of Operators on Banach Spaces",
    "abstract": "We investigate the interplay among three key properties of bounded linear operators between Banach spaces: the Bhatia-Šemrl property, strong subdifferentiability and the condition that the essential norm is strictly less than the operator norm. For a Hilbert space $H$ and for $1<p,q<\\infty$, we show that for any operator in $B(H)$ and $B(\\ell_p, \\ell_q)$, the essential norm is strictly less than the operator norm if and only if it is the point of strong subdifferentiability of the norm and its norm-attainment set is compact. Moreover, for operators in these spaces that satisfy the Bhatia-Šemrl property, we show that their essential norm must be strictly less than their operator norm. We also study norm one projections satisfying the Bhatia-Šemrl property and provide examples of operators that possess this property.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15197v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Rui Yang",
      "Xiaoyao Zhou"
    ],
    "title": "Metric mean dimension and the variational principle for actions of amenable groups",
    "abstract": "Metric mean dimension is a dynamical counterpart of the box dimension in fractal geometry to characterize the topological complexity of infinite entropy systems. The classical variational principle states that topological entropy equals the supremum of measure-theoretic entropy over the set of invariant measures. Lindenstrauss and Tsukamoto proved that this variational principle fails for metric mean dimension in terms of rate-distortion dimensions. For the actions of amenable groups, we define a new measure-theoretic metric mean dimension for invariant measures and establish a classical-type variational principle for metric mean dimension. In particular, we extend the Lindenstrauss-Tsukamoto variational principles to the classical variational principle by defining modified rate-distortion dimensions.\n  As applications, for systems with zero metric mean dimension, we introduce infinite entropy dimensions in both topological and measure-theoretic settings, and relate them via a variational principle. For systems with positive metric mean dimension, we introduce local metric mean dimension from a local perspective, and relate it to the metric mean dimension of the whole phase space via variational principles.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15189v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Zhao Zhu",
      "Yu-Ping Tian",
      "Xuyang Wu"
    ],
    "title": "Historical Information Accelerates Decentralized Optimization: A Proximal Bundle Method",
    "abstract": "Historical information, such as past function values or gradients, has significant potential to enhance decentralized optimization methods for two key reasons: first, it provides richer information about the objective function, which also explains its established success in centralized optimization; second, unlike the second-order derivative or its alternatives, historical information has already been computed or communicated and requires no additional cost to acquire. Despite this potential, it remains underexploited. In this work, we employ a proximal bundle framework to incorporate the function values and gradients at historical iterates and adapt the framework to the proximal decentralized gradient descent method, resulting in a Decentralized Proximal Bundle Method (DPBM). To broaden its applicability, we further extend DPBM to the asynchronous and stochastic setting. We theoretically analysed the convergence of the proposed methods. Notably, both the asynchronous DPBM and its stochastic variant can converge with fixed step-sizes that are independent of delays, which is superior to the delay-dependent step-sizes required by most existing asynchronous optimization methods, as it is easier to determine and often leads to faster convergence. Numerical experiments on classification problems demonstrate that by using historical information, our methods yield faster convergence and stronger robustness in the step-sizes.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15184v1",
    "categories": [
      "math.PR",
      "math.AP"
    ],
    "authors": [
      "Hakima Bessaih",
      "Benedetta Ferrario",
      "Oussama Landoulsi",
      "Margherita Zanella"
    ],
    "title": "Continuous data assimilation for 2D stochastic Navier-Stokes equations",
    "abstract": "Continuous data assimilation methods, such as the nudging algorithm introduced by Azouani, Olson, and Titi (AOT) [2], are known to be highly effective in deterministic settings for asymptotically synchronizing approximate solutions with observed dynamics. In this work, we extend this framework to a stochastic regime by considering the two-dimensional incompressible Navier-Stokes equations subject to either additive or multiplicative noise. We establish sufficient conditions on the nudging parameter and the spatial observation scale that guarantee convergence of the nudged solution to the true stochastic flow.\n  In the case of multiplicative noise, convergence holds in expectation, with exponential or polynomial rates depending on the growth of the noise covariance. For additive noise, we obtain the exponential convergence both in expectation and pathwise. These results yield a stochastic generalization of the AOT theory, demonstrating how the interplay between random forcing, viscous dissipation and feedback control governs synchronization in stochastic fluid systems.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15156v1",
    "categories": [
      "math.MG"
    ],
    "authors": [
      "Chadi Nour"
    ],
    "title": "Spherically Supported Property and the Exterior Sphere Condition with Infinite Radius",
    "abstract": "We present several new characterizations of the spherically supported geometric property introduced in [19], emphasizing its connection with the exterior sphere condition with infinite radius. Moreover, we strengthen and provide a more direct and simpler proof of the main result established in [19].",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15135v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Yinshan Chang",
      "Qinwei Chen"
    ],
    "title": "The maximal correlation coefficient associated with the minimum",
    "abstract": "For independent random variables $(X_i)_{1\\leq i\\leq n}$, we consider the maximal correlation coefficient $R=R(\\min_{i:1\\leq i\\leq m}X_i,\\min_{j:\\ell+1\\leq j\\leq n}X_j)$. If $X_1,X_2,\\ldots,X_n$ are identically distributed with the same continuous distribution, we find that $R=(m-\\ell)/\\sqrt{m(n-\\ell)}$. For discrete distributions, we calculate the maximal correlation coefficient $R$ for Bernoulli distributions, geometric distributions, binomial distributions and Poisson distributions. Our paper answers a question in \\cite[Section~6]{ChangChen}.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15118v1",
    "categories": [
      "math.DS",
      "q-bio.PE"
    ],
    "authors": [
      "Parul Tiwari",
      "Malavika Smitha",
      "Hammed Olawale Fatoyinbo"
    ],
    "title": "Stochastic Modelling and Analysis of Within-Farm Highly Pathogenic Avian Influenza Dynamics in Dairy Cattle",
    "abstract": "Highly pathogenic avian influenza (HPAI) has expanded its host range with recent detections in dairy cattle, raising critical concerns regarding within-herd persistence and cross-species spillover. This study develops a stochastic $SEI_sI_aR-B$ compartmental model to analyse HPAI transmission, explicitly accounting for environmental pathogen reservoirs and noise intensities through Wiener processes. The positivity and boundedness of solutions are established, and the disease-free and endemic equilibria are analytically derived. The basic reproduction number is determined using the next-generation matrix method. Numerical simulations confirm that the model dynamics are consistent with theoretical analysis and illustrate how stochastic fluctuations significantly influence disease persistence. Furthermore, sensitivity analysis using Latin Hypercube Sampling (LHS) and Partial Rank Correlation Coefficients (PRCC) identifies the transmission rate from asymptomatic infectious cattle ($β_a$) as the primary driver of transmission. The model effectively captures the dynamics of environmental variability affecting HPAI spread, suggesting that effective control strategies must prioritise the early detection and isolation of asymptomatic carriers alongside environmental management.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15040v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Te Li",
      "Ping Zhang",
      "Yibin Zhang"
    ],
    "title": "Nonlinear asymptotic stability and optimal decay rate around the three-dimensional Oseen vortex filament",
    "abstract": "In the high-Reynolds-number regime, this work investigates the long-time dynamics of the three-dimensional incompressible Navier-Stokes equations near the Oseen vortex filament. The flow exhibits a strong interplay between vortex stretching, shearing, and mixing, which generates ever-smaller spatial scales and thereby significantly amplifies viscous effects. By adopting an anisotropic self-similar coordinate system adapted to the filament geometry, we establish the nonlinear asymptotic stability of the Oseen vortex filament. All non-axisymmetric perturbations are shown to decay at the optimal rate $t^{-κ|α|^{1/2}}$. At the linear level, this decay mechanism corresponds to a sharp spectral lower bound $Σ(α) \\sim |α|^{1/2}$ for the nonlocal Oseen operator $L_\\perp - αΛ_\\perp$, and we identify an explicit spectral point attaining this optimal bound. Combined with the spectral estimates obtained in \\cite{LWZ}, our analysis fully resolves the conjecture proposed in \\cite{GM} concerning the asymptotic scaling laws for the spectral and pseudospectral bounds $Σ(α)$ and $Ψ(α)$. These results provide a rigorous mathematical explanation for the shear-mixing mechanism in the vicinity of the 3D Oseen vortex filament.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15035v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Soong Kyum Lee"
    ],
    "title": "Staircase Minimality and a Proof of Saxl's Conjecture",
    "abstract": "Saxl's conjecture (2012) asserts that for the staircase partition $ρ_k = (k, k-1, \\ldots, 1)$, the tensor square of the corresponding irreducible representation of the symmetric group $S_{T_k}$ contains every irreducible representation as a constituent, where $T_k = k(k+1)/2$ is the $k$th triangular number. We prove this conjecture unconditionally.\n  Our proof introduces the Staircase Minimality Theorem: among all 2-regular partitions of $T_k$, the staircase $ρ_k$ is the unique dominance-minimal element. Combined with Ikenmeyer's theorem on dominance and Kronecker positivity for staircases, this establishes that every 2-regular partition appears in the tensor square. Modular saturation then follows using only the diagonal entries $d_{μμ} = 1$ of the decomposition matrix, and the Bessenrodt--Bowman--Sutton lifting theorem completes the proof.\n  We further prove that at triangular numbers, staircases are the only Kronecker-universal self-conjugate partitions, providing a complete characterization.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15007v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Kohei Suzuki",
      "Takashi Goda"
    ],
    "title": "Hidden low-discrepancy structures in random point sets",
    "abstract": "We study the probabilistic existence of point configurations satisfying the $(0, m, d)$-net property in base $b$ within a randomly generated point set in the $d$-dimensional unit cube. We first derive an upper bound on the number of geometric patterns for $(0, m, d)$-nets in base $b$. By applying the concentration inequalities together with this bound, we give lower and upper estimates for the probability that a set of $N$ random points contains a $(0, m, d)$-net as a subset. This result leads to necessary and sufficient scaling conditions on $N$ and $m$ such that this probability converges to $1$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14972v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Yiming Song"
    ],
    "title": "A Carousel Property for Compact Convex Sets",
    "abstract": "We prove that if $A_0$ and $A_1$ are compact convex sets contained in a convex $n$-gon with vertices $g_1, \\dots, g_n$, and $n$ is strictly greater than the number of common supporting lines of $A_0$ and $A_1$, then there exist $i \\in \\{0,1\\}$ and $j \\in \\{1,\\dots, n\\}$ such that $A_i$ is in the convex hull of $A_{1-i}$ and $(\\{g_1, \\dots, g_n\\} \\setminus \\{g_j\\})$. This recovers and generalizes previous results of Adaricheva--Bolat and Cz{é}dli. We also show that this bound is sharp for even $n$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14966v1",
    "categories": [
      "math.FA",
      "math.MG"
    ],
    "authors": [
      "Bruno de Mendonça Braga",
      "Chris Gartland",
      "Gilles Lancien",
      "Pavlos Motakis",
      "Eva Pernecká",
      "Thomas Schlumprecht"
    ],
    "title": "On the uniform continuity of homeomorphisms between the spheres of $\\ell_\\infty^k$ and $\\ell_1^k$",
    "abstract": "We consider the problem of whether there is a sequence of homeomorphisms $(F_k)_k$ between the unit spheres of the $k$-dimensional Banach spaces $\\ell_\\infty^k$ and $\\ell_1^k$ which is also equi-uniformly continuous. We prove that this cannot be the case if the sequence $(F_k)_k$ either (1) does not increase support sizes (which is a property strictly weaker than support preservation) or (2) is step preserving (which is a property strictly weaker than being equivariant with respect to permutations of the canonical basis). We also provide quantitative estimates relating the moduli of uniform continuity of the maps to the dimension of the spaces. This gives partial answers to a question of W. B. Johnson and it is related to the problem of whether $c_0$ has Kasparov and Yu's Property (H). Our results also apply to more general spaces other than $\\ell_1$ such as spaces with unconditional bases which are not equivalent to the standard $c_0$ basis. Finally, we derive an asymptotic concentration inequality that must be satisfied by step preserving equi-uniformly continuous maps defined on the positive parts of these unit spheres.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14949v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Tomasz Kania",
      "Jarosław Swaczyna"
    ],
    "title": "Bourgain-uo sequential completeness in vector lattices",
    "abstract": "We revisit Bourgain's 1981 counterexample to the sequential completeness of the 'pointwise plus domination' convergence on $\\ell_1$ from the perspective of vector lattices. In this setting, we show that for sequences the associated notion of Bourgain-uo convergence coincides with ordinary order convergence. Motivated by Bourgain's construction, we introduce a strengthened, subsequence-invariant notion of Cauchy sequence: a sequence $(x_n)$ in a vector lattice $E$ is called Buo-Cauchy if for every strictly increasing sequence $(n_k)$ the differences $x_{n_{k+1}}-x_{n_k}$ converge to $0$ in order in $E$. We study the resulting sequential completeness problem in several concrete Banach lattices.\n  Our main results are twofold. On the positive side, we prove that the classical sequence lattices $c_0$ and $\\ell_\\infty$ are sequentially Buo-complete: every Buo-Cauchy sequence converges in order, and hence in the Buo sense. In addition, we establish a sharp metric characterisation for bounded Lipschitz function lattices: the vector lattice $\\mathrm{Lip}_b(X)$ of bounded Lipschitz functions on a metric space $(X,d)$ is sequentially \\Buo-complete if and only if $X$ is uniformly discrete.\n  On the negative side, we show that vector lattices of continuous or Lipschitz functions over metric spaces with non-isolated points fail sequential Buo-completeness. In particular, $C(X)$, $C_b(X)$, $C_0(X)$ and $Lip_b(X)$ are not sequentially Buo-complete whenever $X$ is not uniformly discrete.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14919v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Alexey Kazakov",
      "Vladislav Koryakin",
      "Klim Safonov",
      "Andrey L. Shilnikov"
    ],
    "title": "Cascades of Lorenz attractors in the Shimizu-Morioka model",
    "abstract": "The Lorenz attractor is the first example of a robustly chaotic non-hyperbolic attractor. Each orbit of such an attractor has a positive top Lyapunov exponent, and this property persists under small perturbations despite possible bifurcations of the attractor. In this paper, we study the boundary of the Lorenz attractor existence region in the Shimizu-Morioka model. As in the classical Lorenz system, a part of the boundary is associated with the curve $l_{A=0}$, where the first tangency between some Lyapunov subspaces occurs along orbits of the attractor. However, in the Lorenz system, the curve $l_{A=0}$ forms the exact boundary of the Lorenz attractor existence region. Beyond this curve, the attractor is not robustly chaotic, although it may be indistinguishable from the Lorenz attractor in simple numerical experiments. In the Shimizu-Morioka model, the curve $l_{A=0}$ is divided into two parts. The Lorenz attractor existence region adjoins $l_{A=0}$ along the first part of this curve, as in the Lorenz system. Near the second part, as we show, the region of the existence of the Lorenz attractor is fractal. We describe two infinite cascades of disjoint subregions with the Lorenz attractor. One cascade occurs along the curve $l_{A=0}$, another -- in the transversal direction. We show that along the cascades, the Lorenz attractor undergoes ``doubling bifurcations'', leading to a complication of its topological structure.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14912v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Roberto Rossi",
      "Steven D. Prestwich",
      "S. Armagan Tarim"
    ],
    "title": "Mixed-Integer Linear Programming Approximations for the Stochastic Knapsack",
    "abstract": "We develop a novel mathematical programming approximation framework to tackle the stochastic knapsack problem. In this problem, the decision maker considers items for which either weights or values, or both, are random. The aim is to select a subset of these items to be included into their knapsack. We study both \"static\" and \"dynamic\" variants of this problem: in the static setting, the decision about which items should be included in the knapsack is taken at the outset, before any random item value or weight is revealed; in the dynamic setting, items are received sequentially, and the decision about a particular item is made by taking into account previously observed values and weights. The knapsack has a given capacity, and if the total realised weight exceeds this capacity then a penalty cost is incurred for each unit of excess capacity utilised. The goal is to maximise the expected net profit. We tackle the case of normally distributed item weights and we show that our approach extends seamlessly to the case in which item weights are correlated and follow a multivariate normal distribution. In addition, we show our approach represents an effective heuristic for the case in which item weights follow generic probability distributions. In an extensive computational study we demonstrate that our models are near-optimal and more scalable than other state-of-the-art approaches.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14901v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Marius Fischer",
      "Peter Vang Uttenthal"
    ],
    "title": "The spin of prime ideals and level-raising of even Galois representations",
    "abstract": "By extending the notion of spin of prime ideals, we show that a short character sum conjecture implies that the set of primes raising the level of a certain even Galois representation has density 2/3, as conjectured by Ramakrishna in 1998.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14877v1",
    "categories": [
      "math.NA",
      "math-ph"
    ],
    "authors": [
      "Conor Rowan"
    ],
    "title": "Extending the explicit constraint force method to inverse problems",
    "abstract": "Recently, the explicit constraint force method (ECFM) was introduced as a principled approach to solution reconstruction in the presence of missing physics. In solution reconstruction, parameters of a physical model are estimated from sparse measurement data as a means to obtain the full solution field. In contrast, inverse problems target the missing parameters and estimate the solution along the way. Noting the similarity of the mathematical formulations of these two tasks, we investigate the use of ECFM to solve inverse problems. First, we compare the ECFM formulation of the inverse problem to a standard approach using two numerical examples. The first example provides an extension of ECFM to dynamic problems, and the second offers a novel approach to treat noisy measurement data. Next, we introduce a method to solve inverse problems for which the parameterized model has stochastic components. This approach is based on constraint forces and the polynomial chaos expansion, and is illustrated with another numerical example. Finally, we discuss extensions of ECFM to recover missing boundary conditions and domain geometries from measurement data, which are shown to be special cases of problems treated previously in the literature. The purpose of this work is to extend the mathematical framework of ECFM to novel applications and to gauge the method's viability as an alternative strategy for inverse analysis.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14858v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Le Chen",
      "Ian Ruau",
      "Wenxian Shen"
    ],
    "title": "Chemotaxis models with signal-dependent sensitivity and a logistic-type source, I: Boundedness and global existence",
    "abstract": "We study, in Part I of this series, boundedness and global existence of positive classical solutions to a parabolic-elliptic chemotaxis system with signal-dependent sensitivity and a logistic-type source on a bounded smooth domain $Ω\\subset\\mathbb{R}^N$: \\begin{equation*}\n  \\begin{cases}\n  \\displaystyle u_t=Δu-χ_0\\nabla\\cdot\\left(\\frac{u^m}{(1+v)^β}\\nabla v\\right)+au-bu^{1+α}, & x\\inΩ, \\cr\n  \\displaystyle 0=Δv-μv+νu^γ, & x\\inΩ, \\cr\n  \\displaystyle \\frac{\\partial u}{\\partial n}=\\frac{\\partial v}{\\partial n}=0, & x\\in\\partialΩ.\n  \\end{cases} \\end{equation*} Here, $u$ denotes the population density and $v$ the chemical concentration. The parameters $α,γ,m,μ,ν$ are positive, $χ_0$ is real, and $a,b,β$ are nonnegative. We analyze boundedness from three viewpoints: negative chemotaxis ($χ_0<0$), the strength of the nonlinear cross diffusion rate $\\frac{u^m}{(1+v)^β}$, and the strength of the logistic-type damping $u(a-bu^α)$. Under explicit conditions reflecting these mechanisms, all positive classical solutions remain bounded. Moreover, when $m\\ge 1$, boundedness implies global existence. Although the decay of $χ(v) = \\dfrac{χ_0}{(1+v)^β}$ for large $v$ has a damping effect, it also introduces new analytical difficulties; our techniques yield, for example, global existence for $m=1$ provided that \\begin{equation*}\n  β>\\max\\left\\{1,\\frac12+\\frac{χ_0}{4}\\max\\{2,γN\\}\\right\\}. \\end{equation*} Several known results for special cases are recovered. Part II is devoted to the asymptotic behavior of globally defined solutions, including uniform persistence as well as stability and bifurcation of positive constant equilibria.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14857v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Munki Jeong",
      "Alexander Strang"
    ],
    "title": "On the Local Structure and Approximation Stability of Block Isotropic Gaussian Fields",
    "abstract": "Skew-symmetric functions are a class of functions defined on a product space $M \\times M$ that are antisymmetric with respect to the order of their inputs. In [13], the authors proved that non-deterministic skew-symmetric Gaussian fields cannot be stationary or isotropic and proposed an alternative notion: stationarity (isotropy) in each component space. Our work focuses on local quadratic approximations of the associated Gaussian fields. Local quadratic approximations to random fields are random polynomials parametrized by a jointly sampled gradient vector and Hessian matrix. We characterize the distribution of the corresponding random vectors and random matrices. Then, we study the error in the quadratic approximation, which is also a Gaussian field. We investigate the error induced by the quadratic approximation in three senses: the pointwise error, the maximal error over an ellipsoidal region, and the worst-case error for multivariate Gaussian inputs at a given confidence level. Next, we explore the limiting behavior of the worst-case error as the distance between an expansion point and evaluation points approaches zero and infinity. Finally, we study how, as the input dimension increases, the variance of multivariate Gaussian distributions must be restricted to keep the worst-case error bound constant.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15227v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Julius Ehigie",
      "Vu Thai Luan"
    ],
    "title": "Efficient high-order two-derivative DIRK methods with optimized phase errors",
    "abstract": "This work constructs and analyzes new efficient high-order two-derivative diagonally implicit Runge--Kutta (TDDIRK) schemes with optimized phase errors. Specifically, we present a convergence result for TDDIRK methods and investigate their optimized phase errors and linear stability analysis. Based on these, we derive new families of 2-stage fourth-order, 2-stage fifth-order, and 3-stage fifth-order TDDIRK schemes. Finally, we provide numerical experiments at both the ODE and PDE levels to demonstrate the accuracy and efficiency of these new schemes compared to known DIRK schemes in the literature.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15291v1",
    "categories": [
      "math.GN"
    ],
    "authors": [
      "Prasanta Malik",
      "Anirban Paul"
    ],
    "title": "I and I*-soft convergence in soft topological spaces",
    "abstract": "In this paper, we introduce the notions of I and I*-soft convergence of sequences of soft points in soft topological spaces and study some basic properties of these notions. Also we introduce the notions of I-soft limit points and I-soft cluster points of a sequence of soft points in a soft topological space and study their interrelationship",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15287v1",
    "categories": [
      "math.CV",
      "math.FA"
    ],
    "authors": [
      "Emmanuel Fricain",
      "Muath Karaki",
      "Javad Mashreghi",
      "Maëva Ostermann"
    ],
    "title": "Weighted composition operators on de Branges-Rovnyak spaces",
    "abstract": "In this paper, we characterize the boundedness and the compactness of weighted composition operators acting on a de Branges-Rovnyak space $\\mathcal H(b)$, where the symbol $b$ is a rational function in the unit ball of $H^\\infty$ that is not a finite Blaschke product. Our results extend those of [2] by exploiting a close relationship between weighted composition operators on $\\mathcal H(b)$ and their counterparts on the Hardy space $H^2$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15277v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Michał Borowski",
      "Theo Elenius",
      "Leah Schätzler",
      "David Stolnicki"
    ],
    "title": "Carleson-type removability for $p$-parabolic equations",
    "abstract": "We characterize removable sets for Hölder continuous solutions to degenerate parabolic equations of $p$-growth. A sufficient and necessary condition for a set to be removable is given in terms of an intrinsic parabolic Hausdorff measure, which depends on the considered Hölder exponent. We present a new method to prove the sufficient condition, which relies only on fundamental properties of the obstacle problem and supersolutions, and applies to a general class of operators. For the necessity of the condition, we establish the Hölder continuity of solutions with measure data, provided the measure satisfies a suitable decay property. The techniques developed in this article provide a new point of view even in the case $p=2$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15272v1",
    "categories": [
      "math.RT",
      "math-ph"
    ],
    "authors": [
      "Yoann Demesmay"
    ],
    "title": "Fused permutations algebras and degenerate affine Hecke algebras",
    "abstract": "This paper gives an algebraic presentation of an algebra called the fused permutations algebra in the one-boundary case. It is obtained through a detailed study of the degenerate cyclotomic Hecke algebra. In particular, we prove that the fused permutations algebra is a quotient of the degenerate cyclotomic affine Hecke algebra, and we also describe a basis combinatorially in terms of signed permutations with avoiding patterns. In order to understand this quotient, we study the primitive idempotents of this degenerate cyclotomic affine Hecke algebra.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15253v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Yifan Zhang",
      "Yujun Zhu"
    ],
    "title": "On equilibrium states for certain partially hyperbolic endomorphisms with one-dimensional center",
    "abstract": "In this paper, the equilibrium states for a non-degenerate $ C^2 $ partially hyperbolic endomorphism $f$ on a closed Riemannian manifold $M$ with one-dimensional center bundle are investigated. Applying the criterion of Climenhaga-Thompson (\\cite{CT21}) and the method of Mongez-Pacifico (\\cite{Mongez}), we use the techniques of inverse limit to obtain the uniqueness and robustness of equilibrium states for $f$ and any Hölder continuous potential satisfying certain conditions about the unstable pressure and stable pressure.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15241v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Yinghui Ye",
      "Ying Li",
      "Xiaoli Chu",
      "Gan Zheng",
      "Sumei Sun"
    ],
    "title": "Symbol Detection in Ambient Backscatter Communications Under Residual Time Synchronization Errors",
    "abstract": "Ambient backscatter communications (AmBC), where a backscatter transmitter (BT) modulates and reflects ambient signals to a backscatter receiver (BR), have been deemed a low-power communication technology for the Internet of Things. Previous work on symbol detection in AmBC assumed perfect time synchronization (TS), which is unrealistic in practice. The residual TS errors (RTSE) cause \\emph{partial sample mismatch}, degrading symbol detection performance. To address this, we propose a new AmBC symbol detection framework that incorporates the BT's current and adjacent symbols, as well as channel coefficients. Using energy detector (ED) as a case study, we derive both exact and approximate bit error rate (BER) expressions. Our results show that the ED's BER performance degrades significantly under RTSE, with the symbol detection threshold optimized under the assumption of perfect TS. We then derive a closed-form expression for a near-optimal symbol detection threshold that minimizes BER under RTSE. To estimate the required parameters for the detection threshold, we propose a novel method exploiting the attributes of the BR's received signal samples. The analytical results are verified by simulation results.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15238v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Yu Zhang",
      "Yujun Zhu"
    ],
    "title": "Topological pressure and equilibrium state for certain correspondences",
    "abstract": "In \\cite{Miller-Akin1999}, Miller and Akin investigated the invariant measures for correspondences, which are also known as upper semi-continuous set-valued maps. Recently, the variational principle and thermodynamic formalism for forward expansive correspondences were studied by Li, Li and Zhang \\cite{Xiaoran Li-Zhiqiang Li-Yiwei Zhang2023}. In this paper, the invariant measures and the associated transition probability kernels are explicitly expressed for certain correspondences satisfying the assumptions in \\cite{Xiaoran Li-Zhiqiang Li-Yiwei Zhang2023} via the equilibrium states of some particular potentials. Let $T$ be a correspondence on a closed connected Riemannian manifold generated by finite $C^{2}$-expanding endomorphisms. When the generators of $T$ have no coincidence point, a locally Hölder continuous potential $φ$ of two variables is defined via the Jacobians of the generators. The pressure of $φ$ and its equilibrium state $(μ, \\mathcal{Q})$ are obtained, where $μ$ is a $T$-invariant measure which is absolutely continuous with respect to the volume and $\\mathcal{Q}$ is the associated transition probability kernel satisfying $μ\\mathcal{Q}=μ$. For the correspondence $T$ on the torus whose generators have coincidence points, the variational topological pressures for measurable potentials are introduced and the corresponding equilibrium states are considered. Moreover, the uniqueness of the equilibrium states of correspondences is considered via the natural extensions.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15237v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Lorenz Halbeisen",
      "Norbert Hungerbühler",
      "Arman Shamsi Zargar"
    ],
    "title": "Integer triangles with a rational ratio of circumcircle radius to excircle radius",
    "abstract": "We consider the problem of finding integer triangles with $R/r$ a positive rational, where $R$ and $r$ are the radii of the circumcircle and an excircle, respectively. We show that for general triangles $R/r>1/4$ applies. The equation $R/r=N$ turns out to be related to the elliptic curve $\\mathcal{E}_N$ given by $v^2=u^3+2(2N^2+2N-1)u^2-(4N-1)u$. If $N>1/4$ is rational, then the torsion group of $\\mathcal{E}_N$ is $\\mathbb Z/2\\mathbb Z\\times\\mathbb Z/6\\mathbb Z$ if $N(N+2)$ is a square and $\\mathbb Z/6\\mathbb Z$ otherwise. We show that a rational triangle with rational ratio $R/r=N$ exists if and only if $N>1/4$ and there exists a rational non-torsion point on the curve $\\mathcal{E}_N$ which satisfies a certain condition. Furthermore, we show that the rank of $\\mathcal{E}_N$ is positive when $N = m^2 \\pm 1>1/4$ for a rational $m$. We also show that on every curve $\\mathcal{E}_N$ whose rank is positive, there are infinitely many rational points which lead to infinitely many non-similar integer triangles with $R/r=N$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14927v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Giuseppe Buttazzo",
      "Simone Cito",
      "Francesco Solombrino"
    ],
    "title": "Relations between principal eigenvalue and torsional rigidity with Robin boundary conditions",
    "abstract": "We consider the torsional rigidity and the principal eigenvalue related to the Laplace operator with Dirichlet and Robin boundary conditions. The goal is to find upper and lower bounds to products of suitable powers of the quantities above in the class of Lipschitz domains. The threshold exponent for the Robin case is explicitly recovered and shown to be strictly smaller than in the Dirichlet one.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14907v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Ghaith Hiary",
      "Tianyu Zhao"
    ],
    "title": "Unconditional estimates on the argument of Dirichlet $L$-functions with applications to low-lying zeros",
    "abstract": "We make explicit a result of Selberg on the argument of Dirichlet $L$-functions averaged over non-principal characters modulo a prime $q$. As a corollary, we show for all sufficiently large prime $q$ that the height of the lowest non-trivial zero of the corresponding family of $L$-functions is less than $982\\cdot \\frac{2π}{\\log q}$. Here the scaling factor $\\frac{2π}{\\log q}$ is the average spacing between consecutive low-lying zeros with height at most 1, say. We also obtain a lower bound on the proportion of $L$-functions whose first zero lies within a given multiple of the average spacing. These appear to be the first explicit unconditional results of their kinds.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14904v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Marc Kegel",
      "Isacco Nonino",
      "Monika Yadav"
    ],
    "title": "Contact surgery distance",
    "abstract": "In this article, we define the contact surgery distance of two contact 3-manifolds $(M,ξ)$ and $(M',ξ')$ as the minimal number of contact surgeries needed to obtain $(M,ξ)$ from $(M',ξ')$. Our main result states that the contact surgery distance between two contact $3$-manifolds is at most $5$ larger than the topological surgery distance between the underlying smooth manifolds. As a byproduct of our proof, we classify the rational homology $3$-spheres on which the $d_3$-invariant of a $2$-plane field already determines its $Γ$-invariant and Euler class.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14888v1",
    "categories": [
      "math.AG",
      "cs.SC"
    ],
    "authors": [
      "Nardo Giménez",
      "Joos Heintz",
      "Guillermo Matera",
      "Luis Miguel Pardo",
      "Mariana Pérez",
      "Melina Privitelli"
    ],
    "title": "A Kronecker algorithm for locally closed sets over a perfect field",
    "abstract": "We develop a probabilistic algorithm of Kronecker type for computing a Kronecker representation of a zero-dimensional linear section of an algebraic variety $V$ defined over a perfect field $k$. The variety $V$ is the Zariski closure of the set of common zeros $\\{F_1=0,\\ldots,F_r=0,G\\not=0\\}$ of multivariate polynomials $F_1,\\ldots,F_r\\in k[X_1,\\ldots,X_n]$ outside a prescribed hypersurface $\\{G=0\\}$. We assume that $F_1,\\ldots,F_r$ satisfy natural geometric conditions, such as regularity and radicality, in the local ring $k[X_1,\\ldots,X_n]_G$. Our approach combines homotopic deformation techniques with symbolic Newton-Hensel lifting and elimination. We discuss the concept of lifting curves as intermediate geometric objects that enable efficient computation.\n  The complexity of the algorithm is expressed in terms of the degrees and arithmetic size of the input and achieves soft-quadratic complexity in these parameters. We provide detailed complexity analyses for arbitrary perfect fields, as well as for two important cases in computer algebra: finite fields and the field of rational numbers. For each case, we obtain sharp bounds on the size of the base field or required primes.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15177v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Davar Khoshnevisan",
      "Cheuk Yin Lee"
    ],
    "title": "Points of slow growth for parabolic SPDEs",
    "abstract": "Consider the stochastic PDE, $\\partial_tu = \\partial^2_x u + σ(u) \\dot{W}$ on $\\mathbb{R}_+\\times\\mathbb{R}$, subject to $u(0)\\equiv1$, where $\\dot{W}$ denotes space-time white noise on $\\mathbb{R}_+\\times\\mathbb{R}$ and $σ:\\mathbb{R}\\to\\mathbb{R}$ is Lipschitz continuous. It is known that $u(t\\,,x)-1$ has approximately a Gaussian distribution for every $x$ when $t\\approx0$. Here we prove that there exist random points $x\\in\\mathbb{R}$ where the fluctuations of the solution near times zero are almost surely of sharp order $t^{1/4}$. Our work bears some loose resemblance to the study of the slow points of Brownian motion increments, though significant challenges arise due to the infinite-dimensional nature of the present problem.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15167v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Lingjia Zeng",
      "Manman Li"
    ],
    "title": "Long-Run Average Reward Maximization of A Regulated Regime-Switching Diffusion Model",
    "abstract": "This study considers an optimal reinsurance, investment, and dividend strategy control problem for insurance companies in a regulated Markov regime-switching environment, intending to maximize long-run average reward. Unlike existing single or dual strategy studies, an integrated control framework is established under solvency constraints, allowing investment and dividends only when the surplus process exceeds a minimum cash requirement level. To address the analytical difficulties associated with solving HJB equations and stationary distributions in high-dimensional state spaces under regime switching, we construct a numerical approximation scheme for the optimal strategy function based on Markov chains and neural networks. Furthermore, we establish the convergence of the corresponding sequence of surplus processes and rigorously prove that the associated optimal values converge to the true value function. Finally, we provide a numerical example based on the approximate dynamic programming method to demonstrate the feasibility of the proposed method.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15165v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Giacomo Albi",
      "Elisa Calzola",
      "Matteo Piu"
    ],
    "title": "Control of kinetic opinion dynamics in popularity-adaptive social networks",
    "abstract": "This paper presents a mathematical model for opinion dynamics in popularity-adaptive social networks, where both opinion spreading and the evolution of social media contacts depend on agents' popularity and the prominence of their views. While previous approaches accounted for the influence of popularity on opinion dynamics, we introduce a novel feedback mechanism in which opinion affects the formation of contacts. Within a kinetic modeling framework, we describe the evolution of the coupled dynamics of opinions and network structure, incorporating a class of control laws in order to promote interactions with popular individuals and amplify dominant opinions. Such control strategies are introduced to influence both opinion formation and connectivity, representing interventions such as awareness campaigns or moderation policies. Numerical results show how control strategies can mitigate polarization, foster consensus, or guide opinion distributions in dynamically evolving networks.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15141v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Liangcai Huang",
      "Shujuan Lü"
    ],
    "title": "A New Fast Finite Difference Scheme for Tempered Time Fractional Advection-Dispersion Equation with a Weak Singularity at Initial Time",
    "abstract": "In this paper, we propose a new second-order fast finite difference scheme in time for solving the Tempered Time Fractional Advection-Dispersion Equation. Under the assumption that the solution is nonsmooth at the initial time, we investigate the uniqueness, stability, and convergence of the scheme. Furthermore, we prove that the scheme achieves second-order convergence in both time and space. Finally, corresponding numerical examples are provided.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15102v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Frank de Hoog",
      "Markus Hegland"
    ],
    "title": "Determinant-Based Error Bounds for CUR Matrix Approximation: Oversampling and Volume Sampling",
    "abstract": "We derive error bounds for CUR matrix approximation using determinant-based methods that relate local projection errors to global approximation quality. For general matrices, we establish determinant identities for bordered Gramian matrices that decompose CUR approximation errors into interpretable local components. These identities connect projection errors onto submatrix column spaces directly to determinants, providing geometric insight into approximation degradation. We develop a probabilistic framework based on volume sampling that yields interpolation-type error bounds quantifying the benefits of oversampling: when $r > k$ rows are selected for $k$ columns, the expected error factor transitions linearly from $(k+1)^2$ (no oversampling) to $(k+1)$ (full oversampling). Our analysis establishes that the expected squared error is bounded by this interpolation factor times the squared error of the best rank-$k$ approximation, directly connecting CUR approximation quality to the optimal low-rank approximation. The framework applies to both CUR decomposition for general matrices and the Nyström method for symmetric positive semi-definite matrices, providing a unified theoretical foundation for determinant-based low-rank approximation analysis.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15084v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Tushar Singh",
      "Shiv Datt Kumar"
    ],
    "title": "Structural Analysis of Commutative S-Reduced Rings",
    "abstract": "Let $R$ be a commutative ring with identity, $S \\subseteq R$ be a multiplicative set. In this paper, we establish that the intersection of all $S$-prime ideals in an $S$-reduced ring is $S$-zero. Also, we show that an $S$-Artinian reduced ring is isomorphic to the finite direct product of fields. Furthermore, we provide an example of an $S$-reduced ring which is a uniformly-$S$-Armendariz ring (in short, $u$-$S$-Armendariz$)$ ring. Additionally, we prove that the class of uniformly-$S$-reduced rings (in short, $u$-$S$-reduced rings) belongs to the class of $u$-$S$-Armendariz rings. Among other results, we establish the relationship between $S$-reduced rings and $S$-strongly Hopfian rings. Finally, we prove the structure theorem for $S$-reduced rings.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15079v1",
    "categories": [
      "math.DG",
      "math-ph"
    ],
    "authors": [
      "Hanwen Liu"
    ],
    "title": "On Two Dimensional Flat Hessian Potentials",
    "abstract": "A Riemannian metric is termed a Hessian metric if in some coordinate system it can be locally represented as the Hessian quadratic form of some locally defined smooth potential function. Under very mild extra technical conditions, we first theoretically describe the potentials of flat Hessian metrics on surfaces, and then construct these potentials explicitly using methods from integrable systems.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15050v1",
    "categories": [
      "math.SP"
    ],
    "authors": [
      "Qixuan Hu"
    ],
    "title": "Multiple eigenvalues and the width",
    "abstract": "We obtain the simplicity of the first Neumann eigenvalue of convex thin domain with boundary in $R^n$ and compact thin manifolds with non-negative Ricci curvature. For convex thin domain in $R^2$, we get the simplicity of the first k Neumann eigenvalues. The number k depends on the ratio of the corresponding width over the diameter of the domain. For convex thin domain in $R^n$, we obtain the eigenvalue comparison with collapsing segment.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15029v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Xiangdi Huanga",
      "Weili Meng",
      "Xueyao Zhang"
    ],
    "title": "On global classical and weak solutions with arbitrary large initial data to the multi-dimensional viscous Saint-Venant system and compressible Navier-Stokes equations subject to the BD entropy condition under spherical symmetry",
    "abstract": "In 1871, Saint-Venant introduced the renowned shallow water equations. Since then, for the two-dimensional viscous or inviscid shallow water equations, the global existence of smooth solutions with arbitrarily large initial data has remained a challenging and long-standing open problem. In this paper, we provide an affirmative resolution to the viscous problem under the assumption of two-dimensional radial symmetry. Specifically, we establish the global existence of smooth solutions for the two-dimensional radially symmetric viscous shallow water equations with arbitrary smooth initial data. To achieve this goal, our approach relies crucially on overcoming two major obstacles: first, treating the viscous Saint-Venant system as the endpoint case of the BD entropy condition for the compressible Navier-Stokes equations; and second, addressing the critical embedding imposed by the spatial dimension, which currently holds only in two dimensions. However, the same result can be extended to three dimension for the compressible Navier-Stokes equations satisfying general BD entropy conditions excluding the endpoint case. Indeed, under the same symmtric framework, we also prove the global existence of smooth solutions for arbitrarily large initial data for both the two- and three-dimensional compressible Navier-Stokes equations subject to the BD entropy condition. It is particularly noteworthy that the aforementioned shallow water equations precisely correspond to the endpoint case of the compressible Navier-Stokes equations satisfying the BD entropy condition.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15021v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Lin Xu",
      "Xin Zhong"
    ],
    "title": "Global well-posedness of the three-dimensional non-isentropic compressible magnetohydrodynamic equations under a scaling-invariant smallness condition",
    "abstract": "We consider the Cauchy problem of the non-isentropic compressible magnetohydrodynamic equations in $\\mathbb{R}^3$ with far-field vacuum. By deriving delicate energy estimates and exploiting the intrinsic structure of the system, we establish the global existence and uniqueness of strong solutions provided that the scaling-invariant quantity \\begin{align*} (1+\\barρ+\\tfrac{1}{\\barρ}) [\\|ρ_{0}\\|_{L^{3}}+ ( \\barρ^{2}+\\barρ)( \\| \\sqrt{ρ_{0}}u_{0}\\|_{L^{2}}^{2}+\\| b_{0}\\|_{L^{2}}^{2}) ] [\\|\\nabla u_{0}\\|_{L^{2}}^{2}+(\\barρ+1)\\|\\sqrt{ρ_{0}} θ_{0}\\|_{L^{2}}^{2}+\\| \\nabla b_{0}\\|_{L^{2}}^{2}+\\| b_{0}\\|_{L^{4}}^{4} ] \\end{align*} is sufficiently small, where $\\barρ$ denotes the essential supremum of the initial density. Our result may be regarded as an improved version compared with that of Liu and the second author (J. Differential Equations 336 (2022), pp. 456--478) in the sense that an artificial condition $3μ>λ$ on the viscosity coefficients is removed. In particular, we provide a new scaling-invariant quantity regarding the initial data.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15017v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Dapeng Du",
      "Jingyu Li",
      "Xinyue Shi"
    ],
    "title": "On self-similar singular solutions to a vorticity stretching equation",
    "abstract": "We consider the following model equation: \\begin{equation}\n  ω_{t} = Z_{11}ω\\,ω, \\end{equation} where \\begin{equation}\n  Z_{11} = \\partial_{11}Δ^{-1} \\end{equation} is a Calderon-Zygmond operator. We get the existence of self-similar singular solutions with a special form. The main difficulty is the degeneracy of the operator $Z_{11}$ that is overcome by the spectral uncertainty principle. We also show that the solution to this model blows up in finite time if the initial datum is compactly supported and has a positive integral.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15013v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Han L. Gan"
    ],
    "title": "Poisson-Dirichlet approximation for the stationary distribution of the inclusion process",
    "abstract": "We consider the approximation of the stationary distribution of the finite inclusion process with the Poisson-Dirichlet distribution. Using Stein's method, we derive an explicit bound for the approximation error, which is of order 1/N in the thermodynamic limit. The results are achieved from a minor modification to Stein's method for Poisson-Dirichlet distribution approximation developed in Gan & Ross (2021). The derivatives used on test functions in Gan & Ross (2021) were directional type derivatives specifically chosen for their measure preserving properties. Depending upon the application, these derivatives can prove cumbersome. In this note, we show that for certain test functions we can instead use more traditional derivatives, which simplifies the bounds for the Stein factors and is more amenable to the approximation of the inclusion process.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15012v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Shuichi Hayashida"
    ],
    "title": "Isomorphism between Jacobi forms of index $D_{2n+1}$ and elliptic modular forms of level $2$",
    "abstract": "There are three aims in this paper: (i) We show an isomorphism between Jacobi forms of index $D_{2n+1}$ (lattice index) and elliptic modular forms of level $2$. (ii) We give an explicit formula of Fourier coefficients of Jacobi-Eisenstein series of index $D_{2n+1}$. (iii) We construct a holomorphic modular form of weight $3/2$ of level $8$ from the Zagier Eisenstein series $\\mathscr{F}$ of weight $3/2$ of level $4$. Moreover, we show that the four functions $E^*_2$, $η^3$, $θ^3$ and $\\mathscr{F}$ have essentially the same Hecke eigenvalue $1+p$ for any odd prime $p$, where $E^*_2$ is the non-holomorphic Eisenstein series of weight $2$, $η$ is the Dedekind eta-function and $θ$ is the usual theta function. This fact follows from a special case of the isomorphism of (i).\n  As an application, we give a formula for a sum of the numbers $r_3(n)$, where $r_3(n)$ is the number of representations of an integer $n \\geq 0$ as a sum of $3$ squares.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14987v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Kazuki Sato",
      "Futoshi Takahashi"
    ],
    "title": "Exact solution structures on some nonlocal overdetermined problems",
    "abstract": "In this paper, we study the solution structures of Serrin-type overdetermined problems with Kirchhoff-type nonlocal terms. We prove that the exact number of solutions is the same as those of some transcendental equations defined by the nonlocal terms. We also obtain the explicit form of solutions by using the unique solutions of the overdetermined problems without the nonlocal terms.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14986v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Carlo Bellingeri",
      "Emilio Ferrucci"
    ],
    "title": "Wick integrals",
    "abstract": "We introduce the Wick integral $\\int_s^t p(X_u) \\Diamond \\mathrm{d} X_u$ for a class of stochastic processes $X$ which are not necessarily Gaussian, in the regime of bounded $2> q$-variation. The integral is defined for polynomial integrands, and has the property of being centred if $X$ is such. In the case of $1/2 < H$-fractional Brownian motion, the Wick integral agrees with the divergence operator in Malliavin calculus. It satisfies a correction formula with the Young integral $\\int p(X)\\mathrm{d} X$ and an Itô formula which have arbitrarily many correction terms (only limited by the degree of $p$), given by integration against the cumulant functions of $X$, and reduce to familiar identities in the Gaussian case. These results are obtained by first developing diagram formulae for Appell polynomials. Our theory applies to a range of processes taking values in bounded Wiener chaos, such as the Rosenblatt process.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15255v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Wontae Kim",
      "Lauri Särkiö"
    ],
    "title": "Very weak solutions to degenerate parabolic double-phase systems",
    "abstract": "We prove a local self-improving property for the gradient of very weak solutions to degenerate parabolic double-phase systems. The result is based on a reverse Hölder inequality with constants that are independent of the solution. Delicate methods are required to avoid a self-referential argument. In particular, we develop a new phase analysis method.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15245v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Gordon Blower",
      "Simon J. Malham"
    ],
    "title": "Linear systems, determinants and solutions of the Kadomtsev-Petviashvili equation",
    "abstract": "Let $(-A,B,C)$ be a linear system in continuous time $t>0$ with input and output space ${\\mathbb C}$ and state space $H$. The scattering (or impulse response) functions $φ_{(x)}(t)=Ce^{-(t+2x)A}B$ determines a Hankel integral operator $Γ_{φ_{(x)}}$; if $Γ_{φ_{(x)}}$ is trace class, then the Fredholm determinant $τ(x)=\\det (I+Γ_{φ_{(x)}})$ determines the tau function of $(-A,B,C)$. The paper establishes properties of algebras including $R_x = \\int_x^\\infty e^{-tA}BCe^{-tA}\\,dt$ on $H$, and obtains solutions of the Kadomtsev-Petviashvili PDE. Pöppe's semi-additive operators are identified with orbits of a shift action on integral kernels, and Pöppe's bracket operation is expressed in terms of the Fedosov product. The paper shows that the Fredholm determinant $\\det (I+R_x)$ gives an effective method for numerical computation of solutions of $KP$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15218v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Shun Takizawa"
    ],
    "title": "Strichartz estimates in Wiener amalgam spaces for Schrödinger equations with at most quadratic potentials",
    "abstract": "For Schrödinger equations with potentials which grow at most quadratically at spatial infinity, we prove Strichartz estimates in Wiener amalgam spaces. These estimates provide a stronger recovery of local-in-space regularity than the classical Strichartz estimates in Lebesgue spaces. Our result is a generalization of the results on Strichartz estimates in Wiener amalgam spaces by Cordero and Nicola, which are stated for the potentials $V(x) = 0,|x|^2/2, -|x|^2/2$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15209v1",
    "categories": [
      "math.AP",
      "q-bio.PE",
      "q-bio.QM"
    ],
    "authors": [
      "Andrew Omame",
      "Sarafa Iyaniwura"
    ],
    "title": "A multiscale framework integrating within-host infection kinetics with airborne transmission dynamics",
    "abstract": "Coupling within-host infection dynamics with population-level transmission remains a major challenge in infectious disease modeling, especially for airborne pathogens with potential to spread indoor. The frequent emergence of such diseases highlight the need for integrated frameworks that capture both individual-level infection kinetics and between-host transmission. While analytical models for each scale exist, tractable approaches that link them remain limited. In this study, we present a novel multiscale mathematical framework that integrates within-host infection kinetics with airborne transmission dynamics. The model represents each host as a patch and couples a system of ordinary differential equations (ODEs) describing in-host infection kinetics with a diffusion-based partial differential equation (PDE) for airborne pathogen movement in enclosed spaces. These scales are linked through boundary conditions on each patch boundary, representing viral shedding and inhalation. Using matched asymptotic analysis in the regime of intermediate diffusivity, we derived a nonlinear ODE model from the coupled ODE-PDE system that retains spatial heterogeneity through Neumann Green's functions. We established the existence, uniqueness, and boundedness of solutions to the reduced model and analyzed within-host infection kinetics as functions of the airborne pathogen diffusion rate and host spatial configuration. In the well-mixed limit, the model recovers the classical target cell limited viral dynamics framework. Overall, the proposed multiscale modeling approach enables the simultaneous study of transient within-host infection dynamics and population-level disease spread, providing a tractable yet biologically grounded framework for investigating airborne disease transmission in indoor environments.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15202v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "María Anguiano",
      "Francisco J. Suárez-Grau"
    ],
    "title": "Modeling of a micropolar thin film flow with rapidly varying thickness and non-standard boundary conditions",
    "abstract": "In this paper, we study the asymptotic behavior of the micropolar fluid flow through a thin domain assuming zero Dirichlet boundary condition on the top boundary, which is rapidly oscillating, and non-standard boundary conditions on the flat bottom. Assuming ``Reynolds roughness regime\", in which the thickness of the domain is very small compared to the wavelenth of the roughness (i.e. a very slight roughness), we rigorously derive a generalized Reynolds equation for pressure clearly showing the roughness-induced effects. Moreover, we give expressions for the average velocity and microrotation.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15161v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "U. Bekbaev"
    ],
    "title": "On three-dimensional anti-commutative algebras",
    "abstract": "This paper is devoted to the classification problem of tree-dimensional anti-commutative(zero-potent) algebras over any base field $\\mathbb{F}$ such that $Char(\\mathbb{F})\\neq 2$ and every element admits a square root.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15158v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Mingjin Li",
      "Jianren Long",
      "Lang Wang"
    ],
    "title": "A note for Carleson measure on bounded \\(\\bbC\\)-doconvex domains",
    "abstract": "Let \\(0<q<p<\\infty\\), \\(Ω\\) be a bounded \\(\\bbC\\)-convex domains in \\(\\bbC^n\\). We establish several equivalent characterizations for the boundedness of\n  Carleson embedding \\(J_μ:A_α^p\\hookrightarrow L^q(μ)\\) on \\(Ω\\) with sharp \\(\\cB\\) condition. Furthermore, we prove that the boundedness of \\(J_μ\\) is equivalent to its compactness.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15131v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Alessio Bottini",
      "Daniel Huybrechts"
    ],
    "title": "The period-index problem for hyperkähler varieties: Lower and upper bounds",
    "abstract": "It is expected that a stronger form of the period-index conjecture holds for hyperkähler varieties. Following ideas of Hotchkiss, we provide further evidence for this expectation by proving a version in which the index is replaced by the Hodge-theoretic index. We also show that the hyperkähler period-index conjecture is optimal. As an application, we prove that Mumford-Tate general hyperkähler varieties cannot be covered by families of elliptic curves passing through a fixed point. By extending work of Hotchkiss, Maulik, Shen, Yin, and Zhang, we prove the hyperkähler period-index conjecture for non-special coprime Brauer class on hyperkähler varieties of K3^n-type without any restriction on the Picard number.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15077v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Julian Sahasrabudhe"
    ],
    "title": "Probabilistic combinatorics at exponentially small scales",
    "abstract": "In many applications of the probabilistic method, one looks to study phenomena that occur ``with high probability''. More recently however, in an attempt to understand some of the most fundamental problems in combinatorics, researchers have been diving deeper into these probability spaces and understanding phenomena that occur at much smaller probability scales. Here I will survey a few of these ideas from the perspective of my own work in the area.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15004v1",
    "categories": [
      "math.AT",
      "math.DG",
      "math.KT"
    ],
    "authors": [
      "Andrew Davis"
    ],
    "title": "The Homotopy Type of Spaces of Flat Connections for Classical Lie Groups",
    "abstract": "Let $M$ be a smooth manifold. We use Chern-Weil theory to study the characteristic classes of principal $G$-bundles built from continuous families of $π_{1}(M)$-representations, where $G$ is a compact Lie group. We then relate these families to the functorial map $$\\text{Hom}(π_{1}(M), G)\\rightarrow\\text{Map}_{*}(M,BG)$$ and use this relationship to study the weak homotopy type of the space of flat connections for $U(n)$, $O(n)$, $SO(n)$, and $\\text{Spin}(n)$ bundles.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14955v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tetsutaro Shibata"
    ],
    "title": "Asymptotic formulas for $L^2$ bifurcation curves of nonlocal logistic equation of population dynamics",
    "abstract": "The one-dimensional nonlocal Kirchhoff type bifurcation problems which are derived from logistic equation of population dynamics are studied. We obtain the precise asymptotic shapes of $L^2$ bifurcation curves $λ= λ(α)$ as $α\\to \\infty$, where $α:= \\Vert u_λ\\Vert_2$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14950v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Geshuo Wang",
      "Jingwei Hu"
    ],
    "title": "Dynamical Tensor Train Approximation for Kinetic Equations",
    "abstract": "The numerical solution of kinetic equations is challenging due to the high dimensionality of the underlying phase space. In this paper, we develop a dynamical low-rank method based on the projector-splitting integrator in tensor-train (TT) format. The key idea is to discretize the three-dimensional velocity variable using tensor trains while treating the spatial variable as a parameter, thereby exploiting the low-rank structure of the distribution function in velocity space. In contrast to the standard step-and-truncate approach, this method updates the tensor cores through a sweeping procedure, allowing the use of relatively small TT-ranks and leading to substantial reductions in memory usage and computational cost. We demonstrate the effectiveness of the proposed approach on several representative kinetic equations.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14940v1",
    "categories": [
      "math.DS",
      "math-ph",
      "math.AP",
      "math.CA"
    ],
    "authors": [
      "Philip Korman",
      "Yi Li"
    ],
    "title": "Nonlinear oscillators at resonance with periodic forcing",
    "abstract": "In this note we unify the results of A.C. Lazer and P.O. Frederickson [3], A.C. Lazer [6], A.C. Lazer and D.E. Leach [7], J.M. Alonso and R. Ortega [1], and P. Korman and Y. Li [4] on periodic oscillations and unbounded solutions of nonlinear equations with linear part at resonance and periodic forcing. We give conditions for the existence and non-existence of periodic solutions, and obtain a rather detailed description of the dynamics for nonlinear oscillations at resonance, in case periodic solutions do not exist.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14918v1",
    "categories": [
      "math.MG"
    ],
    "authors": [
      "Vladimir Manuilov"
    ],
    "title": "Inverse semigroup of metrics on a double is fundamental",
    "abstract": "We show that the inverse group of equivalence classes of metrics on two copies of a metric space is fundamental.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14890v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Chase Wilson"
    ],
    "title": "A Tight Lower bound on Trees in Graphs",
    "abstract": "Mubayi and Verstraete conjectured that if $T$ is a tree on $t + 1$ vertices, then any $n$-vertex graph $G$ with average degree $d$ contains at least \\[ n d(d - 1) \\cdots (d - t + 1) \\] labeled copies of $T$ as long as $d$ is sufficiently large compared to $t$. We prove this is true and show that when the diameter of $T$ is at least $3$, equality holds iff $G$ is the disjoint union of cliques of size $d + 1$. When the diameter is $2$, equality holds iff $G$ is $d$-regular.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14776v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Xiangxiang Li",
      "Haiyan Wang",
      "Yao Ge",
      "Xiaohong Shen",
      "Miaowen Wen",
      "Shun Zhang",
      "Yong Liang Guan"
    ],
    "title": "Low-Complexity Channel Estimation for Internet of Vehicles AFDM Communications With Sparse Bayesian Learning",
    "abstract": "Affine frequency division multiplexing (AFDM) has been considered as a promising waveform to enable high-reliable connectivity in the internet of vehicles. However, accurate channel estimation is critical and challenging to achieve the expected performance of the AFDM systems in doubly-dispersive channels. In this paper, we propose a sparse Bayesian learning (SBL) framework for AFDM systems and develop a dynamic grid update strategy with two off-grid channel estimation methods, i.e., grid-refinement SBL (GR-SBL) and grid-evolution SBL (GE-SBL) estimators. Specifically, the GR-SBL employs a localized grid refinement method and dynamically updates grid for a high-precision estimation. The GE-SBL estimator approximates the off-grid components via first-order linear approximation and enables gradual grid evolution for estimation accuracy enhancement. Furthermore, we develop a distributed computing scheme to decompose the large-dimensional channel estimation model into multiple manageable small-dimensional sub-models for complexity reduction of GR-SBL and GE-SBL, denoted as distributed GR-SBL (D-GR-SBL) and distributed GE-SBL (D-GE-SBL) estimators, which also support parallel processing to reduce the computational latency. Finally, simulation results demonstrate that the proposed channel estimators outperform existing competitive schemes. The GR-SBL estimator achieves high-precision estimation with fine step sizes at the cost of high complexity, while the GE-SBL estimator provides a better trade-off between performance and complexity. The proposed D-GR-SBL and D-GE-SBL estimators effectively reduce complexity and maintain comparable performance to GR-SBL and GE-SBL estimators, respectively.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14948v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Taro Hayashi",
      "Keika Shimahara"
    ],
    "title": "Large orders of automorphisms of smooth curves in $\\mathbb P^1\\times \\mathbb P^1$",
    "abstract": "For $a,b\\geq 3$, we calculate the orders of automorphisms of smooth curves with bidegree $(a,b)$ in the product $\\pp$ of the projective line $\\mathbb P^1$. We identify smooth curves in $\\pp$ which have automorphisms with the largest orders. In addition, we study the relationship between symmetry and geometric structure of curves. We provide a sufficient condition for the quotient space by an automorphism to be $\\mathbb P^1$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14934v1",
    "categories": [
      "math.MG"
    ],
    "authors": [
      "Henry Adams",
      "Florian Frick"
    ],
    "title": "An optimal Brouwer's fixed point theorem for discontinuous functions",
    "abstract": "Brouwer's fixed point theorem states that any continuous function from a closed $n$-dimensional ball to itself has a fixed point. In 1961, Klee showed that if such a function has discontinuities that are bounded, then it has a point that is close to being fixed. We improve upon Klee's results in any finite-dimensional Euclidean space, and prove that our bounds are the best possible.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14914v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Federico Achini",
      "Paola Causin",
      "Sara Vanini",
      "Ke Chen",
      "Simone Scacchi"
    ],
    "title": "Optimization of gridding algorithms for FFT by vector optimization",
    "abstract": "The Fast Fourier Transform (FFT) is widely used in applications such as MRI, CT, and interferometry; however, because of its dependence on uniformly sampled data, it requires the use of gridding techniques for practical implementation. The performance of these algorithms strongly depends on the choice of the gridding kernel, with the first prolate spheroidal wave function (PSWF) regarded as optimal. This work redefines kernel optimality through the lens of vector optimization (VO), introducing a rigorous framework that characterizes optimal kernels as Pareto-efficient solutions of an error shape operator. We establish the continuity of such operator, study the existence of solutions, and propose a novel methodology to construct kernels tailored to a desired target error function. The approach is implemented numerically via interior-point optimization. Comparative experiments demonstrate that the proposed kernels outperform both the PSWF and the state-of-the-art methods (MIRT-NUFFT) in specific regions of interest, achieving orders-of-magnitude improvements in mean absolute errors. These results confirm the potential of VO-based kernel design to provide customized accuracy profiles aligned with application-specific requirements. Future research will extend this framework to multidimensional cases and relative error minimization, with potential integration of machine learning for adaptive target error selection.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14886v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Jing Huang",
      "Ying Ying Ye"
    ],
    "title": "Chordal signed graphs and signed bigraphs",
    "abstract": "Chordal graphs and chordal bigraphs enjoy beautiful characterizations, in terms of forbidden subgraphs, vertex/edge orderings, vertex/edge separating sets, and tree-like representations. In this paper, we introduce chordal signed graphs and chordal signed bigraphs. Interestingly, chordal signed graphs are equivalent to strict chordal digraphs studied by Hell and Hernández-Cruz. A forbidden subdigraph characterization of strict chordal digraphs can be translated to a forbidden subgraph characterization of chordal signed graphs. We give a forbidden subgraph characterization of chordal signed bigraphs. The forbidden subgraphs for chordal signed bigraphs are analogous to those for chordal signed graphs but the proofs are much more complicated and intriguing.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14852v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Sorin Dascalescu",
      "Constantin Nastasescu",
      "Laura Nastasescu",
      "Paul Rebenciuc"
    ],
    "title": "A linear algebra approach to graded Frobenius algebras",
    "abstract": "If $A$ is a finite-dimensional algebra graded by a group $G$, and $σ\\in G$, we define a variant of paratrophic matrix associated with $A$ and $σ$, and we use it to characterize the $σ$-graded Frobenius property for $A$. We discuss the invertibility of such paratrophic matrices, and then use them to check whether certain graded algebras are $σ$-graded Frobenius or (graded) symmetric. As an application, we uncover (graded) Frobenius and symmetric properties of Koszul duals of quantum polynomial algebras. We derive a structure result for $σ$-graded Frobenius algebras by only using linear algebra methods.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14849v1",
    "categories": [
      "math.QA",
      "math.GT"
    ],
    "authors": [
      "Thibault D. Décoppet",
      "Benjamin Haïoun"
    ],
    "title": "Invariants of 4-Dimensional 2-Handlebodies from the Temperley-Lieb Category in Positive Characteristic",
    "abstract": "We investigate invariants of 4-dimensional 2-handlebodies associated to the Temperley-Lieb category in characteristic $p>2$ and at a primitive fourth root of unity. These invariants depend additionally on a height parameter $n$, and we focus on the case $n=2$. Provided that $p>3$, we show that the height $n=2$ invariant associated to the Temperley-Lieb category at a primitive fourth root of unity vanishes on $\\mathbb{C}P^2$, $\\overline{\\mathbb{C}P}^2$, and $S^2\\times S^2$. In particular, it has the potential to detect exotic smooth structures.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14820v1",
    "categories": [
      "math-ph",
      "quant-ph"
    ],
    "authors": [
      "Nicolas J. Cerf",
      "Ulysse Chabaud",
      "Jack Davis",
      "Nuno C. Dias",
      "João N. Prata",
      "Zacharie Van Herstraeten"
    ],
    "title": "Characterising the sets of quantum states with non-negative Wigner function",
    "abstract": "For Hilbert spaces $\\mathcal H\\subseteq L^2(\\mathbb R)$ we consider the convex sets $\\mathcal D_+(\\mathcal H)$ of Wigner-positive states (WPS), i.e.~density matrices over $\\mathcal H$ with non-negative Wigner function. We investigate the topological structure of these sets, namely concerning closure, compactness, interior and boundary (in a relative topology induced by the trace norm). We also study their geometric structure and construct minimal sets of states that generate $\\mathcal D_+(\\mathcal H)$ through convex combinations. If $\\mathcal H$ is finite-dimensional, the existence of such sets follows from a central result in convex analysis, namely the Krein-Milman theorem. In the infinite-dimensional case $\\mathcal H=L^2(\\mathbb R)$ this is not so, due to lack of compactness of the set $\\mathcal D_+(\\mathcal H)$. Nevertheless, we prove that a Krein-Milman theorem holds in this case, which allows us to extend most of the results concerning the sets of generators to the infinite-dimensional setting. Finally, we study the relation between the finite and infinite-dimensional sets of WPS, and prove that the former provide a hierarchy of closed subsets, which are also proper faces of the latter. These results provide a basis for an operational characterisation of the extreme points of the sets of WPS, which we undertake in a companion paper. Our work offers a unified perspective on the topological and geometric properties of the sets of WPS in finite and infinite dimensions, along with explicit constructions of minimal sets of generators.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15293v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Riku Shintani"
    ],
    "title": "A Generalization of MacMahon Series via Cyclotomic Polynomials",
    "abstract": "About a century ago, P. A. MacMahon introduced a class of $q$-series, which are nowadays referred to as MacMahon series. More recently, in 2013, G. E. Andrews and S. C. F. Rose revealed the quasimodular property of these series. In this paper, we introduce a generalization of MacMahon series. Specifically, for any positive integers $t, k, N$ and a polynomial $Q(x)$, we define the series $\\mathcal{U}_{t, k; N}(Q; q)$ and $\\mathcal{U}_{t, k; N}^{\\star}(Q; q)$ using the $N$-th cyclotomic polynomial. To investigate these series, we apply a decomposition formula involving the Eulerian polynomials and express the $N$-th roots of unity in terms of Gauss sums. By combining these results to derive explicit representations, we prove that our series arise as quasimodular forms of higher weight and higher level. Furthermore, we show that they can be expressed as isobaric polynomials. In particular, we show that the one-parameter generalization introduced by C. Nazaroglu, B. V. Pandey, and A. Singh arises as a special case of our theory.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15243v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Zhicheng Feng",
      "Qulei Fu",
      "Yuanyang Zhou"
    ],
    "title": "A reduction theorem for the blockwise Galois Alperin weight conjecture via H-triples",
    "abstract": "The Galois Alperin weight (GAW) conjecture has been reduced to the inductive GAW condition for simple groups. We proceed in two steps to refine this reduction. First, we propose the blockwise Galois Alperin weight (BGAW) conjecture and define its associated inductive BGAW condition. Second, assuming the inductive GAW (respectively, BGAW) condition for simple groups, we establish a stronger version of the GAW (respectively, BGAW) conjecture in terms of central (respectively, block) isomorphism of H-triples.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15205v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Tomoya Kamijima",
      "Naoki Marumo",
      "Akiko Takeda"
    ],
    "title": "A Regression-Based Prediction-Correction Method for Stochastic Time-Varying Optimization Problems",
    "abstract": "In many real-world applications, optimization problems evolve continuously over time and are often subject to stochastic noise. We consider a stochastic time-varying optimization problem in which the objective function $f(x;t)$ changes continuously and only noisy gradient observations are available. In deterministic settings, the prediction-correction method that exploits the time derivative of the solution is effective for accurately tracking the solution trajectory. However, a straightforward extension to stochastic problems requires an estimate of $\\nabla_{xt} f(x;t)$ and the computation of a Hessian inverse at each step--requirements that are difficult or costly in practice. To address these issues, we propose a prediction-correction algorithm that uses a regression-based prediction step: the prediction is formed as a linear combination of recent iterates, which can be computed efficiently without estimating $\\nabla_{xt}f(x;t)$ or computing Hessian inversions. We prove a tracking-error bound for the proposed method under standard smoothness and stochastic assumptions. Numerical experiments show that the regression-based prediction improves tracking accuracy while reducing computational cost compared with existing methods.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15191v1",
    "categories": [
      "cs.IT",
      "math.ST"
    ],
    "authors": [
      "Mengchu Xu",
      "Jian Wang",
      "Yonina C. Eldar"
    ],
    "title": "Sparse Principal Component Analysis with Energy Profile Dependent Sample Complexity",
    "abstract": "We study sparse principal component analysis in the high-dimensional, sample-limited regime, aiming to recover a leading component supported on a few coordinates. Despite extensive progress, most methods and analyses are tailored to the flat-spike case, offering little guidance when spike energy is unevenly distributed across the support. Motivated by this, we propose Spectral Energy Pursuit (SEP), an effective iterative scheme that repeatedly screens and reselects coordinates, with a sample complexity that adapts to the energy profile. We develop our framework around a structure function \\(s(p)\\) that quantifies how spike energy accumulates over its top \\(p\\) entries. We establish that SEP succeeds with a sample size of order \\(\\max_{1\\le p\\le k} p\\,s^2(p)\\,\\log n\\), which matches the classical \\(k^2\\log n\\) sample complexity for flat spikes and improves toward the \\(k\\log n\\) regime as the profile becomes more concentrated. As a lightweight post-processing, a single truncated power iteration is proven to enable the final estimator to attain a uniform statistical error bound. Empirical simulations across flat, power-law, and exponential signals validate that SEP adapts to profile structure without tuning and outperforms existing algorithms.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15125v1",
    "categories": [
      "math.CO",
      "math.GR",
      "math.NT"
    ],
    "authors": [
      "Carl Schildkraut"
    ],
    "title": "Abelian structure in approximate groups and Alon's conjecture on Ramsey Cayley graphs",
    "abstract": "A result of Pyber states that every finite group $G$ contains an abelian subgroup whose order is quasi-polynomially large in $\\lvert G\\rvert$. We prove a similar result for $K$-approximate subgroups of solvable groups under only modest restrictions on $K$. We show that, if $A$ is a finite $K$-approximate group contained in some solvable group, then some abelian group intersects $A^4$ in at least $\\exp(Ω(\\log^{1/6}\\lvert A\\rvert/\\log 2K))$ elements. We also prove a similar result for approximate subgroups of finite groups with no large alternating subquotients. Along the way, we obtain polynomial (instead of quasi-polynomial) bounds for the same statement of approximate subgroups of linear groups.\n  We give two applications. Firstly, we consider the conjecture of Alon that every finite group $G$ admits a Cayley graph with clique number and independence number $O(\\log\\lvert G\\rvert)$. Conlon, Fox, Pham, and Yepremyan have recently proven that, for almost all positive integers $N$, every abelian group of order $N$ satisfies Alon's conjecture. Extending their result, we verify Alon's conjecture for all (not necessarily abelian) groups of almost all orders. Secondly, we prove a \"local\" version of Roth's theorem in (many) non-abelian settings with quasi-polynomial bounds, using the recent breakthroughs of Kelley and Meka on Roth's theorem and of Jaber, Liu, Lovett, Ostuni, and Sawhney on the corners problem.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15121v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Songzhe Xu",
      "Majid Rasouli",
      "Robert M. Kirby",
      "David Moxey",
      "Hari Sundar"
    ],
    "title": "A geometrically informed algebraic multigrid preconditioned iterative approach for solving high-order finite element systems",
    "abstract": "Algebraic multigrid (AMG) is conventionally applied in a black-box fashion, agnostic to the underlying geometry. In this work, we propose that using geometric information -- when available -- to assist with setting up the AMG hierarchy is beneficial, especially for solving linear systems resulting from high-order finite element discretizations. High-order problems draw considerable interest to both the scientific and engineering communities, but lack efficient solvers, at least open-source codes, tailored for unstructured high-order discretizations targeting large-scale, real-world applications. For geometric multigrid, it is known that using p-coarsening before h-coarsening can provide better scalability, but setting up p-coarsening is non-trivial in AMG. We develop a geometrically informed algebraic multigrid (GIAMG) method, as well as an associated high-performance computing program, which is able to set up a grid hierarchy that includes p-coarsening at the top grids with minimal information of the geometry from the user. A major advantage of using p-coarsening with AMG -- beyond the benefits known in the context of geometric multigrid (GMG) -- is the increased sparsification of coarse grid operators. We extensively evaluate GIAMG by testing on the 3D Helmholtz and incompressible flow problems, and demonstrate mesh-independent convergence, and excellent parallel scalability. We also compare the performance of GIAMG with existing AMG packages, including Hypre and ML.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15099v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Weizhe Niu"
    ],
    "title": "On the mapping class group of 4-dimensional 1-handlebodies via Budney-Gabai invariants",
    "abstract": "We define an invariant $(W_3)_m$ for $π_0\\mathrm{Diff}(\\natural_m S^1\\times D^3,\\partial)$ for $m\\geq 1$ that generalizes Budney--Gabai's $W_3$ invariant. We give a computational framework inspired by Budney--Gabai and use it to calculate the invariant for all unknotted barbell difeomorphisms of $\\natural_m S^1\\times D^3$ for $m=1,2$. This allows us to detect more linearly independent elements in $π_0\\mathrm{Diff}(S^1\\times D^3,\\partial)$, and to prove that $π_0\\mathrm{Diff}( \\natural_2 S^1\\times D^3,\\partial)/ \\left( π_0 \\mathrm{Diff}(S^1\\times D^3,\\partial)\\right)^2$ admits infinitely generated subgroups generated by unknotted barbell diffeomorphisms, leading to infinitely many properly embedded separating 3-balls that are non-isotopic relative to the boundary.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15078v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Tushar Singh",
      "Ajim Uddin Ansari",
      "Shiv Datt Kumar"
    ],
    "title": "On S-J-Noetherian Rings",
    "abstract": "Let $R$ be a commutative ring with identity, $S\\subseteq R$ be a multiplicative set and $J$ be an ideal of $R$. In this paper, we introduce the concept of $S$-$J$-Noetherian rings, which generalizes both $J$-Noetherian rings and $S$-Noetherian rings. We study several properties and charaterizations of this new class of rings. For instance, we prove Cohen's-type theorem for $S$-$J$-Noetherian rings. Among other results, we establish the existence of $S$-primary decomposition in $S$-$J$-Noetherian rings as a generalization of classical Lasker-Noether theorem.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15060v1",
    "categories": [
      "math.SG",
      "math-ph",
      "math.AG",
      "math.DG"
    ],
    "authors": [
      "Dan Wang",
      "Yutung Yau"
    ],
    "title": "Quantization in mixed polarization via transverse Poincaré-Birkhoff-Witt theorem",
    "abstract": "On a prequantizable Kähler manifold $(M, ω, L)$, Chan-Leung-Li constructed a genuine (non-asymptotic) action of a subalgebra of the Berezin-Toeplitz star product on $H^0(M, L^{\\otimes k})$ for each level $k$ [14]. We extend their framework to any non-singular polarization $P$ by developing a theory of transverse differential operators associated to $P$:\n  (1) For any pair of locally free $P$-modules $E, E'$, we construct a Poincaré-Birkhoff-Witt isomorphism for the bundle $\\widetilde{D}(E, E')$ of transverse differential operators from $E$ to $E'$. When $E, E'$ are trivial rank-$1$ $P$-modules, this recovers the PBW theorem of Laurent-Gengoux-Stiénon-Xu [29] for the Lie pair $(TM_\\mathbb{C}, P)$.\n  (2) Using these PBW isomorphisms, we show that the Grothendieck connections on the transeverse jet bundle of $L^{\\otimes k}$ give rise to a deformation quantization $(C_M^\\infty[[\\hbar]], \\star)$ together with a sheaf of subalgebras $C_{M, \\hbar}^{<\\infty}$ that acts on $P$-polarized sections of $L^{\\otimes k}$. We obtain a geometric interpretation of $(C_{M, \\hbar}^{<\\infty}, \\star)$ by evaluating at $\\hbar = \\tfrac{\\sqrt{-1}}{k}$, yielding a sheaf $O_k^{(<\\infty)}$, and proving that $O_k^{(<\\infty)} \\cong \\widetilde{D}_{L^{\\otimes k}}$ as sheaves of filtered algebras, where $\\widetilde{D}_{L^{\\otimes k}}$ is the sheaf of transverse differential operators on $L^{\\otimes k}$. When $P$ is a Kähler polarization, this recovers the result of Chan-Leung-Li [14].\n  As an application, we study symplectic tori and derive asymptotic expansions for the Toeplitz-type operators in real polarization introduced in [35].",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14988v1",
    "categories": [
      "math.CT",
      "cs.LO"
    ],
    "authors": [
      "Chris Kapulkin",
      "Yufeng Li"
    ],
    "title": "A Toolkit for Structured Lifts",
    "abstract": "We develop a general framework for working with structured lifting problems, establishing closure and uniqueness properties of their solutions. In a subsequent paper, we apply these results to axiomatize computation rules of cubical type theory.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14979v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Qi Wang",
      "Uday V. Shanbhag",
      "Yue Xie"
    ],
    "title": "A Parameter-Free Stochastic LineseArch Method (SLAM) for Minimizing Expectation Residuals",
    "abstract": "Most existing rate and complexity guarantees for stochastic gradient methods in $L$-smooth settings mandates that such sequences be non-adaptive, non-increasing, and upper bounded by $\\tfrac{a}{L}$ for $a > 0$. This requires knowledge of $L$ and may preclude larger steps. Motivated by these shortcomings, we present an Armijo-enabled stochastic linesearch framework with standard stochastic zeroth- and first-order oracles. The resulting steplength sequence is non-monotone and requires neither knowledge of $L$ nor any other problem parameters. We then prove that the expected stationarity residual diminishes at a rate of $\\mathcal{O}(1/\\sqrt{K})$, where $K$ denotes the iteration budget. Furthermore, the resulting iteration and sample complexities for computing an $ε$-stationary point are $\\mathcal{O}(ε^{-2})$ and $\\mathcal{O}\\left(ε^{-4}\\right)$. The proposed method allows for a simple nonsmooth convex component in the objective, addressed through proximal gradient updates. Analogous guarantees are provided in the Polyak-Lojasiewicz (PL) setting and convex regimes. Preliminary numerical experiments are seen to be promising.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14970v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "A. V. Kitaev"
    ],
    "title": "Painlevé Property and Generating Functions for Asymptotics",
    "abstract": "This paper proposes a new approach to the asymptotic analysis of Painlevé equations. The approach is based on representing solutions of the Painlevé equations using formal series in two variables, $\\sum_{k=0}^{\\infty}y^kA_k(x)$, with rational functions $A_k(x)$. The approach is applied to the asymptotic analysis of the third degenerate Painlevé equation.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15193v1",
    "categories": [
      "math.CV",
      "math.CA"
    ],
    "authors": [
      "Vladan Jaguzović",
      "Petar Melentijević"
    ],
    "title": "Stability of Wehrl-type Functionals and Concentration Estimates on Bergman Spaces of Log-Subharmonic Functions on the Unit Sphere",
    "abstract": "In this paper, we consider weighted Bergman spaces $\\mathcal{B}_{α,p}$ of log-subharmonic functions on the unit sphere. Using the isoperimetric inequality for the spherical metric we prove certain monotonicity property for super-level sets of $|f(x)|^p\\mathcal{W}_n^α(x),$ where $f\\in \\mathcal{B}_{α,p}$ and $\\mathcal{W}_n^α(x)$ is the Bergman weight. As a consequence, we solve a maximization problem for certain Wehrl-type (convex) functionals and concentration estimates. Moreover, we show the stability of these estimates, proving that near-extremizing values are achieved for near-extremizing functions.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15164v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Harbir Antil",
      "Daiki Mizuno",
      "Ken Shirakawa",
      "Naotaka Ukai"
    ],
    "title": "Well-Posedness of Pseudo-Parabolic Gradient Systems with State-Dependent Dynamics",
    "abstract": "This paper develops a general mathematical framework for pseudo-parabolic gradient systems with state-dependent dynamics. The state dependence is induced by variable coefficient fields in the governing energy functional. Such coefficients arise naturally in scientific and technological models, including state-dependent mobilities in KWC-type grain boundary motion and variable orientation-adaptation operators in anisotropic image denoising. We establish two main results: the existence of energy-dissipating solutions, and the uniqueness and continuous dependence on initial data. The proposed framework yields a general well-posedness theory for a broad class of nonlinear evolutionary systems driven by state-dependent operators. As illustrative applications, we present an anisotropic image-denoising model and a new pseudo-parabolic KWC-type model for anisotropic grain boundary motion, and prove that both fit naturally within the abstract structure of $(\\mathrm{S})_ν$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15104v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Attila Lovas",
      "Miklós Rásonyi",
      "Lionel Truquet"
    ],
    "title": "Sharp Mixing Rates for Markov Chains on General Spaces with Unbounded Random Environments",
    "abstract": "We consider Markov chains on general state spaces in stationary random environment which are defined by a random mapping that is contractive up to a bounded perturbation. We prove their convergence to a limiting law, providing convergence rates. We also show that these processes are strongly mixing and estimate their mixing coefficients. Our results significantly extend those available in the literature. In particular, for some additive autoregressive processes with exogenous covariates we achieve mixing rates that are optimal up to logarithmic factors.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15092v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Chao Zhou",
      "Changsheng You",
      "Cong Zhou",
      "Liujia Yao",
      "Weijie Yuan",
      "Beixiong Zheng",
      "Nan Wu"
    ],
    "title": "Rotatable IRS-Assisted 6DMA Communications: A Two-timescale Design",
    "abstract": "Intelligent reflecting surface (IRS) and movable antenna (MA) are promising technologies to enhance wireless communication by reconfiguring channels at the environment and transceiver sides. However, their performance is constrained by practical limitations. To address this, we propose a multi-functional antenna/surface system that leverages their complementary advantages. A rotatable IRS (R-IRS) is deployed to enhance downlink communications from a six-dimensional MA (6DMA)-equipped base station (BS) to multiple single-antenna users. To reduce the complexity of real-time channel estimation and beamforming, we formulate an optimization problem to maximize the average sum-rate using a two-timescale (TTS) transmission protocol. Specifically, the BS antenna configuration (including position and rotation) and IRS rotation and reflection are optimized based on statistical channel state information (S-CSI), while BS transmit beamforming is designed using instantaneous CSI (I-CSI) in the short timescale. We first consider a single-user case and show that the 6DMA at the BS should form a sparse array for multi-beam transmission towards both the IRS and the user, allowing efficient coordination of direct and reflected channels, while the IRS rotation achieves effective multi-path alignment. For the general multi-user case, the optimization problem is non-convex and challenging to solve. To tackle this, we propose an efficient algorithm combining weighted minimum mean-square error (WMMSE) and stochastic successive convex approximation (SSCA) techniques. A low-complexity algorithm is also proposed to reduce computational complexity. Numerical results validate the proposed system, showing significant performance gains by jointly exploiting the spatial degrees of freedom of the 6DMA-BS and R-IRS under the TTS protocol.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15074v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Song Yu",
      "Ke Zhang",
      "Zhengyu Zong"
    ],
    "title": "Multi-Component Open/Relative/Local Correspondence",
    "abstract": "For a toric Calabi-Yau 3-orbifold relative to s Aganagic-Vafa outer branes, we prove a correspondence among the genus-zero open Gromov-Witten invariants with maximal winding at each brane and: (i) closed invariants of a toric Calabi-Yau (3+s)-orbifold; (ii) formal relative invariants of a formal toric Calabi-Yau (FTCY) 3-orbifold with maximal tangency to s divisors; (iii) formal relative invariants of a sequence of FTCY intermediate geometries interpolating dimensions 3 and 3+s. The correspondence provides examples of the log/local principle of van Garrel-Graber-Ruddat in the multi-component setting and the refined conjecture of Brini-Bousseau-van Garrel via intermediate geometries. It also establishes the multi-component case of the open/closed correspondence proposed by Lerche-Mayr and studied by Liu-Yu. As an application, we obtain examples of the conjecture of Klemm-Pandharipande on the integrality of BPS invariants of higher-dimensional toric Calabi-Yau manifolds. Along the way, we set the basic stages of the relative Gromov-Witten theory of higher-dimensional FTCY orbifolds, generalizing the case of smooth 3-folds by Li-Liu-Liu-Zhou.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15070v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Alexander While",
      "Chen Chen"
    ],
    "title": "QUBO Formulations for MIP Symmetry Detection",
    "abstract": "Formulation symmetry in mixed-integer programming (MIP) can hinder solver performance by inducing redundant search, but detecting such symmetries is also a significant computational challenge. This paper explores the potential for quantum computing to handle symmetry detection. Quantum is a promising alternative to classical compute, but this emerging technology has limited hardware capacity in terms of input problem size. This paper explores the use of Quadratic Unconstrained Binary Optimization (QUBO) models for symmetry detection, as QUBO is the canonical format for quantum optimization platforms. To help address the input size bottleneck, we develop full, reduced, and decomposed QUBO as well as QUBO-Plus formulations for MIP symmetry detection. Computational experiments on the MIPLIB 2017 benchmark are used to estimate the quantum computing resources needed for practical problems.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15049v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Kai Huang",
      "Xinyu Xie",
      "Chunpeng Chen",
      "Wenjie Guan",
      "Xiaoran Wang",
      "Jinbei Zhang"
    ],
    "title": "On the Stochastic Analysis of Random Linear Streaming Codes in Multi-Hop Relay Networks",
    "abstract": "In this paper, we aim to explore the stochastic performance limit of large-field-size Random Linear Streaming Codes (RLSCs) in multi-hop relay networks. In our model, a source transmits a sequence of streaming messages to a destination through multiple relays subject to a delay constraint. Most previous research focused on deterministic adversarial channel which introduces only restricted types of erasure patterns, and aimed to design the optimal capacity-achieving codes. In this paper, we focus on stochastic channel where each hop is subject to i.i.d. packet erasures, and carry out stochastic analysis on the error probability of multi-hop RLSCs. Our contributions are three-folds. Firstly, the error event of large-field-size RLSCs is characterized in two-hop relay network with a novel framework, which features quantification of information flowing through each node in the network. Due to the erasures in different hops, some source symbols can be \"detained\" at the source or relay while others have arrived at the destination. By iteratively computing the number of detained symbols at each node, this framework extends the concept \"information debt\" from point-to-point network [Pinwen Su et al. 2022] into two-hop relay networks. Secondly, based on the error event, the expression of average error probability in two-hop network is derived by carefully analyzing the expectation terms. To handle the expectation over all possible erasure patterns along two hops of the network, the transition matrices of the detained symbols are novelly constructed in a \"band fashion\" with nested structure. Thirdly, the derived results in two-hop network are further generalized into relay networks with arbitrary number of hops. Furthermore, simulations are conducted to verify the accuracy of our stochastic analysis, and compare with some existing streaming codes for the adversarial channels.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14995v1",
    "categories": [
      "math.AG",
      "math.RT"
    ],
    "authors": [
      "Junliang Shen"
    ],
    "title": "Cohomology of compactified Jacobians for locally planar integral curves",
    "abstract": "This article surveys some recent developments on the cohomology of the compactified Jacobian associated with a locally planar integral curve. Topics discussed here include the Ngô support theorem, the perverse filtration, connections to the Hilbert schemes, and cohomological structures induced by the Arinkin-Fourier-Mukai transform.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14976v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Yong-Geun Oh"
    ],
    "title": "Contact triad connection of contact manifolds in almost contact moving frame",
    "abstract": "The notion of \\emph{contact triad connection} on contact triads $(Q,λ,J_ξ)$ was introduced by Wang and the present author in early 2010's from scratch as the contact analog to the canonical connection of an almost Kähler manifolds. The connection facilitates the study of analysis of the contact instanton equation which ranges from local elliptic priori estimates, for both the interior [OW2,OW3] and the boundary [OY], to the generic perturbation theory of the asymptotic operators [KO], which also encompasses the case of pseudoholomorphic curves on noncompact symplectic manifolds with cylindrical ends [OK]. The main purpose of the present paper is to give a simpler and more canonical construction of the contact triad connection by first giving its characterization in terms of the associated \\emph{almost contact structure} and then providing its construction using the almost contact moving frame in the framework of contact geometry.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14957v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Casey Crane",
      "Ziad Ghanem"
    ],
    "title": "Unbounded Branches of Non-Radial Solutions to Semilinear Elliptic Systems on a Unit Ball in $\\mathbb R^3$ and Their Patterns",
    "abstract": "We investigate symmetry-breaking phenomena in semilinear elliptic systems on the unit ball in $\\mathbb{R}^3$, focusing on the emergence of non-radial solution branches with prescribed spatial and internal symmetries. Extending previous scalar results, we develop a framework for systems equivariant under $G := O(3) \\times Γ\\times \\mathbb{Z}_2$, where $Γ$ is a finite group encoding coupling symmetries. Using the $G$-equivariant Leray--Schauder degree and Burnside ring techniques, we derive computable criteria for the existence of unbounded branches of non-radial solutions and classify their isotropy types. Our approach accommodates non-simple eigenvalue multiplicities and provides explicit bifurcation conditions in terms of spectral resonance between coupling eigenvalues and spherical Laplacian modes. Applications to coupled spherical oscillators illustrate how Platonic symmetries and internal permutations interact to produce complex patterns. These results establish a general method for detecting and characterizing symmetry-breaking in high-dimensional elliptic systems.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14956v1",
    "categories": [
      "math.AT",
      "math.CT"
    ],
    "authors": [
      "Julia E. Bergner",
      "Maxine E. Calle",
      "David Chan",
      "Angélica M. Osorno",
      "Maru Sarazola"
    ],
    "title": "A comparison of definitions of equivariant trees",
    "abstract": "We show that various categories of trees can be modeled by Grothendieck constructions on categories of trees with a fixed set of leaves. We prove this result for the dendroidal category $Ω$, the category $Ω^G$ of trees with a $G$-action for a finite group $G$, and finally for the category of genuine equivariant trees $Ω_G$ that has played an important role in recent work on genuine equivariant operads.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14941v1",
    "categories": [
      "math.NA",
      "cs.LG"
    ],
    "authors": [
      "Conor Rowan",
      "Kai Hampleman",
      "Kurt Maute",
      "Alireza Doostan"
    ],
    "title": "Boundary condition enforcement with PINNs: a comparative study and verification on 3D geometries",
    "abstract": "Since their advent nearly a decade ago, physics-informed neural networks (PINNs) have been studied extensively as a novel technique for solving forward and inverse problems in physics and engineering. The neural network discretization of the solution field is naturally adaptive and avoids meshing the computational domain, which can both improve the accuracy of the numerical solution and streamline implementation. However, there have been limited studies of PINNs on complex three-dimensional geometries, as the lack of mesh and the reliance on the strong form of the partial differential equation (PDE) make boundary condition (BC) enforcement challenging. Techniques to enforce BCs with PINNs have proliferated in the literature, but a comprehensive side-by-side comparison of these techniques and a study of their efficacy on geometrically complex three-dimensional test problems are lacking. In this work, we i) systematically compare BC enforcement techniques for PINNs, ii) propose a general solution framework for arbitrary three-dimensional geometries, and iii) verify the methodology on three-dimensional, linear and nonlinear test problems with combinations of Dirichlet, Neumann, and Robin boundaries. Our approach is agnostic to the underlying PDE, the geometry of the computational domain, and the nature of the BCs, while requiring minimal hyperparameter tuning. This work represents a step in the direction of establishing PINNs as a mature numerical method, capable of competing head-to-head with incumbents such as the finite element method.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14939v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Jonathan Boretsky",
      "Zach Walsh"
    ],
    "title": "Excluding a line from positroids",
    "abstract": "For all positive integers $\\ell$ and $r$, we determine the maximum number of elements of a simple rank-$r$ positroid without the rank-$2$ uniform matroid $U_{2,\\ell+2}$ as a minor, and characterize the matroids with the maximum number of elements. This result continues a long line of research into upper bounds on the number of elements of matroids from various classes that forbid $U_{2,\\ell+2}$ as a minor. This is the first paper to study positroids in this context, and it suggests methods to study similar problems for other classes of matroids, such as gammoids or base-orderable matroids.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14931v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Felix Brandt",
      "Matthias Hieber",
      "Lin Ma",
      "Tarek Zöchling"
    ],
    "title": "Moisture dynamics with phase changes coupled to heat-conducting, compressible fluids",
    "abstract": "It is shown that a model coupling the heat-conducting compressible Navier-Stokes equations to a micro-physics model of moisture in air is locally strongly well-posed for large data in suitable function spaces and strongly well-posed on $[0,τ]$ for every $τ> 0$ for small initial data. This seems to be the first result on $[0,τ]$ for arbitrary $τ> 0$ for a model coupling moisture dynamics to heat-conducting, compressible Navier-Stokes equations. A key feature of the micro-physics model is that it also includes phase changes of water in moist air. These phase changes are associated with large amounts of latent heat and thus result in a strong coupling to the thermodynamic equation. The well-posedness results are obtained by means of a Lagrangian approach, which allows to treat the hyperbolicity in the continuity equation. More precisely, optimal $\\mathrm{L}^p$-$\\mathrm{L}^q$ estimates are shown for the linearized system, leading to the local well-posedness result by a fixed point argument and suitable nonlinear estimates. For the well-posedness result on $[0,τ]$ for arbitrary $τ> 0$, a refined analysis of the linearized problem close to equilibria is carried out, and the roughness of the source term, induced by the phase changes, requires to establish delicate a priori bounds.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14871v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Tadej Starčič"
    ],
    "title": "Isotropy groups of the action of orthogonal similarity on skew-symmetric and on complex orthogonal matrices",
    "abstract": "We compute and analyze isotropy subgroups of the complex orthogonal group with respect to the similarity transformation on itself and on skew-symmetric matrices. Their group structure is related to a group of certain nonsingular block matrices whose blocks are rectangular block Toeplitz.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14863v1",
    "categories": [
      "math.NA",
      "math-ph",
      "physics.comp-ph"
    ],
    "authors": [
      "Pavel A. Makarov",
      "Vladimir I. Shcheglov"
    ],
    "title": "Accuracy of the Yee FDTD Scheme for Normal Incidence of Plane Waves on Dielectric and Magnetic Interfaces",
    "abstract": "This paper analyzes the accuracy of the standard Yee finite-difference time-domain (FDTD) scheme for simulating normal incidence of harmonic plane waves on planar interfaces between lossless, linear, homogeneous, isotropic media. We consider two common FDTD interface models based on different staggered-grid placements of material parameters. For each, we derive discrete analogs of the Fresnel reflection and transmission coefficients by formulating effective boundary conditions that emerge from the Yee update equations. A key insight is that the staggered grid implicitly spreads the material discontinuity over a transition layer of one spatial step, leading to systematic deviations from exact theory. We quantify these errors via a transition-layer model and provide (i) qualitative criteria predicting the direction and nature of deviations, and (ii) rigorous error estimates for both weak and strong impedance contrasts. Finally, we examine the role of the Courant number in modulating these errors, revealing conditions under which numerical dispersion and interface discretization jointly influence accuracy.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.14826v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Stephan Foldes",
      "Russ Woodroofe"
    ],
    "title": "Antichain cutsets in real-ranked lattices",
    "abstract": "We show that in a rank supersolvable lattice that is graded by a bounded real interval, any antichain cutset is a level set for some appropriately constructed grading. As a consequence, given an antichain cutset in any of the measurable Boolean lattice, a continuous partition lattice, or a continuous projective geometry, we may find a grading in which the cutset is a level set.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15032v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Chris Connell",
      "Yuping Ruan",
      "Shi Wang"
    ],
    "title": "On the Jacobian of the Douady-Earle extension",
    "abstract": "Given an isotopy class between two closed hyperbolic surfaces, the Douady--Earle extension provides a unique analytic diffeomorphism representative. In this paper we investigate the Jacobian of the Douady--Earle extension map $F$. We prove that $|\\operatorname{Jac} F| \\equiv 1$ precisely when $F$ is an isometry. Moreover, we construct a sequence of hyperbolic surfaces $\\{Σ_i\\}$ together with a fixed domain surface $Σ_0$ for which the Douady--Earle extension maps $F_i:Σ_0\\toΣ_i$ satisfy $\\max_{x\\inΣ_0} \\operatorname{Jac} F_i \\to +\\infty$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15402v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Jonas Knoerr"
    ],
    "title": "Polynomial local functionals on convex functions",
    "abstract": "We shown that every continuous local functional on the space of finite convex functions on $\\mathbb{R}^n$ is a valuation. This relation is used to establish a homogeneous decomposition for the class of polynomial local functionals as well as a classification of translation or rigid motion invariant polynomial local functionals. In addition we discuss implications for the compact-open topology on the space of polynomial local functionals.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15375v1",
    "categories": [
      "math.GT",
      "math.DS",
      "math.GR"
    ],
    "authors": [
      "Michael Brandenbursky",
      "Jarek Kedra",
      "Michal Marcinkowski",
      "Egor Shelukhin"
    ],
    "title": "On quasimorphisms and distortion in homeomorphism groups",
    "abstract": "Let $M$ be a smooth compact oriented manifold, and $Homeo_0(M,μ)$ the group of homeomorphisms of $M$ supported away from $\\partial M$, which preserve a Borel probability measure $μ$ induced by a volume form on $M$, and are isotopic to the identity.\n  In this paper, we identify those Gambaudo-Ghys and Polterovich quasimorphisms $Ψ\\colon Diff_0(M,μ)\\to R$ which extend $C^0$-continuously to $Homeo_0(M,μ)$ as quasimorphisms, and to $Homeo_0(M)$ as group cochains whose differentials are semi-bounded cocycles. We present several applications of this result which include unboundedness of certain bi-invariant metric on the commutator subgroup of $Homeo_0(M,μ)$, and conditions under which a homeomorphism in $Homeo_0(M)$ is undistorted.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15373v1",
    "categories": [
      "math.NA",
      "math.DS"
    ],
    "authors": [
      "Sebastian Resch-Schopper",
      "Romain Rumpler",
      "Gerhard Müller"
    ],
    "title": "Consistent Parametric Model Order Reduction by Matrix Interpolation for Varying Underlying Meshes",
    "abstract": "Parametric model order reduction (pMOR) is a powerful tool for accelerating finite element (FE) simulations while maintaining parametric dependencies. For geometric parameters, pMOR by matrix interpolation is a well-suited approach because it does not require an affine representation of the parametric dependency, which is often not available for geometric parameters. However, the method requires that the underlying FE mesh has the same number of degrees of freedom and the same topology for all parameter configurations. This requirement can be difficult or even impossible to achieve for large parameter ranges or when automatic meshing is used. In this work, we propose a novel framework for pMOR by matrix interpolation for varying underlying meshes. The key idea is to understand the sampled reduced bases as continuous displacement fields that can be represented in different discretizations. By using mesh morphing and basis interpolation, the sampled reduced bases described in varying meshes can all be represented in terms of one reference mesh. This not only allows for performing pMOR by matrix interpolation, but also enables comparing the subspaces that the reduced bases span, which is important to detect strong changes that could lead to inconsistencies in the reduced operators. For mesh morphing, two strategies, namely morphing by spring analogy with elastic hardening and radial basis function morphing, were implemented and tested. Numerical experiments on a beam-shaped plate and a plate with a hole for one- and two-dimensional parameter spaces show that the proposed framework achieves high accuracy for both morphing methods and performs significantly better than two existing approaches for pMOR by matrix interpolation for varying underlying meshes.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15367v1",
    "categories": [
      "math.AG",
      "math.CV"
    ],
    "authors": [
      "Benoit Cadorel",
      "Ya Deng",
      "Katsutoshi Yamanoi"
    ],
    "title": "Hyperbolicity and fundamental groups of complex quasi-projective varieties (II): via non-abelian Hodge theories",
    "abstract": "This is Part II of a series of three papers. We studies the hyperbolicity of complex quasi-projective varieties $X$ in the presence of a big and reductive representation $\\varrho: π_1(X)\\to {\\rm GL}_N(\\mathbb{C})$. For any Galois conjugate variety $X^σ$ with $σ\\in {\\rm Aut}(\\mathbb{C}/\\mathbb{Q})$, we prove the generalized Green-Griffiths-Lang conjecture. When $\\varrho$ is furthermore large, we show that the special subsets of $X^σ$ describing the non-hyperbolicity locus coincide, and that this locus is proper exactly when $X$ is of log general type. Moreover, if the Zariski closure of $ρ(π_1(X))$ is semisimple, we prove that there exists a proper Zariski closed subset $Z \\subsetneq X^σ$ such that every subvariety not contained in $Z$ is of log general type and all entire curves in $X^σ$ are contained in $Z$. This result extends the theorems of the third author (2010) and of Campana-Claudon-Eyssidieux (2015) from projective to quasi-projective varieties, and yields stronger conclusions even in the projective case.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15364v1",
    "categories": [
      "math.GR",
      "math.CO",
      "math.OA",
      "math.PR"
    ],
    "authors": [
      "Oren Becker",
      "Emmanuel Breuillard"
    ],
    "title": "Uniform spectral gaps, non-abelian Littlewood-Offord and anti-concentration for random walks",
    "abstract": "We show that random walks on semisimple algebraic groups do not concentrate on proper algebraic subvarieties with uniform exponential rate of anti-concentration. This is achieved by proving a uniform spectral gap for quasi-regular representations of countable linear groups. The method makes key use of Diophantine heights and the Height Gap theorem. We also deduce a non-abelian version of the Littlewood--Offord inequalities and prove logarithmic bounds for escape from subvarieties. In a sequel to this paper, we will show how to transform this uniform gap into uniform expansion for Cayley graphs of finite simple groups of bounded rank $G(p)$ over almost all primes $p$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15356v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "István Miklós",
      "Miklós Ruszinkó",
      "Bogdán Zavalnij"
    ],
    "title": "A complete dichotomy theorem on the sparse $t$-Uniform Hypergraphicality Problem",
    "abstract": "We prove a complete dichotomy theorem for the parameterized sparse $t$-uniform hypergraphical degree sequence problem, $\\mathrm{sparse}\\text{-}t\\text{-}\\mathrm{uni}\\text{-}\\mathrm{HDS}_{α',α}$. For any fixed $t \\ge 3$, given parameters $0 \\le α' \\le α< t-1$, the input consists of degree sequences $D$ of length $n$ with degrees between $n^{α'}$ and $6n^α$. We show that the problem is NP-complete whenever $α' \\le \\frac{t(α- 1) + 1}{t - 1}$, and solvable in linear time when $α' > \\frac{t(α- 1) + 1}{t - 1}$. This establishes a sharp computational phase transition separating intractable and tractable regimes, fully characterizing the complexity of sparse $t$-uniform hypergraphicality across all degree exponents. The result extends the earlier NP-completeness of dense hypergraphicality to a unified framework covering both sparse and dense regimes, revealing that even extremely sparse instances (with maximum degree $o(n)$ but $Ω(n^{\\frac{t-1}{t}})$) remain NP-complete. On the other hand, the $t$-uniform hypergraphicality solvable in linear time when the maximum degree is $o(n^{\\frac{t-1}{t}})$. This dichotomy provides a comprehensive classification of the complexity landscape for hypergraphical degree sequences.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15354v1",
    "categories": [
      "math.FA",
      "math.AP"
    ],
    "authors": [
      "Andreas Buchinger",
      "Christian Seifert",
      "Sascha Trostorff",
      "Marcus Waurick"
    ],
    "title": "Spatial Approximation for Evolutionary Equations",
    "abstract": "We consider evolutionary equations as introduced by R.\\ Picard in 2009 and develop a general theory for approximation which can be seen as a theoretical foundation for numerical analysis for evolutionary equations. To demonstrate the approximation result, we apply it to a spatial discretisation of the heat equation using spectral methods.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15342v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Zhentian Zhang",
      "Jian Dang",
      "David Morales-Jimenez",
      "Hao Jiang",
      "Zaichen Zhang",
      "Christos Masouros",
      "Chan-Byoung Chae"
    ],
    "title": "Joint Activity Detection and Channel Estimation For Fluid Antenna System Exploiting Geographical and Angular Information",
    "abstract": "The fluid antenna system (FAS) refers to a family of reconfigurable antenna technologies that provide substantial spatial gains within a compact, predefined small space, thereby offering extensive degrees of freedom in the physical layer for future communication networks. The acquisition of channel state information (CSI) is critical, as it determines the placement of ports/antennas, which directly impacts FAS-based optimization. Although various channel estimation methods have been developed, significant flaws persist. For instance, the performance of greedy-based algorithms is heavily influenced by signal assumptions, and current model-free methods are infeasible due to prohibitively high computational complexity issue. Consequently, there is a pressing need for a well-balanced solution that exhibits flexibility, feasibility, and low complexity to support massive connectivity in FAS. In this work, we propose methods based on approximate message passing (AMP) integrated with adaptive expectation maximization (EM). The EM-AMP framework uniquely enables efficient large matrix computations with adaptive learning capabilities, independent of prior knowledge of the model or parameters within potential distributions, making it a robust candidate for FAS networks. We introduce two variants of the EM-AMP framework that leverage geographical and angular features in a FAS network. These proposed algorithms demonstrate improved estimation precision, fast convergence, and low computational complexity in large activity regions. Additionally, we analytically elucidate the reasons behind the inherent performance floor of greedy-based methods and highlight the critical role of angular information in algorithm design. Extensive numerical results validate the promising efficacy of the proposed algorithm designs and the derived analytical findings.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15336v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Xingwu Chen",
      "Jiahao Li",
      "Tao Li"
    ],
    "title": "Crossing-sliding bifurcations in planar $\\mathbb{Z}_2$-symmetric Filippov systems",
    "abstract": "In this paper we investigate the crossing-sliding bifurcations of planar Filippov systems with $\\mathbb{Z}_2$-symmetry. Such bifurcations are triggered by the perturbations of a critical crossing cycle and constitute an important class of discontinuity-induced bifurcations. By constructing transition maps and developing a decomposition theorem of functions to overcome the difficulty of describing bifurcation boundaries in multi-parameter settings, we systematically characterize the codimension-one and codimension-two bifurcation scenarios through the explicit statement of non-degenerate conditions and the presentation of the corresponding bifurcation diagrams. The asymptotic properties of all bifurcation curves are also derived.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15703v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Erika Ye",
      "Chao Yang"
    ],
    "title": "Time integration of quantized tensor trains using the interpolative dynamical low-rank approximation",
    "abstract": "Quantized tensor trains (QTTs) are a low-rank and multiscale framework that allows for efficient approximation and manipulation of multi-dimensional, high resolution data. One area of active research is their use in numerical simulation of hyperbolic systems such as the Navier-Stokes equations and the Vlasov equations. One popular time integration scheme is the dynamical low-rank approximation (DLRA), in which the time integration is constrained to a low-rank manifold. However, until recently, DLRA has typically used orthogonal projectors to project the original dynamical system into a reduced space, which is only well-suited for linear systems. DLRA has also mostly been investigated in the context of non-quantized tensor trains. This work investigates interpolative DLRA schemes in which the low-rank manifold is constructed from aptly chosen interpolation points and interpolating polynomials, in the context of QTTs. Through various examples, its performance is compared to its orthogonal counterpart. This work demonstrates how interpolative DLRA is suitable for nonlinear systems and time integrators requiring nonlinear element-wise operations, such as upwind time integration schemes.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15646v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Jacinto Ulloa",
      "Laurent Stainier"
    ],
    "title": "Material data identification in generalized continua",
    "abstract": "We introduce a data-driven framework for identifying material behavior from full-field kinematics and force measurements in generalized (micromorphic) continua. Unlike traditional approaches that rely on constitutive assumptions or homogenization schemes, our method extracts generalized stress--strain data by enforcing non-classical balance laws and compatibility relations on full-field boundary value problems. Specifically, the approach infers the associated generalized stresses and constructs representative material datasets via clustering in a non-classical phase space. We show that the proposed method reliably extracts non-symmetric and higher-order local stress states, providing material data suitable for either model calibration or model-free data-driven simulations of generalized continua. These capabilities are demonstrated in validation simulations with synthetic data and in an application to mechanical metamaterials, suggesting a practical route for material characterization of microstructured solids.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15593v1",
    "categories": [
      "math.GN",
      "math.LO"
    ],
    "authors": [
      "Sirio Resteghini",
      "Cesare Straffelini"
    ],
    "title": "Simultaneous Sequential Compactness",
    "abstract": "A set of sequences is said to converge simultaneously if there exists an infinite subset $H$ of the index set $ω$ such that all sequences converge when restricted to $H$. We discuss simultaneous convergence of sequences in the same or in different sequentially compact spaces; we link the results for different spaces to ones for the same space; we show that simultaneous convergence happens for less than $\\mathfrak s$ sequences in spaces with weight bounded by $\\mathfrak s$ and for less than $\\mathfrak h$ sequences in general; we show a slight generalisation of these results in the context of Hausdorff spaces; and finally we investigate their optimality.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15573v1",
    "categories": [
      "math.AT",
      "math.CT"
    ],
    "authors": [
      "Ryan Quinn",
      "Qi Zhu"
    ],
    "title": "Multiplicative Equivariant Thom Spectra & Structured Real Orientations",
    "abstract": "For strongly even $\\mathbb{E}_{\\infty}^{C_2}$-rings $E$ we show that any homotopy ring map $\\mathrm{MU} \\to E^e$ lifts to an $\\mathbb{E}_ρ$-map $\\mathrm{MU}_{\\mathbb{R}} \\to E$. This refines the Hahn--Shi Real orientations of Lubin--Tate theories $E_n$, the Hirzebruch level-$n$ orientations of $\\mathrm{tmf}_1(n)$, and Quillen's idempotent to $\\mathbb{E}_ρ$-maps. This allows us to provide the first structured version of $\\mathrm{BP}_{\\mathbb{R}}$ -- we show that it admits an $\\mathbb{E}_ρ$-algebra structure. Furthermore, we extend these results to larger groups. In particular, for a finite group $C_2 \\leq G$ the Hahn--Shi orientation $N_{C_2}^G \\mathrm{MU}_{\\mathbb{R}} \\to E_n$ refines to a $\\operatorname{Coind}_{C_2}^G \\mathbb{E}_ρ$-map, and $N^G_{C_2}\\mathrm{BP}_{\\mathbb{R}}$ admits a $\\operatorname{Coind}_{C_2}^G \\mathbb{E}_ρ$-algebra structure.\n  Essential to this program is a robust theory of multiplicative equivariant Thom spectra, which we develop using parametrized higher algebra and fibrous patterns -- particularly we provide an equivariant version of Antolín-Camarena--Barthel's universal property for multiplicative Thom spectra and use this to deduce a multiplicative equivariant Thom isomorphism. We provide a number of categorical results of independent interest, most notably a distributive monoidal structure on parametrized left module categories.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15562v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Xingyu Zhou",
      "Le Liang",
      "Hao Ye",
      "Jing Zhang",
      "Chao-Kai Wen",
      "Shi Jin"
    ],
    "title": "Reducing Pilots in Channel Estimation With Predictive Foundation Models",
    "abstract": "Accurate channel state information (CSI) acquisition is essential for modern wireless systems, which becomes increasingly difficult under large antenna arrays, strict pilot overhead constraints, and diverse deployment environments. Existing artificial intelligence-based solutions often lack robustness and fail to generalize across scenarios. To address this limitation, this paper introduces a predictive-foundation-model-based channel estimation framework that enables accurate, low-overhead, and generalizable CSI acquisition. The proposed framework employs a predictive foundation model trained on large-scale cross-domain CSI data to extract universal channel representations and provide predictive priors with strong cross-scenario transferability. A pilot processing network based on a vision transformer architecture is further designed to capture spatial, temporal, and frequency correlations from pilot observations. An efficient fusion mechanism integrates predictive priors with real-time measurements, enabling reliable CSI reconstruction even under sparse or noisy conditions. Extensive evaluations across diverse configurations demonstrate that the proposed estimator significantly outperforms both classical and data-driven baselines in accuracy, robustness, and generalization capability.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15561v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Sayan Banerjee",
      "Shankar Bhamidi",
      "Remco van der Hofstad",
      "Rounak Ray"
    ],
    "title": "Non-equilibrium coagulation processes and subcritical percolation on evolving networks",
    "abstract": "We investigate percolation on growing networks where the evolution of connected components resembles a non-equilibrium version of the multiplicative coalescent. The supercritical $π> π_c$ regime for a host of such models was conjectured in statistical physics, and then rigorously proven in mathematics, to exhibit behavior similar to the BKT infinite-order phase transition as $π\\searrow π_c$. It has further been conjectured that the entire regime $π<π_c$ for such growing networks are ''critical'' with power-law cluster size distributions having a non-universal exponent for all values of $π\\in (0, π_c)$.\n  In this paper, we study percolation on the uniform attachment model, as a concrete template in order to develop general tools based on stochastic approximation, local convergence, branching random walks and tree-graph inequalities to prove the above conjectured phenomena. For each $π\\in (0,π_c)$, we show there exists an explicit $α(π) \\in (0,\\tfrac{1}{2}) $ such that the maximal component size, as well as the size of the component containing any fixed vertex, all re-scaled by $n^{α(π)}$, converge almost surely to strictly positive random variables as the network size $n \\to \\infty$. These dynamics lead to novel phenomena, compared to classical 'static' models, including long-range dependence and fixation of the identity of the maximal component, within finite time, among a finite number of 'early' components. Moreover, in contrast with most static network models, we show that the susceptibility, that is, the expected size of the component of a uniformly chosen vertex, remains bounded as the network grows and $π$ approaches $π_c$ from below. The general tools developed in this paper will be used in follow-up work to understand percolation for general growing network evolution models.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15506v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Alessandra Faggionato",
      "Michele Salvi"
    ],
    "title": "Scaling limit of the complex mobility matrix for the random conductance model on $\\mathbb{T}^d_N$",
    "abstract": "We consider a continuous-time random walk on the $d$-dimensional torus $\\mathbb{T}^d_{N}=\\mathbb{Z}^d/N \\mathbb{Z}^d$, possibly with long-range, but finite, jumps. The law of the jumps is regulated by a random environment $ξ$ yielding a stationary and ergodic field of random conductances. The complex mobility matrix $σ_N^ξ(ω)$ measures the linear response of the random walk to a $\\cos(ωt)$-type oscillating external field. By investigating the homogenization properties of the medium, and assuming in addition that the conductances have finite second moment, we show that, for almost every realization of the environment $ξ$, the complex mobility matrix $σ_N^ξ(ω)$ converges as $N\\to+\\infty$ to a deterministic limiting matrix $σ(ω)$ and provide different characterizations of $σ(ω)$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15490v1",
    "categories": [
      "math.LO",
      "math.GN"
    ],
    "authors": [
      "Valentin Haberl",
      "Piotr Szewczak",
      "Lyubomyr Zdomskyy"
    ],
    "title": "Universally meager sets in the Miller model and similar ones",
    "abstract": "We work in the realm of sets of reals. We prove that in the Miller model and in a model constructed by Goldstern-Judah-Shelah all universally meager sets have size at most $ω_1$. Some relations between combinatorial covering properties in these models allow to obtain the same limitations for sizes of Rothberger spaces and Hurewicz spaces with no homeomorphic copy of the Cantor set inside. It follows from our results that the existence of a strong measure zero set of size $ω_2$ does not imply the existence of a Rothberger space of size $ω_2$. We also prove that in the Miller model all strong measure zero sets have size at most $ω_1$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15478v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Tianzhi Hu",
      "Ruiran Sun",
      "Kang Zuo"
    ],
    "title": "Non-existence of holomorphic isomonodromic deformation of a Higgs bundle",
    "abstract": "We use the cohomological interpretation of anti-holomorphic derivatives of the isomonodromic deformation of a Higgs bundle, as established in our previous work \\cite{HSZ}, to provide a short new proof of the non-existence of holomorphic isomonodromic deformation of a generic $\\SL$-Higgs bundle and of any non-unitary rank 2 Higgs bundle over the Teichmüller space $\\mathcal T_g$, which were previously proved in \\cite{biswas}. We also prove the non-existence of holomorphic isomonodromic deformation of any non-unitary rank 3 Higgs bundle over the Teichmüller space $\\mathcal T_g$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15471v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Casper Loman",
      "Loriana Pascual",
      "Marjan van den Akker",
      "Roel van den Broek",
      "Han Hoogeveen"
    ],
    "title": "Robustness Measures for Stochastic Parallel Machine Scheduling and Train Unit Shunting",
    "abstract": "In many real world scheduling problems, the processing times of tasks are subject to uncertainty. This makes it essential to design schedules that are robust and able to handle potential disruptions. Therefore, we investigate measures that give us information about the robustness of a schedule. Although many measures can be found in literature, there is no consensus on which measures are the best. We identify 14 robustness measures from the literature, as well as introduce 4 new ones. To find out which of these measures are best used for generating robust schedules, we perform an elaborate simulation study to investigate how well these robustness measures correlate with the stability of the objective function under disturbances (quality robustness) and with the stability of the schedule itself (solution robustness). We first consider the Stochastic Parallel Machine Scheduling Problem (SPMSP) with precedence constraints, which is a very general setting that is relevant for many practical situations. We then perform a second simulation study by taking the best performing measures from the first experiment, and using them for the Train Unit Shunting Problem with Service Scheduling (TUSPwSS). After establishing the correlation with quality and solution robustness, we included the measures as objective in a local search algorithm. We make a comparison between the theoretical setting of the SPMSP and the TUSPwSS, and identify a set of robustness measures that can be applied in many different settings. We show that we can achieve up to 90% decreases in delays compared to using no robustness measures. Lastly, we also identify properties that can be used to predict the effectiveness of such a robustness measure.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15613v1",
    "categories": [
      "math.CT",
      "math.AG",
      "math.AT",
      "math.LO"
    ],
    "authors": [
      "Ivan Di Liberti",
      "Nicholas Meadows"
    ],
    "title": "Classifying Infinity Topoi via Weighted Limits",
    "abstract": "We construct classifying $\\infty$-topoi by showing that the $(\\infty,2)$-category of topoi has weighted limits. We show that several prestacks of interest have a classifying topos, including the prestack of spectra.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15450v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Gaston Nieuviarts"
    ],
    "title": "Emergence of Time from a Twisted Spectral Triple in Almost-Commutative Geometry",
    "abstract": "This proceeding presents a synthesis of recent results on the emergence of pseudo-Riemannian structures from twisted spectral triples within the almostcommutative framework. It provides a unified algebraic mechanism for addressing the Lorentzian signature problem, demonstrating how the almost-commutative structure underlying the noncommutative Standard Model of particle physics may give rise to Lorentzian spectral triple from a purely Riemannian setting. This notably offers an alternative to Wick rotation, provided by a notion of morphism connecting twisted and pseudo-Riemannian spectral triples.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15438v1",
    "categories": [
      "math.AG",
      "math.CO",
      "math.MG"
    ],
    "authors": [
      "Naoki Kitazawa"
    ],
    "title": "Regions surrounded by cylinders of circles of fixed radii and exposition of their shapes by natural graphs",
    "abstract": "We investigate regions formed by cylinders of circles of fixed radii. We investigate graphs obtained by collapsing each level set of the functions represented by the natural projections of them to the $1$-dimensional line. Some specific trees obtained in simple ways from so-called balanced trees are shown to be realized as such graphs. Related studies on regions in the Euclidean plane surrounded by real algebraic curves are presented by several researchers. One of pioneering studies is presented by Bodin, Popescu-Pampu and Sorea in 2022--3 as an elementary and surprisingly new study. The author has been interested in related studies and also in constructing natural and explicit real algebraic maps onto such regions, generalizing the canonical projections of the unit spheres. Such studies in real algebraic geometry, different from theory of existence in the last century, mainly studied by Nash and Tognoli, are remarked.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15421v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Ishrak Alhajj Hassan"
    ],
    "title": "Empirical Laws for Iterated Correlation Matrices",
    "abstract": "We study the discrete iteration obtained by repeatedly applying the Pearson correlation operator to a real matrix. Each step centers every row, normalizes each centered row to unit Euclidean norm, and forms the Gram matrix of the resulting rows. This defines a nonlinear self-map on the space of correlation matrices that underlies classical procedures such as CONCOR and GAP. Despite its long history and simple formulation, the global behavior of this iteration has remained analytically unresolved. We develop a geometric formulation that separates the dynamics into strongly contractive directions associated with row means and norms, and nearly isometric directions tangent to the mean-zero, unit-norm row manifold. This structure explains why local linear convergence results do not extend to a global contraction theorem. Empirically, we conduct a large-scale numerical study over dimensions \\(n\\in[3,2000]\\) and thousands of random initializations using a dimension-uniform experimental framework. Using the Frobenius step size, the entrywise step size, and the one-step contraction ratio, we identify four universal empirical laws that persist uniformly across all tested dimensions: a sharp first-step contraction, quasi-monotone decay with bounded overshoots and finite total variation, a universal relationship between contraction ratio and step size, and convergence in a uniformly bounded number of iterations. These findings provide the first quantitative, dimension-uniform description of the iteration and establish a precise benchmark for future global analysis.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15392v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Chiara Schindler"
    ],
    "title": "Asymptotic behaviour of stochastic inertial dynamics incorporating a Tikhonov regularization term",
    "abstract": "In a separable Hilbert space, we study the minimization problem of a convex smooth function with Lipschitz continuous gradient whose evaluations are corrupted by random noise. To this end, we associate a stochastic inertial system that incorporates Tikhonov regularization with the optimization problem. We establish existence and uniqueness of a solution trajectory for this system. Then, we derive an upper bound on the expected value of an appropriate associated energy function given square-integrability of the diffusion $σ_X$ before focusing on the particular case where the parameter function multiplied by the Tikhonov term is given by $\\frac{1}{t^r}$ for $0<r<2$. For this setting, we show a.s. convergence rates as well as convergence rates in expectation for the function values along the trajectory to an infimal value, the trajectory process to an optimal solution and its time derivative to zero under a stronger integrability condition on $σ_X$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15382v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Robert Denk",
      "Floris B. Roodenburg"
    ],
    "title": "Trace theory for parabolic boundary value problems with rough boundary conditions",
    "abstract": "We characterise the trace spaces arising from intersections of weighted, vector-valued Sobolev spaces, where the weights are powers of the distance to the boundary. These weighted function spaces are particularly suitable for treating boundary value problems where derivatives of the solution blow up at the boundary. As an application of our trace theory, we prove well-posedness for the heat equation with rough inhomogeneous boundary data in Sobolev spaces of higher regularity in domains of fixed regularity $C^{1,κ}$, with $κ\\in [0,1)$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15362v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Chunhao Cai"
    ],
    "title": "Drift estimation for a partially observed mixed fractional Ornstein--Uhlenbeck process",
    "abstract": "We consider estimation of the drift parameter $\\vartheta>0$ in a \\emph{partially observed} Ornstein--Uhlenbeck type model driven by a mixed fractional Brownian noise. Our framework extends the partially observed model of \\cite{BrousteKleptsyna2010} to the \\emph{mixed} case. We construct the canonical innovation representation, derive the associated Kalman filter and Riccati equations, and analyse the asymptotic behaviour of the filtering error covariance.\n  Within the Ibragimov--Khasminskii LAN framework we prove that the MLE of $\\vartheta$, based on continuous observation of the partially observed system on $[0,T]$, is consistent and asymptotically normal with rate $\\sqrt{T}$ and the Fisher Information is the same as in \\cite{BrousteKleptsyna2010} or the standard Brownian motion case.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15351v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Medet Jumadildayev"
    ],
    "title": "Duality Relations of Graph Polynomials",
    "abstract": "The duality theorem of Lass relates the matching polynomials of a simple graph $G$ with the matching polynomials of its complement $\\bar G$. In particular, this relation gives rise to Godsil's result, which offers a nice interpretation of the Lebesgue-Stieltjes integral associated with the Hermite orthogonality measure. In this work, we introduce the concept of path-cover polynomials. Similar to matching polynomials, we show that path-cover polynomials also satisfy duality relations and give combinatorial interpretations of the Lebesgue-Stieltjes integral and the inner product in the space of associated Laguerre polynomials. Similar duality relations hold for clique-cover polynomials and chromatic polynomials. As applications, we find an efficient algorithm that computes graph polynomials for cographs. We also give explicit formulas to compute the number of Hamiltonian paths and cycles in complete multipartite graphs.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15317v1",
    "categories": [
      "math.NA",
      "math.FA"
    ],
    "authors": [
      "M. Buhmann",
      "J. Jódar",
      "M. Rodríguez"
    ],
    "title": "Hyperbolic trigonometric functions as approximation kernels and their properties II: Wavelets",
    "abstract": "In a previous paper we have introduced a new class of radial basis functions that are powerful means to approximate functions by quasi-interpolation. In this article we extend the results to create new ways of approximating functions by prewavelets that are constructed from spaced spanned of the new hyperbolic radial basis functions. They consist of highly localised time-frequency decompositions that are suitable for analysis and filtering. The construction is sufficiently general to apply for large classes of other radial basis functions too - such as multiquadrics and their generalisations and thin-plate splines -, as well as, for example, polynomial splines.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15307v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Roberto de A. Capistrano Filho",
      "Hugo Parada",
      "Jandeilson Santos da Silva"
    ],
    "title": "A Nonhomogeneous Boundary-Value Problem For The Nonlinear KdV Equation on Star Graphs",
    "abstract": "This paper investigates a boundary-value problem for the Korteweg-de Vries (KdV) equation on a star-graph structure. We develop a unified framework introducing the notion of $s$-compatibility, which generalizes classical compatibility conditions to star-shaped and more complex graph configurations, inspired by the works of Bona, Sun, and Zhang [14]. By combining analytical techniques with a fixed-point argument, we establish sharp global well-posedness for both the linear and nonlinear problems at the $H^s$ level. In this setting, our results extend the classical analysis for a single KdV equation [14] to star-shaped graphs composed of $N$ equations. These results provide the first comprehensive well-posedness theory for KdV equations with coupled boundary conditions on graphs. Although control issues are not treated in this article, the analytic results obtained here address several open problems, which will be addressed in a forthcoming",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15594v1",
    "categories": [
      "math.FA",
      "math.AP"
    ],
    "authors": [
      "Bernhard H. Haak",
      "Peer Christian Kunstmann"
    ],
    "title": "A cheap way to closed operator sums",
    "abstract": "Let $A$ and $B$ be sectorial operators in a Banach space $X$ of angles $ω_A$ and $ω_B$, respectively, where $ω_A+ω_B<π$. We present a simple and common approach to results on closedness of the operator sum $A+B$, based on Littlewood-Paley type norms and tools from several interpolation theories. This allows us to give short proofs for the well-known results due to Da~Prato-Grisvard and Kalton-Weis. We prove a new result in $\\ell^q$-interpolation spaces and illustrate it with a maximal regularity result for abstract parabolic equations. Our approach also yields a new proof for the Dore-Venni result.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15591v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Igor Dolinka",
      "Robert D. Gray"
    ],
    "title": "On right units of special inverse monoids",
    "abstract": "We study the class of monoids that arise as the submonoid of right units of finitely presented special inverse monoids (SIMs). Gray and Ruškuc (2024) gave the first example of a finitely presented SIM whose submonoid of right units does not admit a decomposition into a free product of the group of units and a finite rank free monoid. In the first part of this paper we prove a general result which shows that the only instances where the right units of a finitely presented SIM can admit such a free product decomposition is when their group of units is finitely presented. In showing this, we establish some general results about finite generation and presentability of subgroups of SIMs. In particular, we give an exact characterisation of when an arbitrary subgroup is finitely generated in terms of connectedness properties of unions of its cosets in its $\\mathscr{R}$-class, and also a characterisation of when an arbitrary subgroup is finitely presented. We also give a sufficient condition for finite generation and presentability of an arbitrary subgroup given in terms of a geometric finiteness property called boundary width. As a consequence, we show that the classes of monoids of right units of finitely presented SIMs and prefix monoids of finitely presented groups are independent. In the second part of the paper, we show that every finitely generated submonoid of a finitely RC-presented monoid is isomorphic to a submonoid $N$ of a finitely presented SIM $M$ such that $N$ is a submonoid of the right units of $M$, and $N$ contains the group of units of $M$. This result generalises and extends the classification of groups of units of finitely presented SIMs recently obtained by Gray and Kambites (2025). From this, we derive a number of surprising properties of RC-presentations for right cancellative monoids contrasting the classical theory of monoid presentations.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15590v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "César F. Venegas R.",
      "Helbert J. Venegas R"
    ],
    "title": "Cancellation problem via locally nilpotent derivations",
    "abstract": "The Zariski cancellation problem plays a central role in affine algebraic geometry and noncommutative algebra, with locally nilpotent derivations providing a fundamental invariant-theoretic approach. This article presents a unified survey of cancellation phenomena in commutative algebras, noncommutative algebras, and skew (Ore-type) extensions, emphasizing the role of rigidity and the Makar--Limanov invariant. We explain how the locally nilpotent derivation framework successfully detects cancellation in rigid settings, while also identifying its inherent limitations, particularly in the skew case where Makar--Limanov stability fails. This perspective clarifies the scope and the boundaries of the locally nilpotent derivation method in cancellation theory.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15529v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Erik I. Broman",
      "Johan H. Tykesson"
    ],
    "title": "The Poisson stick model in hyperbolic space",
    "abstract": "In this paper we study the Poisson stick model in two dimensional hyperbolic space $\\mathbb{H}^2,$ where the sticks all have length $L.$ Typically, percolation models in hyperbolic space undergo two phase transitions as the intensity $λ$ varies, namely the percolation phase transition and the uniqueness phase transition. For the Poisson stick model, the critical intensities at which these transitions occur will depend on $L$, and in this paper we study the asymptotic behavior of these critical points as $L\\to \\infty.$ Our main results show that the critical point for the percolation phase transition scales like $L^{-2},$ while the critical point for the uniqueness phase transition scales like $L^{-1}.$ Comparing these results to the analogous results in Euclidean space show that the behavior of the percolation phase transition is the same in these two settings, while the uniqueness phase transition scales differently.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15519v1",
    "categories": [
      "math.FA",
      "math.CV"
    ],
    "authors": [
      "Anna Doležalová",
      "Jani Onninen",
      "Yizhe Zhu",
      "Zheng Zhu"
    ],
    "title": "Global Integrability of the Reciprocal of Jacobians for Homeomorphisms of Finite Distortion",
    "abstract": "For a homeomorphism with $p$-integrable distortion, we obtain the optimal global degree of integrability for the reciprocal of its Jacobian determinant. As an application, we strengthen the result of Doležalová, Hencl and Malý concerning weak limits of Sobolev homeomorphisms with finite distortion. Such limits represent physically admissible deformations, as they remain injective almost everywhere and thus adhere as closely as possible to the principle of non-interpenetration of matter in mathematical models of nonlinear elasticity.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15495v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Lubomir Banas",
      "Jean Daniel Mukam"
    ],
    "title": "Robust a posteriori error analysis of the stochastic Cahn-Hilliard equation with rough noise",
    "abstract": "We derive a posteriori error estimate for a fully discrete adaptive finite element approximation of the stochastic Cahn-Hilliard equation with rough noise. The considered model is derived from the stochastic Cahn-Hilliard equation with additive space-time white noise through suitable spatial regularization of the white noise. The a posteriori estimate is robust with respect to the interfacial width parameter as well as the noise regularization parameter. We propose a practical adaptive algorithm for the considered problem and perform numerical simulations to illustrate the theoretical findings.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15467v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Vladimir Müller",
      "Yuri Tomilov"
    ],
    "title": "On regularity of compressions and diagonals of operator functions",
    "abstract": "Replacing operators with continuous operator-valued functions, we prove time-dependent versions of well-known results on compressions and diagonals of bounded operators. The setting of smooth functions is also addressed. Our results have no analogues in the literature and rely on a new technique. The results are especially transparent for selfadjoint operators.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15678v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Jorge I. Poveda",
      "Andrew R. Teel"
    ],
    "title": "Hybrid Set-Seeking Systems: Model-Free Feedback Optimization via Hybrid Inclusions",
    "abstract": "This article aims to provide an accessible, tutorial-style introduction to hybrid extremum-seeking systems, which are model-free, feedback-optimization controllers that incorporate hybrid dynamics, meaning both continuous-time and discrete-time behaviors. Such systems arise when advanced control and optimization tools are needed to overcome the limitations of smooth feedback methods and to satisfy demanding transient and steady-state requirements in high-performance applications. They also appear when controllers must operate on plants that inherently exhibit hybrid behaviors, as is common in cyber-physical and autonomous systems that rely on digital sensing, computation, and actuation. To study hybrid extremum-seeking dynamics through control-theoretic methods, we first review the key concepts that support the development of perturbation theory for hybrid inclusions, forming the basis for averaging and singular perturbation analyses. We then show how these ideas apply to the design and evaluation of hybrid extremum-seeking algorithms for static and dynamic plants. Several examples are presented, including set-valued and switching algorithms under different switching regimes such as arbitrarily fast switching, dwell-time and average dwell-time constraints, and average activation time conditions. We also discuss state-based switching extremum seeking for obstacle-avoidance problems and gradient-Newton switching schemes. Additional topics include momentum-based and reset-type extremum seeking, intermittent updates, slowly varying parameters, hybrid filters, and safety-aware schemes that incorporate constraints. Across all these settings, we illustrate how perturbation-based methods traditionally used for extremum-seeking control naturally extend to hybrid systems when mild regularity assumptions are satisfied, and solutions are modeled on hybrid time domains.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15664v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Peter Humphries"
    ],
    "title": "Quantitative Equidistribution on Hyperbolic Surfaces and Arithmetic Applications",
    "abstract": "The Wasserstein distance quantifies the distance between two probability measures on a metric space. We prove an analogue of the Berry-Esseen inequality for the Wasserstein distance on a finite area hyperbolic surface. This inequality controls the Wasserstein distance via an average of Weyl sums, which are integrals of Maass cusp forms and Eisenstein series with respect to these probability measures. As applications, we prove upper bounds for the Wasserstein distance for some equidistribution problems on the modular surface $\\mathrm{SL}_2(\\mathbb{Z}) \\backslash \\mathbb{H}$, namely Duke's theorems on the equidistribution of Heegner points and of closed geodesics and Watson's theorem on the mass equidistribution of Hecke-Maass cusp forms conditionally under the assumption of the generalised Lindelof hypothesis.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15631v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Dibyendu Adak",
      "Rujeko Chinomona",
      "Duc P. Truong",
      "Oleg Korobkin",
      "Kim Ø. Rasmussen",
      "Boian S. Alexandrov"
    ],
    "title": "Space-Time Spectral Collocation Tensor-Network Approach for Maxwell's Equations",
    "abstract": "In this work, we develop a space--time Chebyshev spectral collocation method for three-dimensional Maxwell's equations and combine it with tensor-network techniques in Tensor-Train (TT) format. Under constant material parameters, the Maxwell system is reduced to a vector wave equation for the electric field, which we discretize globally in space and time using a staggered spectral collocation scheme. The staggered polynomial spaces are designed so that the discrete curl and divergence operators preserve the divergence-free constraint on the magnetic field. The magnetic field is then recovered in a space--time post-processing step via a discrete version of Faraday's law. The global space--time formulation yields a large but highly structured linear system, which we approximate in low-rank TT-format directly from the operator and data, without assuming that the forcing is separable in space and time. We derive condition-number bounds for the resulting operator and prove spectral convergence estimates for both the electric and magnetic fields. Numerical experiments for three-dimensional electromagnetic test problems confirm the theoretical convergence rates and show that the TT-based solver maintains accuracy with approximately linear complexity in the number of grid points in space and time.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15612v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Leandro Fiorini Aurichi",
      "Guilherme Eduardo Pinto"
    ],
    "title": "Universal families of rayless graphs",
    "abstract": "We study the existence and cardinality of universal families for classes of rayless graphs. It is known, by a result of Diestel, Halin, and Vogler, that the class of countable rayless graphs does not admit a countable universal family, leaving open the precise complexity of this class. We prove that for every infinite cardinal $κ$, the class of rayless graphs of cardinality at most $κ$ admits a strongly universal family of size exactly $κ^+$, and that no smaller family can exist. This settles the problem for the countable case and extends uniformly to higher cardinalities.\n  We further investigate subclasses defined by forbidding subgraphs. When finitely many finite graphs are forbidden, the strong complexity remains $κ^+$, except in degenerate cases where it collapses to countable. In contrast, the class of countable rayless graphs when forbidding certain infinite graphs has a complexity that reaches its maximum possible value, the continuum.\n  Finally, we establish that natural subclasses -- including rayless trees, bipartite rayless graphs, graphs without even cycles, and graphs without infinite trails -- retain the minimal strong complexity $κ^+$. These results provide a comprehensive characterization of universality in rayless graphs and highlight both its stability under restrictions and its sensitivity to specific obstructions.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15563v1",
    "categories": [
      "math.AG",
      "math.AC"
    ],
    "authors": [
      "Takumi Murayama"
    ],
    "title": "Equidimensional morphisms onto splinters are pure",
    "abstract": "We prove that a Noetherian ring $R$ is a splinter if and only if for every equidimensional surjective morphism $\\operatorname{Spec}(S) \\to \\operatorname{Spec}(R)$, the map $R \\to S$ is pure. This yields a large, nontrivial class of ring maps that are automatically pure. More generally, we prove that a locally Noetherian scheme $Y$ is locally a splinter if and only if every locally equidimensional morphism $X \\to Y$ is strongly pure. Special cases of our results show that equidimensional fibrations over normal $\\mathbf{Q}$-schemes or regular schemes of arbitrary characteristic are strongly pure. The main ingredient is a new factorization result for locally equidimensional morphisms of schemes, which is of independent interest. Additionally, we prove a weak Boutot-type theorem for $F$-rationality, which says that $F$-rationality descends under pure ring maps that are locally equidimensional under universally catenary assumptions. This statement is false without the locally equidimensional hypothesis.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15500v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Bénédicte Haas",
      "Grégory Miermont"
    ],
    "title": "Ancestral diversity in fragmentation trees",
    "abstract": "In a deterministic or random tree, a notion of ancestral diversity can be defined as follows. Sample independently $n$ groups of $k$ leaves and count the number $N_n(k)$ of distinct most recent common ancestors of each of the groups. As $n$ becomes large, the asymptotic behavior of $N_n(k)$ depends of course on the structure of the tree. Motivated by the study of the edge density in the Brownian co-graphon, Chapuy recently considered this problem in the case where $k=2$ and where the tree is the Brownian continuum random tree. We vastly extend this framework by considering general values of $k$ and general fragmentation trees, which include some prominent examples such as stable Lévy trees and idealized models of phylogenetic trees. Other natural ancestral statistics are also considered. For a given tree model, we identify a phase transition-like phenomenon, with different asymptotic regimes for $N_k(n)$, depending on the position of $k$ relative to a model-dependent critical value.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15499v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Anton Izosimov",
      "Pavlo Pylyavskyy"
    ],
    "title": "The dimer model and dynamical incidence geometry",
    "abstract": "We propose a geometric counterpart of the dimer model on bipartite graphs. A state of our model consists of a choice of a point for each white vertex and hyperplane for each black vertex. This data is subject to certain conditions determined by the graph; the resulting configurations are called coherent double circuit configurations. We show that our model behaves consistently under standard local moves of the dimer model. On the geometric side, this gives rise to a new class of theorems in linear incidence geometry - dynamical incidence theorems. Examples include results on pentagram maps, pentagram spirals, and Q-nets. We also examine the problem of parametrizing coherent double circuit configurations. In particular, we study whether, once the white-vertex part of the data is fixed, one can recover the black-vertex data from a point on the spectral curve.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15487v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Mats Ehrnström",
      "Mark D. Groves"
    ],
    "title": "A plethora of fully localised solitary waves for the full-dispersion Kadomtsev-Petviashvili equation",
    "abstract": "The KP-I equation arises as a weakly nonlinear model equation for gravity-capillary waves with Bond number $β>1/3$, also called strong surface tension. This equation has recently been shown to have a family of nondegenerate, symmetric `fully localised' or `lump' solitary waves which decay to zero in all spatial directions. The full-dispersion KP-I equation is obtained by retaining the exact dispersion relation in the modelling from the water-wave problem. In this paper we show that the FDKP-I equation also has a family of symmetric fullly localised solitary waves which are obtained by casting it as a perturbation of the KP-I equation and applying a suitable variant of the implicit-function theorem.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15486v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Mohammed Lalou",
      "Nader Mbarek",
      "Abdallah Skender",
      "Olivier Togni"
    ],
    "title": "Completely Independent Spanning Trees in Split Graphs: Structural Properties and Complexity",
    "abstract": "We study completely independent spanning trees (CIST), \\textit{i.e.}, trees that are both edge-disjoint and internally vertex-disjoint, in split graphs. We establish a correspondence between the existence of CIST in a split graph and some types of hypergraph colorings (panchromatic and bipanchromatic colorings) of its associated hypergraph, allowing us to obtain lower and upper bounds on the number of CIST. Using these relations, we prove that the problem of the existence of two CIST in a split graph is NP-complete. Finally, we formulate a conjecture on the bipanchromatic number of a hypergraph related to the results obtained for the number of CIST.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15475v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Mamadou Ciss",
      "Abdourahmane Diatta",
      "El Hadji Abdoulaye Thiam"
    ],
    "title": "A Nonlinear elliptic PDE with curve singularity on the boundary",
    "abstract": "Let $Ω$ be a bounded domain of $\\mathbb{R}^{N+1}$ ($N \\geq 3$) with smooth boundary $\\partial Ω$ and $Σ$ be a closed submanifold contained on $\\partial Ω$ and containing $0$. We are interesting in the existence of positive $H^1(Ω)$-solution of the following Hardy-Sobolev trace type equation \\begin{equation*} \\begin{cases} -Δu+u=0 \\qquad & \\textrm{ in $Ω$}\\\\\\\\ \\displaystyle\\frac{\\partial u}{\\partial ν}= ρ_Σ^{-s} u^{q_s-1} \\qquad & \\textrm{ on $\\partial Ω$}, \\end{cases} \\end{equation*} where $ν$ is the unit outer normal of $\\partial Ω$, $ρ_Σ: \\partial Ω\\to \\mathbb{R}$ is the distance function in $\\partial Ω$ to the curve $Σ$: $$ ρ_Σ(x):= \\inf_{y \\in Σ} d_{\\tilde{g}}(x, y) $$ and for $0\\leq s <1$, $q_s:=\\frac{2(N-s)}{N-1}$ is the critical Hardy-Sobolev exponent. The existence of solution may depend on the local geometry of the boundary $\\partial Ω$ and $Σ$ at $0$ or in the shapes of the domain $Ω$ and its boundary $\\partial Ω$.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15464v1",
    "categories": [
      "math.AP",
      "math.DG"
    ],
    "authors": [
      "Yingxiang Hu",
      "Mohammad N. Ivaki"
    ],
    "title": "Capillary $L_p$-Christoffel-Minkowski problem",
    "abstract": "We solve the capillary $L_p$-Christoffel--Minkowski problem in the half-space for $1<p<k+1$ in the class of even hypersurfaces. A crucial ingredient is a non-collapsing estimate that yields lower bounds for both the height and the capillary support function. Our result extends the capillary Christoffel--Minkowski existence result of \\cite{HIS25}.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15459v1",
    "categories": [
      "math.DS",
      "math.PR"
    ],
    "authors": [
      "Giulia Di Nunno",
      "Nicola Giordano",
      "Barbara Martinucci",
      "Olena Tymoshenko"
    ],
    "title": "Stochastic dynamics with self-exciting factor for Monkeypox transmission",
    "abstract": "We develop a stochastic human-rodent compartment model for Mpox transmission that combines diffusion noise with Hawkes self-exciting jumps in the human infection dynamics. Including Hawkes processes allows, for instance, to model the short but significant spikes in transmission happening after crowded events. For the coupled human-rodent system, we prove global existence, uniqueness and positivity of solutions, derive a basic reproduction number R_0 that guarantees almost sure extinction when R_0 < 1, and obtain explicit persistence-in-the-mean conditions for both infected rodents and humans, which define persistence thresholds for the joint dynamics. Numerical experiments show how clustered human transmission events, environmental variability and control measures shift these thresholds and shape the frequency and size of Mpox outbreaks.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15455v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Jean-Guillaume de Damas",
      "Laura Grigori",
      "Igor Simunec",
      "Edouard Timsit"
    ],
    "title": "Randomized orthogonalization and Krylov subspace methods: principles and algorithms",
    "abstract": "We present an overview of randomized orthogonalization techniques that construct a well-conditioned basis whose sketch is orthonormal. Randomized orthogonalization has recently emerged as a powerful paradigm for reducing the computational and communication cost of state-of-the-art orthogonalization procedures on parallel architectures, while preserving, and in some cases improving, their numerical stability. This approach can be employed within Krylov subspace methods to mitigate the cost of orthogonalization, yielding a randomized Arnoldi relation. We review the main variants of the randomized Gram--Schmidt and Householder QR algorithms, and discuss their application to Krylov methods for the solution of large-scale linear algebra problems, such as linear systems of equations, eigenvalue problems, the evaluation of matrix functions, and matrix equations.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15426v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Cecilia Cavaterra",
      "Matteo Fornoni",
      "Maurizio Grasselli",
      "Benoît Perthame"
    ],
    "title": "On a relaxed Cahn-Hilliard tumour growth model with single-well potential and degenerate mobility",
    "abstract": "We consider a phase-field system modelling solid tumour growth. This system consists of a Cahn-Hilliard equation coupled with a nutrient equation. The former is characterised by a degenerate mobility and a singular potential. Both equations are subject to suitable reaction terms which model proliferation and nutrient consumption. Chemotactic effects are also taken into account. Adding an elliptic regularisation, depending on a relaxation parameter $δ>0$, in the equation for the chemical potential, we prove the existence of a weak solution to an initial and boundary value problem for the relaxed system. Then, we let $δ$ go to zero, and we recover the existence of a weak solution to the original system.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15419v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Shilei Li",
      "Dawei Shi",
      "Hao Yu",
      "Ling Shi"
    ],
    "title": "Variational Robust Kalman Filters: A Unified Framework",
    "abstract": "Robustness and adaptivity are two competing objectives in Kalman filters (KF). Robustness involves temporarily inflating prior estimates of noise covariances, while adaptivity updates prior beliefs using real-time information. In practical applications, both process and measurement noise can be influenced by outliers, be time-varying, or both. Existing works may not effectively address the above complex noise scenarios, as there is an intrinsic incompatibility between robust filters and adaptive filters. In this work, we propose a unified variational robust Kalman filter, built on a Student's t-distribution induced loss function and variational inference, and solved through fixed-point iteration in a computationally efficient manner. We demonstrate that robustness can be understood as a prerequisite for adaptivity, making it possible to merge the above two competing goals into a single framework through switching rules. Additionally, our proposed filter can recover conventional KF, robust KF, and adaptive KF by adjusting parameters, and can suppress both the imperfect process and measurement noise, enabling it to perform superiorly in complex noise environments. Simulations verify the effectiveness of the proposed method.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15391v1",
    "categories": [
      "math.LO",
      "cs.LO"
    ],
    "authors": [
      "Sam van Gool"
    ],
    "title": "Uniform Interpolation",
    "abstract": "Uniform interpolation is a strengthening of interpolation that holds for certain propositional logics. The starting point of this chapter is a theorem of A. Pitts, which shows that uniform interpolation holds for intuitionistic propositional logic. We outline how this theorem may be proved semantically via the definability of bisimulation quantifiers, and how it generalizes to an open mapping theorem between Esakia spaces. We also discuss connections between uniform interpolation and research in categorical logic, algebra, and model theory.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15334v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Xiao-Jie Zhu"
    ],
    "title": "Quadratic Gauss sums over $\\mathbb{Z}^n/c\\mathbb{Z}^n$: explicit formulas, a duality theorem, and applications to Weil representations and cubic hypersurfaces over $\\mathbb{F}_p$",
    "abstract": "We provide explicit formulas for quadratic Gauss sums over $\\mathbb{Z}^n/c\\mathbb{Z}^n$, which generalize some of the existing formulas, e.g., Skoruppa and Zagier's (for $n=2$), and Iwaniec and Kowalski's (for arbitrary $n$). We then give four main applications. As the first application, we prove a duality theorem, which relates a sum over a subgroup of $\\mathbb{Z}^n/c\\mathbb{Z}^n$ to another sum over the orthogonal complement. This allows us to give explicit formulas for quadratic Gauss partial sums over certain subgroups. As the second application, we give an explicit formula for the coefficients of Weil representations of $\\mathrm{Mp}_2(\\mathbb{Z})$, which has the advantage, compared to Scheithauer's, Strömberg's, and Boylan and Skoruppa's formulas, that it involves neither local data nor limits of theta series. As the third application, we provide an explicit formula for the number of solutions of an arbitrary quadratic congruence in $n$ variables modulo a prime, as well as an efficient formula modulo a general integer. As the final application, we give a uniform formula for the number of solutions of the Diophantine equation $dxyz=Q(x,y,z)$ over $\\mathbb{F}_p$, where $Q$ is an arbitrary integral quadratic form with some weak restrictions. This generalizes a result of Baragar regarding the Markoff equation. There is also a formula relating Hecke Gauss sums to sums over $\\mathbb{Z}^n/c\\mathbb{Z}^n$, an explicit formula for Hecke Gauss sums over quadratic fields, and an example of computing a Hecke Gauss sum over a cyclotomic field.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15332v1",
    "categories": [
      "math.NA",
      "math-ph"
    ],
    "authors": [
      "Julio Careaga",
      "Qian Huang",
      "Julian Koellermeier"
    ],
    "title": "A moment model of shallow granular flows with variable friction laws",
    "abstract": "In this work, we develop a modelling framework for granular flows based on the shallow water moment equations on inclined planes. Under the assumption of a polynomial expansion of the velocity field, the model extends the classical shallow water equations to vertically variable velocity profiles. The friction effects, which are captured through the strain-rate tensor, are incorporated into the model in two terms, the bulk and bottom friction. We propose a modelling procedure to incorporate general friction laws into our framework and exemplify this combining the Manning, Coulomb, Savage-Hutter, and $μ(I)$-rheology friction models in our modeling framework. Moreover, we develop a path-conservative finite volume numerical scheme based on the polynomial viscosity matrix method to properly handle the stiffness of the source terms. Numerical simulations are presented for different models of friction, including the case of wet-dry fronts.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15320v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Nazerke T. Tleukhanova",
      "Makhpal Manarbek"
    ],
    "title": "Bochkarev's inequalities in the Anisotropic grand Lorentz Spaces",
    "abstract": "The main aim of this paper is to obtain Bochkarev-type inequalities for the anisotropic grand Lorentz spaces. In the classical setting, Bochkarev obtained inequalities of the Hardy--Littlewood type, which reveal the connection between the integral properties of functions and the summability of their Fourier coefficients. His results describe the behavior of trigonometric series in the Lorentz spaces $L_{2,r}$ for $2 < r \\le \\infty$. In this work, we extend these ideas to the framework of anisotropic grand Lorentz spaces. Using an approach based on the extrapolation of linear operators, we derive new Bochkarev-type inequalities that generalize the classical results to the case of anisotropic grand Lorentz spaces and arbitrary orthonormal systems. We investigate the summability properties of the Fourier coefficients of functions from anisotropic grand Lorentz spaces.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15409v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Héctor Ariza",
      "Carmen Fernández",
      "Antonio Galbis"
    ],
    "title": "Composition operators on weighted modulation spaces",
    "abstract": "We study composition operators whose symbols are suitable perturbations of the identity and which act between different weighted modulation classes. We consider both modulation spaces formed by tempered distributions and those whose elements are ultradistributions defined in terms of a subadditive weight.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15407v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Yuchen Ding"
    ],
    "title": "No exact on average additive complements of squares",
    "abstract": "Let $\\mathbb{N}$ be the set of natural numbers and $\\mathcal{S}=\\big\\{1^2, 2^2, 3^2,\\cdots\\big\\}$ the set of squares. Let $\\mathcal{W}$ be an additive complement of $\\mathcal{S}$ and $$ f(n)=\\#\\big\\{(w,m^2)\\in \\mathcal{W}\\times \\mathcal{S}: n=w+m^2\\big\\}. $$ It is proved that there is a positive constant $c_{\\mathcal{W}}$ (depending at most on $\\mathcal{W}$) such that $$ \\sum_{n\\le N}f(n)-N\\ge c_{\\mathcal{W}}N $$ for infinitely many positive integers $N$, which makes some progress on a 1993 conjecture of Cilleruelo. As consequences of the this result, we answer negatively a 2001 problem of Ruzsa as well as a 2017 problem of Ben Green.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15403v1",
    "categories": [
      "math.DG",
      "math.GT"
    ],
    "authors": [
      "Emanuel Milman",
      "Joe Neeman"
    ],
    "title": "On the connectedness of a minimizing cluster's boundary",
    "abstract": "We verify that an isoperimetric minimizing cluster on a simply connected homogeneous Riemannian manifold with at most one end always has connected boundary. In particular, the boundary of a single-bubble isoperimetric minimizer on such manifolds must be connected, and hence all isoperimetric sets and their complements must be connected. This is demonstrably false without the simple connectedness assumption or the restriction on the number of ends.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15399v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Phillip Stephan",
      "Florian Euchner",
      "Stephan ten Brink"
    ],
    "title": "Three-Dimensional Radio Localization: A Channel Charting-Based Approach",
    "abstract": "Channel charting creates a low-dimensional representation of the radio environment in a self-supervised manner using manifold learning. Preserving relative spatial distances in the latent space, channel charting is well suited to support user localization. While prior work on channel charting has mainly focused on two-dimensional scenarios, real-world environments are inherently three-dimensional. In this work, we investigate two distinct three-dimensional indoor localization scenarios using simulated, but realistic ray tracing-based datasets: a factory hall with a three-dimensional spatial distribution of datapoints, and a multistory building where each floor exhibits a two-dimensional datapoint distribution. For the first scenario, we apply the concept of augmented channel charting, which combines classical localization and channel charting, to a three-dimensional setting. For the second scenario, we introduce multistory channel charting, a two-stage approach consisting of floor classification via clustering followed by the training of a dedicated expert neural network for channel charting on each individual floor, thereby enhancing the channel charting performance. In addition, we propose a novel feature engineering method designed to extract sparse features from the beamspace channel state information that are suitable for localization.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15395v1",
    "categories": [
      "math.GT",
      "math.QA"
    ],
    "authors": [
      "Anna Beliakova",
      "Marco De Renzi",
      "Quentin Faes"
    ],
    "title": "Quantum Invariants of Ribbon Surfaces in $4$-Dimensional $2$-Handlebodies",
    "abstract": "We use unimodular ribbon categories to construct quantum invariants of ribbon surfaces in $4$-dimensional $2$-handlebodies up to $1$-isotopy. In the process, we recover invariants due to Bobtcheva-Messia, Broda-Petit, Gainutdinov-Geer-Patureau-Runkel (in collaboration with the second author), and Lee-Yetter. Our approach does not assume semisimplicity, and is based on a generalization of the Reshetikhin-Turaev functor to the category of labeled Kirby graphs which also yields invariants of framed links in the boundary of $4$-dimensional $2$-handlebodies up to $2$-deformations. The setup is very flexible, and allows for several different constructions, using central elements satisfying equations introduced by Hennings and Bobtcheva-Messia, modified traces, and modules over Frobenius algebras satisfying conditions dictated by the diagrammatic calculus for embedded surfaces developed by Hughes, Kim, and Miller.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15389v1",
    "categories": [
      "math.SG",
      "math-ph",
      "math.DG"
    ],
    "authors": [
      "Fraser Aidan Kelvin Sanders"
    ],
    "title": "Contact geometry in infinite dimensions",
    "abstract": "We generalise the theories of cosymplectic, contact, and cocontact manifolds to the infinite-dimensional setting and calculate model examples of time-dependent and dissipative Hamiltonian systems.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15355v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Feihu Liu",
      "Guoce Xin"
    ],
    "title": "MacMahon's $Ω_\\geq$ operator: A computational framework",
    "abstract": "MacMahon introduced partition analysis in his book ``Combinatory Analysis'' as a computational technique for solving problems related to systems of linear Diophantine equations and inequalities. This paper aims to develop a fundamental computational method for MacMahon's partition analysis. As applications, we present simplified computations for ``Han's formula'', the ``$k$-gon partitions problem'', and the ``two-dimensional problem''. Moreover, we apply our method to solve a challenging problem.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15329v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Juliane Krautz"
    ],
    "title": "Weak curvature conditions on metric graphs",
    "abstract": "Starting from pointwise gradient estimates for the heat semigroup, we study three characterizations of weak lower curvature bounds on metric graphs. More precisely, we prove the equivalence between a weak notion of the Bakry-Émery curvature condition, a weak Evolutionary Variational Inequality and a weak form of geodesic convexity. The proof is based on a careful regularization of absolutely continuous curves together with an explicit representation of the Cheeger energy. We conclude with a brief discussion on possible applications to the Schrödinger bridge problem on metric graphs.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15314v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Feiyi Liao",
      "Haochen Liu",
      "Hehu Xie"
    ],
    "title": "Continuous Finite Element Method For Maxwell Eigenvalue Problems With Regular Decomposition Technique",
    "abstract": "With the regular decomposition technique, we decompose the space $\\mathbf{H}_0^s(\\mathbf{curl}; Ω)$ into the sum of a vector potential space and the gradient of a scalar space, both possessing higher regularity. Based on this new high order regular decomposition, a novel numerical method using standard high order Lagrange finite elements is designed for solving Maxwell eigenvalue problems. Specifically, the full convergence orders of the eigenpair approximations are proved for the proposed numerical method. Finally, numerical examples are provided to validate the proposed scheme and confirm the theoretical convergence results.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15575v1",
    "categories": [
      "math.SG",
      "math-ph"
    ],
    "authors": [
      "Luis Crespo",
      "Álvaro Pelayo"
    ],
    "title": "Group actions on $p$-adic symplectic manifolds",
    "abstract": "Let $p$ be a prime number. We introduce symplectic actions of $p$-adic analytic Lie groups on $p$-adic symplectic manifolds. Then we show that any $p$-adic symplectic action $G\\times(M,ω)\\to(M,ω)$ has a momentum map $μ:M\\to\\mathfrak{g}^*$, and that a proper $p$-adic symplectic action is Hamiltonian if and only if every orbit is isotropic. We conclude by defining $p$-adic symplectic toric manifolds, by analogy with the real case.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15535v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Christian Rohde",
      "Florian Wendt"
    ],
    "title": "Effective Equations for a Compressible Liquid-Vapor Flow Model with Highly Oscillating Initial Density",
    "abstract": "We derive and justify a new effective model for a compressible viscous liquid-vapor flow on a spray-like scale, i.e., for settings with a large number of phase boundaries. As a model on the detailed scale, we start from a parabolic relaxation of the Navier-Stokes-Korteweg system. We consider a sequence of initial data where the sequence of initial densities is assumed to be highly oscillating mimicking the high number of phase boundaries initially. Then, we consider a sequence of finite energy weak solutions corresponding to the sequence of initial data. Anticipating that the effective equations are found in the limit of infinitely many initial phase changes, we interpret the densities as Young measures and prove the convergence of the sequence of solutions to the effective model. The effective model consists of a deterministic part for the fluid's hydrodynamic quantities and a kinetic equation for the limit Young measure encoding the mixing dynamics. By characterizing the Young measure with the corresponding cumulative distribution function, we rewrite the kinetic equation for the Young measure into a kinetic equation for the cumulative distribution function such that the resulting equations are accessible by standard approximation methods.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15525v1",
    "categories": [
      "math.DG",
      "math.AP"
    ],
    "authors": [
      "Xiaohan Cai",
      "Xiaodong Wang"
    ],
    "title": "A modified Bakry-Émery $Γ_2$ criterion inequality and the monotonicity of the Tsallis entropy",
    "abstract": "The Bakry-Émery $Γ_2$ criterion inequality provides a method for establishing the logarithmic Sobolev inequality. We prove a one-parameter family of weighted Bakry-Émery $Γ_2$ criterion inequalities which in the limit case yields the improved constant due to Ji \\cite{Ji24}. Furthermore, we establish a modified weighted $Γ_2$ criterion inequality which could be interpreted as a monotonicity of the Tsallis entropy under the heat flow and yields a family of sharp Sobolev inequalities.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15509v1",
    "categories": [
      "math.AT",
      "math.KT"
    ],
    "authors": [
      "Benjamin Antieau"
    ],
    "title": "Filtrations and cohomology III: cohomology of $E_\\infty$ rings",
    "abstract": "We discuss filtrations arising from de Rham-type cohomology theories for $E_\\infty$ rings and $E_n$ rings. Examples include the HKR filtration on relative topological Hochschild homology, the Hodge filtration on $E_\\infty$ infinitesimal cohomology, and the Hodge filtration on $E_\\infty$ de Rham cohomology.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15501v1",
    "categories": [
      "math.NT",
      "math.CO",
      "math.PR"
    ],
    "authors": [
      "Christoph Aistleitner",
      "Zakhar Kabluchko",
      "Joscha Prochno"
    ],
    "title": "Arithmetic sensitivity of cumulant growth in lacunary sums: transcendental versus algebraic ratio limits",
    "abstract": "We study the asymptotic behavior of cumulants of lacunary trigonometric sums $S_n(ω) := \\sum_{k=1}^n \\cos (2 πa_k ω)$, $ω\\in[0,1]$, and show that cumulant growth is highly sensitive to the arithmetic structure of the sequence $(a_k)_{k \\geq 1}$ of positive integers. In particular, if $\\lim_{k \\to \\infty} a_{k+1}/a_k = η> 1$ for some transcendental number $η$, we prove that for every $m\\in \\mathbb N$ the $m$-th cumulant of $S_n$ is asymptotically equivalent to the $m$-th cumulant of the ``independent model'' $\\widetilde{S}_n := \\sum_{k=1}^n \\cos (2 πa_k U_k)$, where $U_1, U_2, \\dots$ are independent random variables having uniform distribution on $[0,1]$. In particular, the order of growth of the cumulants as $n \\to \\infty$ is linear in this case. We also show that the transcendence condition for $\\lim_{k \\to \\infty} a_{k+1}/a_k$ is in general necessary: when the ratio limit $η$ is algebraic, the cumulants of $S_n$ may have a different asymptotic order from those of $\\widetilde{S}_n$. For instance, for $a_k = 2^k+1$ (with $η= 2$), the sixth cumulant of $S_n$ grows quadratically in $n$. In contrast, for $a_k = 2^k$ (again $η= 2$) or when $(a_k)_{k \\geq 1}$ is the Fibonacci sequence (with $η= (1+\\sqrt 5)/2$), the $m$-th cumulant of $S_n$ grows linearly as $n\\to\\infty$, but with a growth rate that differs from the one of the independent model $\\widetilde{S}_n$. Overall, our results show that the asymptotic behavior of the cumulants of lacunary trigonometric sums depends on arithmetic effects in a very delicate way. This is particularly remarkable since many other probabilistic limit theorems, such as the Central Limit Theorem, hold for lacunary trigonometric sums in a universal way without any such sensitivity towards arithmetic effects.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15485v1",
    "categories": [
      "math.CT",
      "math.PR"
    ],
    "authors": [
      "Eigil Fjeldgren Rischel"
    ],
    "title": "The Universal Property of Measure-Theoretic Probability",
    "abstract": "Building on work of Chen, we give a universal property of the Markov category BorelStoch of standard Borel spaces and Markov kernels between them. To do this, we introduce a new notion of *coinflip*, or unbiased binary choice, in a Markov category. These are unique if they exist, and automatically preserved by all Markov functors which preserve coproducts. We also provide universal characterizations of various Markov categories of discrete kernels.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15461v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "János Barát",
      "Andrea Freschi",
      "Géza Tóth"
    ],
    "title": "Matchings avoiding ordered patterns",
    "abstract": "A {\\it vertex-ordered} graph is a graph equipped with a linear ordering of its vertices.\n  A pair of independent edges in an ordered graph can exhibit one of the following three patterns: separated, nested or crossing.\n  We say a pair of independent edges is non-separated if it is either crossing or nested.\n  Non-nested and non-crossing pairs are defined analogously.\n  We are interested in the following Turán-type problems: for each of the aforementioned six patterns, determine the maximum number of edges of an $n$-vertex ordered graph that does not contain a $k$-matching such that every pair of edges exhibit the fixed pattern.\n  Exact answers have already been obtained for four of the six cases.\n  The main objective of this paper is to investigate the two remaining open cases, namely non-separated and non-nested matchings.\n  We determine the exact maximum number of edges of an $n$-vertex ordered graph that does not contain a non-separated $k$-matching, which has the form $\\frac{3}{2}(k-1)n+Θ(k^2)$.\n  For the non-nested case, we show the maximum number of edges lies between $(k-1)n$ and $(k-1)n+\\binom{k-1}{2}$.\n  We also determine the exact maximum number of edges of an $n$-vertex ordered graph that does not contain an alternating path of given length.\n  We discuss some related problems and raise several\n  conjectures.\n  Furthermore, our results and conjectures yield consequences to certain Ramsey-type problems for non-nested matchings and alternating paths.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15709v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Andrés Chirre",
      "Harald Andrés Helfgott"
    ],
    "title": "Optimal bounds for sums of non-negative arithmetic functions",
    "abstract": "Let $A(s) = \\sum_n a_n n^{-s}$ be a Dirichlet series admitting meromorphic continuation to the complex plane. Assume we know the location of the poles of $A(s)$ with $|\\Im s| \\leq T$, and their residues, for some large constant $T$. It is natural to ask how such finite spectral information may be best used to estimate partial sums $\\sum_{n\\leq x} a_n$.\n  Here, we prove a sharp, general result on sums $\\sum_{n\\leq x} a_n n^{-σ}$ for $a_n$ non-negative, giving an optimal way to use information on the poles of $A(s)$ with $|\\Im s|\\leq T$, with no need for zero-free regions. We give not just bounds, but an explicit formula with compact support. Our bounds on $ψ(x)-x$ are, unsurprisingly, better and often simpler than a long list of existing explicit versions of the Prime Number Theorem. We treat the case of $M(x)$ and similar functions in a companion paper.\n  Our solution mixes a Fourier-analytic approach in the style of Wiener--Ikehara with contour-shifting, using optimal approximants of Beurling--Selberg type found in (Graham--Vaaler, 1981).",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15496v1",
    "categories": [
      "math.LO",
      "cs.LO"
    ],
    "authors": [
      "Jim de Groot",
      "João Marcos",
      "Rodrigo Stefanes"
    ],
    "title": "Intrinsic and relative characterization results for logics with negative modalities",
    "abstract": "We introduce simulations for modal logics with subclassical negations and restoration modalities, establish an adequacy theorem, and prove intrinsic (Hennessy-Milner-type) and relative (Van Benthem-type) characterization results. These results identify each restorative language with the fragment of first-order logic invariant under its simulations and delineate the expressive profile of modal logics with non-classical negations.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15682v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Wolfgang Arendt",
      "Daniel Daners",
      "Manfred Sauter"
    ],
    "title": "Variational solutions of the Dirichlet problem, Lebesgue's cusp and non-local properties",
    "abstract": "A recent result from [AtES24] allows one to define variational solutions of the Dirichlet problem for general continuous boundary data. We establish basic properties of this notion of solution and show that it coincides with the Perron solution. Variational solutions can elegantly be characterised in terms of the given boundary function when the variational solution has finite energy. However, it is impossible to decide in terms of the regularity of the given boundary function when a classical solution exists. We demonstrate this by analysing Lebesgue's cusp, and more precisely Lebesgue's domain which is associated with the potential of a thin rod with mass density going to zero at one end. We also show that the non-continuity of the Perron solution at a singular point is a generic and non-local property.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15680v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Matilda Häggblom",
      "Minna Hirvonen",
      "Jouko Väänänen"
    ],
    "title": "Expressibility and inexpressibility in propositional team logics",
    "abstract": "We develop dimension theoretic methods for propositional team based logics. Such quantitative methods were defined for team based first-order logic in a recent paper by Hella, Luosto and the third author and were used to obtain strong hierarchy results in the first-order logic context. We show that in propositional logic and in several important cases, a team theoretical atom can be expressed in terms of atoms of lower arity. We estimate the `price' of such a reduction of arity, i.e. how much more complicated the new expression is. Our estimates involve as parameters the arity of the atoms involved, as well as the number of times the atom occurs in a formula. We also consider new variants of atoms and propositional operations, inspired by our work. We believe that our quantitative analysis leads to a deeper understanding of the scope and limits of propositional team based logic.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15673v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Remco van der Hofstad"
    ],
    "title": "Percolation on random graphs",
    "abstract": "Percolation is a model for random damage to a network. It is one of the simplest models that displays a phase transition: when the network is severely damaged, it falls apart in many small connected components, while if the damage is light, connectivity is hardly affected. We study the location and nature of the phase transition on random graphs. In particular, we focus on the connectivity structure close to, or below, criticality, where components display intricate scaling behaviour such that a typical connected component has bounded size, while the average and maximal connected component sizes grow like powers of the network size.\n  We review the recent progress that has been made in two important settings: random graphs whose expected adjacency matrix is close to being rank-1, the most prominent examples being the configuration model and rank-1 inhomogeneous random graphs, and dynamic random graphs, i.e., random graphs that grow with time, such as uniform and preferential attachment models. Remarkably, these two settings behave rather differently. In all cases, the inhomogeneity of the underlying random graph on which we perform percolation is of crucial importance.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15651v1",
    "categories": [
      "math.GT",
      "math.SG"
    ],
    "authors": [
      "John B. Etnyre"
    ],
    "title": "Neighborhoods of transverse knots and destabilizations",
    "abstract": "In this note we show that transverse knots have unique standard neighborhoods and prove a structure theorem about non-loose Legendrian knots. The common theme of these two results is a general destabilization result for Legendrian knots. As a byproduct of this work, we find a manifold with an infinite number of distinct tight contact structures, up to contactomoprhism, with no Giroux torsion.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15640v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Kimberly Matsuda",
      "Yanlai Chen",
      "Yingda Cheng",
      "Fengyan Li"
    ],
    "title": "Reduced Basis Methods for Parametric Steady-State Radiative Transfer Equation",
    "abstract": "The radiative transfer equation (RTE) is a fundamental mathematical model to describe physical phenomena involving the propagation of radiation and its interactions with the host medium. Deterministic methods can produce accurate solutions without any statistical noise, yet often at a price of expensive computational costs originating from the intrinsic high dimensionality of the model. With this work, we present the first systematic investigation of projection-based reduced order models (ROMs) following the reduced basis method (RBM) framework to simulate the parametric steady-state RTE with isotropic scattering and one energy group. Four ROMs are designed, with each defining a nested family of reduced surrogate solvers of different resolution/fidelity. They are based on either a Galerkin or least-squares Petrov-Galerkin projection and utilize either an $L_1$ or residual-based importance/error indicator. Two of the proposed ROMs are certified in the setting when the absorption cross section is positively bounded below uniformly. One technical focus and contribution lie in the proposed implementation strategies under the affine assumption of the parameter dependence of the model. These well-crafted broadly applicable strategies not only ensure the efficiency and accuracy of the offline training stage and the online prediction of reduced surrogate solvers, they also take into account the conditioning of the reduced systems as well as the stagnation-free residual evaluation for numerical robustness. Computational complexities are derived for both the offline training and online prediction stages of the proposed model order reduction strategies, and they are demonstrated numerically along with the accuracy and robustness of the reduced surrogate solvers. Numerically we observe four to six orders of magnitude speedup of our ROMs compared to full order models for some 2D2v examples.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15629v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Maryna Kachanovska",
      "Adrian Savchuk"
    ],
    "title": "What does it mean for a 3D star-shaped scatterer to be small in the time domain?",
    "abstract": "In the frequency domain wave scattering problems, obstacles can be effectively replaced by point scatterers as soon as the wavelength of the incident wave exceeds significantly their diameter. The situation is less clear in the time domain, where recent works suggest the presence of an additional temporal scale that quantifies the smallness of the obstacle. In this paper we argue that this is not necessarily the case, and that it is possible to construct asymptotic models with an error that does not deteriorate in time, at least in the case of a sound-soft scattering problem by a star-shaped obstacle in 3D.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15625v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Aleksei Kobzev"
    ],
    "title": "Existence of a Non-Uniquely Ergodic Interval Exchange Transformation with Flips Possessing Three Invariant Measures",
    "abstract": "We present the first explicit example of an interval exchange transformation with flips (FIET) possessing three distinct invariant ergodic measures. The proof is based on a generalization of M. Keane's method, using the Rauzy induction adapted for FIETs, which contributes to the study of the ergodic properties of this class of dynamical systems.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15620v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Boris Haspot",
      "Animesh Jana"
    ],
    "title": "Vanishing viscosity limit for $n\\times n$ hyperbolic system of conservation laws in 1-d with nonlinear viscosity: Part-I Uniform BV estimates",
    "abstract": "We consider the following parabolic approximation for hyperbolic system of conservation laws in 1-D with non-singular viscosity matrix $B(u)$ and $A(u)$ strictly hyperbolic, \\[u_t+A(u)u_x = \\varepsilon(B(u)u_x)_x.\\] We prove global in time uniform $BV$ bound for solution to this parabolic system when $\\varepsilon>0$ provided that the initial data is small in $BV$ and the matrix $A(u)$ and $B(u)$ commutate.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15568v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Jiayang Ren",
      "Qiangqiang Mao",
      "Tianwei Zhao",
      "Yankai Cao"
    ],
    "title": "Exact Learning of Linear Model Predictive Control Laws using Oblique Decision Trees with Linear Predictions",
    "abstract": "Model Predictive Control (MPC) is a powerful strategy for constrained multivariable systems but faces computational challenges in real-time deployment due to its online optimization requirements. While explicit MPC and neural network approximations mitigate this burden, they suffer from scalability issues or lack interpretability, limiting their applicability in safety-critical systems. This work introduces a data-driven framework that directly learns the Linear MPC control law from sampled state-action pairs using Oblique Decision Trees with Linear Predictions (ODT-LP), achieving both computational efficiency and interpretability. By leveraging the piecewise affine structure of Linear MPC, we prove that the Linear MPC control law can be replicated by finite-depth ODT-LP models. We develop a gradient-based training algorithm using smooth approximations of tree routing functions to learn this structure from grid-sampled Linear MPC solutions, enabling end-to-end optimization. Input-to-state stability is established under bounded approximation errors, with explicit error decomposition into learning inaccuracies and sampling errors to inform model design. Numerical experiments demonstrate that ODT-LP controllers match MPC's closed-loop performance while reducing online evaluation time by orders of magnitude compared to MPC, explicit MPC, neural network, and random forest counterparts. The transparent tree structure enables formal verification of control logic, bridging the gap between computational efficiency and certifiable reliability for safety-critical systems.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15527v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Claudio Macci",
      "Barbara Pacchiarotti"
    ],
    "title": "Some vector-valued examples of noncentral moderate deviation results",
    "abstract": "The term noncentral moderate deviations is used in the literature to mean a class of large\n  deviation principles that, in some sense, fills the gap between the convergence in probability to a\n  constant (governed by a reference large deviation principle) and a weak convergence to a non-Gaussian\n  (and non-degenerating) distribution. Several examples can be found in the literature, mainly for\n  real-valued random variables (see, e.g.,~\\cite{GiulianoMacci} and the references cited therein). In this\n  paper we present some examples with vector-valued random variables.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15516v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Maria Axenovich",
      "Dingyuan Liu",
      "Arsenii Sagdeev"
    ],
    "title": "Ramsey problems for graphs in Euclidean spaces and Cartesian powers",
    "abstract": "Given a graph $H$, let $χ_H(\\mathbb{R}^n)$ be the smallest positive integer $r$ such that there exists an $r$-coloring of $\\mathbb{R}^n$ with no monochromatic unit-copy of $H$, that is a set of $|V(H)|$ vertices of the same color such that any two vertices corresponding to an edge of $H$ are at distance one.\n  This Ramsey-type function extends the famous Hadwiger--Nelson problem on the chromatic number $χ(\\mathbb{R}^n)=χ_{K_2}(\\mathbb{R}^n)$ of the space from a complete graph $K_2$ on two vertices to an arbitrary graph $H$. It also extends the classical Euclidean Ramsey problem for congruent monochromatic subsets to the family of those defined by a specific subset of unit distances.\n  Among others, we show that $χ_H(\\mathbb{R}^n)=χ(\\mathbb{R}^n)$ for any even cycle $H$ of length $8$ or at least $12$ as well as for any forest and that $χ_H(\\mathbb{R}^n)=\\lceilχ(\\mathbb{R}^n)/2\\rceil$ for any sufficiently long odd cycle. Our main tools and results, which are of independent interest, establish that Cartesian powers enjoy Ramsey-type properties for graphs with favorable Turán-type characteristics, such as zero hypercube Turán density.\n  In addition, we prove induced variants of these results, find bounds on $χ_H(\\mathbb{R}^n)$ for growing dimensions $n$, and prove a canonical-type result. We conclude with many open problems. One of these is to determine $χ_{C_4}(\\mathbb{R}^2)$, for a cycle $C_4$ on four vertices.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15511v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Gabriel Cunningham",
      "Yan-Quan Feng",
      "Dong-Dong Hou",
      "Egon Schulte"
    ],
    "title": "Symmetric polytopes whose automorphism groups are 2-groups",
    "abstract": "The present work investigates regular, semiregular, and chiral polytopes of any rank $d\\geq 3$, whose automorphism groups are 2-groups. There is a large variety of rather small finite regular or alternating semiregular polytopes with automorphism groups of 2-power order: for such polytopes with toroidal sections of rank 3, the various sections of rank 3 can be entirely prescribed (possibly with one exception in the semiregular case). It is also shown that having a 2-group as automorphism group is hereditary under taking universal extensions: the universal extension of a given regular, chiral, or alternating semiregular polytope with a finite or infinite 2-group as automorphism group, is a polytope of one rank higher with an infinite 2-group an automorphism group.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15504v1",
    "categories": [
      "math.SP",
      "math-ph",
      "math.DS"
    ],
    "authors": [
      "Kai Hippi"
    ],
    "title": "Quantum Mixing and Benjamini-Schramm Convergence of Hyperbolic Surfaces",
    "abstract": "We study compact hyperbolic surfaces and multiplicative observables, establishing a large-scale analogue of Zelditch's quantum mixing theorem with hypotheses that hold for both arithmetic and Weil-Petersson random surfaces of large genus. This complements the large-scale quantum ergodicity theorems of Le Masson and Sahlsten, which themselves serve as large-scale analogues of the quantum ergodicity theorem of Shnirelman, Zelditch, and de Verdiere, thereby providing a more complete picture of the asymptotic behaviour of observables in the large-scale limit. Our approach does not rely on ball averaging operators or Nevo's ergodic theorem. Instead, we introduce a new method based on the hyperbolic wave equation and the quantitative exponential mixing of the geodesic flow established by Ratner and Matheus.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15494v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Vadim Alekseev",
      "Andreas Thom"
    ],
    "title": "Remarks on approximability and stability for groups",
    "abstract": "In this paper, we provide several instances in which interesting approximation and stability properties are inherited by quotients with respect to finitely generated normal subgroups or, more strongly, normal subgroups with Kazhdan's property (T). Applications arise when these observations are combined with variations of the Rips construction due to Wise and Belegradek--Osin.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15425v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Peng Yuan",
      "Zulin Wang",
      "Tao Luo",
      "Yuanhan Ni"
    ],
    "title": "An Anti-Interference AFDM System: Interference Impacts Analyses and Parameter Optimization",
    "abstract": "This paper proposes an anti-interference affine frequency division multiplexing (AFDM) system to ensure reliability and resource efficiency under malicious high-power interference originating from adversarial devices in high-mobility scenarios. Closed-form expressions of interferences in the discrete affine Fourier transform (DAFT) domain are derived by utilizing the stationary phase principle and the Affine Fourier transform convolution theorem, which indicates that interference impacts can be classified into stationary and non-stationary categories. On this basis, we reveal the analytical relationship between packet throughput and the paramerters of spread spectrum and error correction coding in our proposed anti-interference system, which enables the design of a parameter optimization algorithm that maximizes packet throughput. For reception, by jointly utilizing the autocorrelation function of spreading sequence and the cyclic-shift property of AFDM input-output relation, we design a linear-complexity correlation-based DAFT domain detector (CDD) capable of achieving full diversity gain, which performs correlation-based equalization to avoid matrix inversion. Numerical results validate the accuracy of the derived closed-form expressions and verify that the proposed anti-interference AFDM system could achieve high packet throughput under interference in high-mobility scenarios.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15416v1",
    "categories": [
      "math.SP",
      "math.DG"
    ],
    "authors": [
      "Jade Brisson",
      "Bruno Colbois",
      "Alexandre Girouard",
      "Katie Gittins"
    ],
    "title": "Upper bounds for the Steklov eigenvalues of warped products",
    "abstract": "We obtain upper bounds for the Steklov eigenvalues of warped products $Ω\\times_hΣ$, where $Ω$ is a compact Riemannian manifold with boundary and $Σ$ is a closed Riemannian manifold. These bounds involve the volume of $Ω$ and of $\\partialΩ$ as well as the eigenvalues of the Laplace operator on the fiber $Σ$ and the $L^p$-norm of the warping function $h$. The bounds are very different depending on the dimension $n$ of the fiber $Σ$ and the value of $p$. In some cases, we obtain optimal upper bounds and stability estimates.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15381v1",
    "categories": [
      "math.OC",
      "math.DS"
    ],
    "authors": [
      "Mohammad Mahmoudi Filabadi",
      "Guillaume Crevecoeur",
      "Tom Lefebvre"
    ],
    "title": "Gaussian Process Dual MPC using Active Inference: An Autonomous Vehicle Usecase",
    "abstract": "Designing controllers under uncertainty requires balancing the need to explore system dynamics with the requirement to maintain reliable control performance. Dual control addresses this challenge by selecting actions that both regulate the system and actively gather informative data. This paper investigates the use of the Active Inference framework, grounded in the Free Energy Principle, for developing a dual model-predictive controller (MPC). To identify and quantify uncertainty, we introduce an online sparse semi-parametric Gaussian Process model that combines the flexibility of nonparametric with the efficiency of parametric learning for real-time updates. By applying the expected free energy functional to this adaptive probabilistic model, we derive an MPC objective that incorporates an information-theoretic term, which captures uncertainty arising from both the learned model and measurement noise. This formulation leads to a stochastic optimal control problem for dual controller design, which is solved using a novel dynamic-programming-based method. Simulation results on a vehicle use case demonstrate that the proposed algorithm enhances autonomous driving control performance across different settings and scenarios.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15350v1",
    "categories": [
      "math.DG",
      "math.AP"
    ],
    "authors": [
      "Hanzhang Yin"
    ],
    "title": "Fully non-linear elliptic equations on noncompact complex manifolds",
    "abstract": "In this paper, we obtain the a priori estimates and the existence results for solutions of a general class of fully non-linear equations on noncompact Kähler and Hermitian manifolds. As geometric applications, we can construct Kähler metrics with some prescribed volume forms on strictly pseudoconvex domains; and we can construct complete Chern-Einstein metrics on Hermitian manifolds with bounded geometry.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15324v1",
    "categories": [
      "math.AG",
      "math.AT",
      "math.GR",
      "math.KT"
    ],
    "authors": [
      "Amit Hogadi",
      "Anand Sawant"
    ],
    "title": "Transfers on $\\mathbb A^1$-connected components of quasi-split groups and the norm principle",
    "abstract": "We show that the sheaf of $\\mathbb A^1$-connected components of a quasi-split group over a perfect field is a strictly $\\mathbb A^1$-invariant sheaf with (Voevodsky) transfers. As a consequence, we show that the norm principle holds for any quasi-split group over a perfect field.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15322v1",
    "categories": [
      "math.QA",
      "math.RT"
    ],
    "authors": [
      "Ming Lu",
      "Zhuoyi Zhao"
    ],
    "title": "Quantum symmetric pairs via Hall algebras",
    "abstract": "A quantum symmetric pair consists of a quantum group $\\widetilde{\\mathbf{U}}$ and its coideal subalgebra $\\widetilde{\\mathbf{U}}^\\imath$. The Hall algebra constructions of $\\widetilde{\\mathbf{U}}$ and $\\widetilde{\\mathbf{U}}^\\imath$ are given by Bridgeland and Lu--Wang, respectively. In this paper, we construct a Hall algebra framework for the coideal subalgebra structure of $\\widetilde{\\mathbf{U}}^\\imath$ in $\\widetilde{\\mathbf{U}}$, and for the quantum symmetric pair $(\\widetilde{\\mathbf{U}},\\widetilde{\\mathbf{U}}^\\imath)$. As an application, we prove that the natural embedding $\\imath:\\widetilde{\\mathbf{U}}^\\imath\\to \\widetilde{\\mathbf{U}}$, and the coproduct $Δ:\\widetilde{\\mathbf{U}}^\\imath\\to \\widetilde{\\mathbf{U}}^\\imath\\otimes \\widetilde{\\mathbf{U}}$ preserve the integral forms of $\\widetilde{\\mathbf{U}}^\\imath$ and $\\widetilde{\\mathbf{U}}$, which are used to construct the dual canonical bases.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15318v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Jan Schwientek",
      "Katrin Teichert",
      "Jan Schröder",
      "Johannes Höller",
      "Patrick Schwartz",
      "Norbert Asprion",
      "Pascal Schäfer",
      "Martin Wlotzka",
      "Michael Bortz"
    ],
    "title": "On Computing and Pricing of Adjustable Robust Chemical Process Designs",
    "abstract": "Model-based process simulation can be used to derive designs and operating conditions of chemical processes that optimally balance multiple objectives, such as quality, costs, or environmental impacts. This work focuses on identifying designs that hedge against uncertainties in model parameters to ensure feasibility, taking the possibility to adjust operating conditions into account. An adaptive scheme is proposed to pinpoint the relevant scenarios in a discretized uncertainty space; these scenarios are then fed into a multi-objective adjustable robust optimization framework reducing the computational burden compared to the consideration of all potential scenarios. Furthermore, we propose a method to quantify the cost or price of robustness, i.e., the compromise which has to be made in comparison to the nominal design case in order to hedge against uncertainty. The conceptual findings are illustrated with an industrially relevant case study.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15305v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Laurent Navoret",
      "Roxana Sublet",
      "Marcela Szopos"
    ],
    "title": "From flocking to jamming in collective cell dynamics: a Vicsek-like model including contact forces",
    "abstract": "The goal of the present work is to propose an agent-based model that originally combines classical Vicsek-like polarity alignments and contact forces, as implemented in the framework developed by Maury and Venel in [Maury, Venel, 2011]. The description additionally incorporates velocity feedback on polarity and soft attraction-repulsion interactions. After carefully studying the well posedness of the model, we introduce a suitable discretization and perform an extensive range of numerical experiments to assess the impact of different modeling ingredients. The dynamical system is capable of recovering the order-disorder phase transition of the flock, as well as the jamming effect in high density regimes. As such, the developed framework can be seen as a promising theoretical tool that could contribute to improving the understanding of complex collective cell dynamics and emerging tissue flows.",
    "date": "12-18"
  },
  {
    "link": "https://arxiv.org/pdf/2512.15299v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Mathis Fitoussi",
      "Elena Issoglio",
      "Stéphane Menozzi"
    ],
    "title": "Weak Error on the densities for the Euler scheme of stable additive SDEs with Besov drift",
    "abstract": "We are interested in the Euler-Maruyama dicretization of the formal SDE, $dX_t=b(t,X_t)dt+dZ_t$, where $Z$ is a symmetric isotropic d dimensional stable process of index $α\\in (1,2)$, and $b$ is distributional. It belongs to a mix Lebesgue-Besov space. The associated parameters satisfy some constraints which guarantee weak-well posedness. Defining an appropriate Euler scheme, we obtain a convergence rate for the weak error on the densities. The rate depends on the parameters.",
    "date": "12-18"
  }
]