[
  {
    "link": "https://arxiv.org/pdf/2511.15696v1",
    "categories": ["math.DS", "math.CA", "math.NT"],
    "authors": ["Zuo Lin"],
    "title": "Polynomially effective equidistribution for certain unipotent subgroups in quotients of semisimple Lie groups",
    "abstract": "We prove an effective equidistribution theorem for orbits of certain unipotent subgroups in arithmetic quotients of semisimple Lie groups with a polynomial error term. This provides the first infinite family of examples where effective equidistribution, with polynomial error rate, of non-horospherical unipotent subgroups in semisimple quotients is obtained.\n  As applications, we obtain effective estimate on distribution of lattice orbits on homogeneous spaces, as well as an effective version of the Oppenheim conjecture for indefinite quadratic forms with a polynomial error rate in all dimension $d \\geq 3$. We also prove a sub-modularity inequality for irreducible representation of connected algebraic group, which is crucial to our proof and is of independent interest.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15089v1",
    "categories": ["math.PR"],
    "authors": ["Partha S. Dey", "S. Rasoul Etesami", "Aditya S. Gopalan"],
    "title": "Scaling Limit of a Stochastic Clustering Model on $\\mathbb{R}$",
    "abstract": "We consider an infinite-dimensional stochastic clustering model on $\\mathbb{R}$. In discrete time, each point of a unit-intensity simple point process moves halfway toward either of its left or right neighbors, chosen uniformly at random. Co-located points are merged into a single point, and the resulting simple point process is rescaled to unit intensity. We show that, when the point processes are shifted so that there is a point at the origin, there is a unique weak limit of these dynamics when the initial point process is renewal. We also conjecture that for the time-reversed process and with an appropriate scaling in space, there is a limiting (random) distribution function on $\\mathbb{R}$, whose corresponding measure assigns to $\\mathbb{R}$ a measure corresponding to the gap between consecutive points. Finally, we discuss some relevant research directions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15539v1",
    "categories": ["math.QA", "math-ph", "math.OA"],
    "authors": ["Deeponjit Bose", "Andrzej Sitarz"],
    "title": "Asymmetric noncommutative torus has vanishing Einstein tensor",
    "abstract": "We explicitly compute the spectral metric, torsion and Einstein tensors for a nontrivial spectral triple on a noncommutative torus, with the Dirac operator related to the fully equivariant Dirac by a partial conformal rescaling (as introduced in [1]). The results show that the spectral triple has vanishing torsion and the Einstein tensor also identically vanishes.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14942v1",
    "categories": ["math.CV"],
    "authors": ["Ilia Binder", "Adi Glücksam"],
    "title": "Analysis of Boundary Behaviour of Quasidisks and Jordan Repellers",
    "abstract": "We investigate the fine properties of harmonic measure and boundary rotation. By focusing on quasidisks and, in particular, on connected Jordan Repellers arising from conformal expanding dynamical systems, we explore those using the deep interplay between geometric function theory and dynamical systems as a unified framework.\n  While some of the results presented here are regarded as 'folklore' among experts, they lack rigorous proofs in the existing literature. We fill this gap by providing a comprehensive, referable treatment using a novel approach that also expands existing results.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14931v1",
    "categories": ["math.DS", "math-ph"],
    "authors": ["Kumar Utkarsh", "Daniel M. Abrams"],
    "title": "Information Criteria Fail for Dynamical Systems: Sampling Rate and Dimension Dependence",
    "abstract": "Information criteria such as Akaike's (AIC) and Bayes' (BIC) are widely used for model selection in physics and beyond, quantifying the tradeoff between model complexity and goodness-of-fit to enforce parsimony. However, their derivation assumes uncorrelated samples, an assumption systematically violated by dynamical systems data. Here, through analysis of simple but representative dynamical models -- exponential decay, harmonic oscillation, and chaos -- we demonstrate that model selection depends sensitively on sampling rate and system dimensionality. We derive explicit formulas predicting when standard information criteria fail that should be adaptable to many real-world scenarios, enabling experimentalists to design sampling protocols that avoid pathological regimes.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15277v1",
    "categories": ["math.GR"],
    "authors": [
      "Jorge Fariña-Asategui",
      "Paul-Henry Leemann",
      "Tatiana Nagnibeda"
    ],
    "title": "Non-closed subgroups of weakly branch groups",
    "abstract": "For a weakly branch group $G$ acting on a regular enough rooted tree, we provide two constructions of continuous families of distinct subgroups that are not closed in the profinite topology on $G$. On the one hand, we construct a continuous family of distinct non-closed subgroups such that each $H$ in the family is not ERF, that is, contains subgroups not closed in the profinite topology on $H$. On the other hand, under an additional assumption on $G$, we construct a continuous family of ERF subgroups which are not closed in the congruence (and in the profinite) topology on $G$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15604v1",
    "categories": ["math.RT", "math.QA"],
    "authors": ["Mark Ebert", "Raphael Rouquier"],
    "title": "Higher Tensor Product for sl2 and Webster algebras",
    "abstract": "We construct a model for the tensor product of the regular 2-representation of the enveloping algebra of $\\mathfrak{sl}_2^+$ with the vector 2-representation, based on the $\\infty$-categorical definition of the second author. Our model contains McMillan's minimal one. Our use of an infinite family of generators provides a simpler model that we prove is equivalent to Webster's tensor product category.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15431v1",
    "categories": ["math.CO"],
    "authors": ["Yongtao Li", "Hong Liu", "Shengtong Zhang"],
    "title": "Edge-spectral Turán theorems for color-critical graphs with applications",
    "abstract": "A classical result of Nosal asserts that every $m$-edge graph with spectral radius $λ(G)> \\sqrt{m}$ contains a triangle. A celebrated extension of Nikiforov [35] states that if $G$ is an $m$-edge graph with $λ(G)> \\sqrt{(1- {1}/{r})2m}$, then $G$ contains a clique $K_{r+1}$. This result implies the Turán theorem and Wilf theorem, and offers a new perspective on the existence of substructures. The edge-spectral conditions are versatile for enforcing substructures, as they can be applied to any sparse graph regardless of its edge density. In this paper, we prove that for any color-critical graph $F$ with chromatic number $χ(F)=r+1\\ge 4$, if $m$ is sufficiently large and $G$ is an $F$-free graph with $m$ edges, then $λ(G)\\le \\sqrt{(1- {1}/{r})2m}$, with equality if and only if $G$ is a regular complete $r$-partite graph. This settles an open problem proposed by Yu and Li [52] and also gives spectral bounds for graphs forbidding books and wheels.\n  Secondly, we establish an asymptotic formula and structural characterization when we forbid an almost-bipartite graph $F$, where $F$ is called almost-bipartite if it can be made bipartite by removing at most one edge. As applications, we determine the unique $m$-edge spectral extremal graph for every integer $m$ when avoiding certain substructures, including complete bipartite graphs plus an edge, cycles plus an edge, and theta graphs, etc. Our results resolve an open problem proposed by Li, Zhao and Zou [24], as well as two conjectures posed by Liu and Li [31]. The arguments in our proofs are based on the edge-spectral stability method recently established by the authors. In addition, we develop some new spectral techniques, including the stability result for the Perron--Frobenius eigenvector.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14849v1",
    "categories": ["cs.IT"],
    "authors": ["Adeel Mahmood", "Aaron B. Wagner"],
    "title": "Channel Coding for Gaussian Channels with Multifaceted Power Constraints",
    "abstract": "Motivated by refined asymptotic results based on the normal approximation, we study how higher-order coding performance depends on the mean power $Γ$ as well as on finer statistics of the input power. We introduce a multifaceted power model in which the expectation of an arbitrary number of arbitrary functions of the normalized average power is constrained. The framework generalizes existing models, recovering the standard maximal and expected power constraints and the recent mean and variance constraint as special cases. Under certain growth and continuity assumptions on the functions, our main theorem gives an exact characterization of the minimum average error probability for Gaussian channels as a function of the first- and second-order coding rates. The converse proof reduces the code design problem to minimization over a compact (under the Prokhorov metric) set of probability distributions, characterizes the extreme points of this set and invokes the Bauer's maximization principle.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14828v1",
    "categories": ["math.HO"],
    "authors": ["Frances Herr"],
    "title": "Curve Stitching and Dancing Planets",
    "abstract": "Curve stitching is a classic educational activity where one constructs elegant curves from a family of straight lines. We perform curve stitching around a circle to make a modular stitch graph. Take $m$ points equally spaced around a circle, choose an integer multiplier $a$, and draw a chord from point $p$ to $a p \\mod m$. What design will appear as the envelope of these chords? We connect these discrete objects to a continuous-time dynamical system and apply a topological perspective to understand the answer to this question.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14804v1",
    "categories": ["math.HO", "math.DS"],
    "authors": ["Umberto Michelucci"],
    "title": "Hausdorff Measure and Dimension with Examples",
    "abstract": "This document offers a concise introduction to the mathematical theory and practical application of the Hausdorff Measure and Dimension. The primary objective is to clarify and rigorously detail the two most common methods used for calculating the dimension of a set, ensuring all calculation details are transparent for the reader.\n  The paper first establishes the theoretical groundwork by reviewing the definitions of the Hausdorff measure, proving the dimensional invariance under changes to the shape of the covering sets, and confirming the dimensional property of open sets. It then introduces the two main methodologies.\n  The first is the Lower and Upper Bound Estimation, which uses the relationship between the measure $H^s(A)$ and the dimension $\\dim_{H}(A)$. This method emphasizes the use of the Mass Distribution Principle for establishing the lower bound, which is essential when the Lebesgue measure of the set is zero. The second, more computationally efficient method is the Similarity Dimension Method, introduced via the definitions of Similitudes, Iterated Function Systems (IFS), and the Moran-Hutchinson Theorem.\n  Both methodologies are applied rigorously to classic examples: the Unit Square (yielding dimension $2$) and the Cantor Set (yielding the fractional dimension $\\log 2 / \\log 3$). The paper serves as a detailed, step-by-step guide intended to make the application of these fundamental fractal geometry concepts clearer and easier to understand.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15344v1",
    "categories": ["math.RT", "math.CO"],
    "authors": ["Stefan Dawydiak"],
    "title": "A positivity property in the based ring of the lowest two-sided cell",
    "abstract": "Let $W_{\\mathrm{aff}}$ be an extended affine Weyl group and $\\mathbf{H}$ and $J$ be the corresponding affine and asymptotic Hecke algebras with standard bases $\\{T_x\\}$ and $\\{t_w\\}$, respectively. Viewing $J$ as a subalgebra of the $\\mathbf{q}^{-\\frac{1}{2}}$-adic completion of $\\mathbf{H}$, we give formulas for the coefficient of $T_x$ in $t_w$ for various $x$ and $w$ in the lowest two-sided cell, in terms of generalized exponents of the Langlands dual group, under a hypothesis on the left cell containing $w$. In particular our results hold for the canonical left cell. For such $w$ we also define a seemingly new positive basis for the corresponding subring of $J$. For $\\mathrm{GL}_n$, we give partial results for some other cells.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15335v1",
    "categories": ["math.DS"],
    "authors": ["Zijie Lin", "Kangbo Ouyang"],
    "title": "Minimal PI-systems with all points are multiply minimal",
    "abstract": "We construct a minimal subshift \\((X^{*},σ)\\) that serves as an open proximal extension of its maximal equicontinuous factor. We establish that every point in this subshift is multiply recurrent minimal. This work solves an open problem raised by Huang, Shao and Ye regarding the existence of minimal PI-systems such that each point is multiply minimal.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15329v1",
    "categories": ["math.HO"],
    "authors": ["Kamel Ibn Aziz Derouiche Jihbed"],
    "title": "Zygmunt Janiszewski Mathematical Publications During His Engagement in Poland Struggle for National Independence in World War I",
    "abstract": "This article focuses on the mathematical publications of Zygmunt Janiszewski (1888-1920), a major figure in Polish science at the beginning of the twentieth century. Serving in the Polish Legion between 1914 and 1920 in the struggle for national independence, Janiszewski was not only one of the founders of the Polish School of Mathematics, but also the initiator of the creation of Fundamenta Mathematicae, the world's first specialized scientific journal devoted exclusively to pure mathematics.\nThe aim of this study is to reconstruct, as far as the available sources allow, the circumstances and conditions under which Janiszewski published his mathematical works. Through this analysis, we highlight the significance of his research in the broader process of structuring and consolidating the modern Polish mathematical community.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15305v1",
    "categories": ["math.CV", "math.FA"],
    "authors": ["Michel Crouzeix"],
    "title": "Inner functions and Pick-Nevanlinna interpolation in a multi-connected domain",
    "abstract": "We describe the set of inner functions of finite order in a multi-connected domain, then we consider an optimization formulation of the Pick-Nevanlinna interpolation problem, and we generalize it to Hermite type interpolation.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15289v1",
    "categories": ["math.AP"],
    "authors": [
      "Daniele Bartolucci",
      "Aleks Jevnikar",
      "Juncheng Wei",
      "Ruijun Wu"
    ],
    "title": "The Rabinowitz continuum of subcritical Gelfand problems and free boundary-type equations arising in plasma physics",
    "abstract": "The qualitative behavior of the Rabinowitz unbounded continuum of subcritical Gelfand problems is well known on balls in any dimension. We don't know of any such sharp and detailed description otherwise, which is our motivation to look for a new approach to the problem. The underlying idea is to describe solutions of Gelfand problems via suitably defined constrained problems of free boundary-type arising in plasma physics and to replace the usual $L^\\infty$ norm of the solution with the energy of the plasma. Toward this goal, we first solve a long standing open problem of independent interest about the uniqueness of solutions of Grad-Shafranov type equations. Thus, we exploit these unique solutions to detect a curve containing both minimal and non minimal solutions of the associated Gelfand problem. In other words we come up with a new global parametrization of the Rabinowitz continuum, the monotonicity of the energy along the branch providing a meaningful generalization of the classical pointwise monotonicity property of minimal solutions, suitable to describe non minimal solutions as well. On a ball in any dimension, we come up as expected with a bell-shaped profile of the full branch of solutions of the Gelfand problem.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15263v1",
    "categories": ["math.PR", "math.AP"],
    "authors": ["Zhengyan Wu"],
    "title": "Fluctuating Hydrodynamics of the Ising-Kac-Kawasaki Model and Nonlinear Fluctuations Near Criticality",
    "abstract": "We study the scaling limit behavior of a family of conservative SPDEs as the fluctuating Ising-Kac-Kawasaki dynamics. Precisely, we show that there exists a sequence of the one-dimensional rescaled fluctuating Ising-Kac-Kawasaki equation converges to the solution of the stochastic Cahn-Hilliard equation. This solves a simple version of the conjecture concerning the nonlinear fluctuation phenomenon, proposed by [Giacomin, Lebowitz, Presutti; Math. Surveys Monogr., 1999]. Furthermore, we prove a multi-scale dynamical large deviations in a small noise regime. Finally, we show the $Γ$-convergence of the rate function for the rescaled fluctuating Ising-Kac-Kawasaki equation to the rate function of the Cahn-Hilliard equation.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15226v1",
    "categories": ["math.CO"],
    "authors": ["Sirui Chen", "Jiaao Li", "Zhouningxin Wang"],
    "title": "Frustration indices of signed subcubic graphs",
    "abstract": "The frustration index of a signed graph is defined as the minimum number of negative edges among all switching-equivalent signatures. This can be regarded as a generalization of the classical \\textsc{Max-Cut} problem in graphs, as the \\textsc{Max-Cut} problem is equivalent to determining the frustration index of signed graphs with all edges being negative signs. In this paper, we prove that the frustration index of an $n$-vertex signed connected simple subcubic graph, other than $(K_4, -)$, is at most $\\frac{3n + 2}{8}$, and we characterize the family of signed graphs for which this bound is attained. This bound can be further improved to $\\frac{n}{3}$ for signed $2$-edge-connected simple subcubic graphs, with the exceptional signed graphs being characterized. As a corollary, every signed $2$-edge-connected simple cubic graph on at least $10$ vertices and with $m$ edges has its frustration index at most $\\frac{2}{9}m$, where the upper bound is tight as it is achieved by an infinite family of signed cubic graphs.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15223v1",
    "categories": ["math.PR"],
    "authors": ["Wei Hong", "Shihu Li", "Wei Liu"],
    "title": "Stochastic Forced 3D Navier-Stokes Equations in $\\mathbb{H}^{1/2}$-Space",
    "abstract": "In the classical work [FK], Fujita and Kato established the local existence of solutions to the 3D Navier-Stokes equations in the critical $\\mathbb{H}^{1/2}$-space. In this paper, we are concerned with the global well-posedness of the stochastic forced 3D Navier-Stokes equations in the $\\mathbb{H}^{1/2}$-space under general initial conditions, where the stochastic forcing comprises a transport forcing and a nonlocal turbulent forcing. In this setting, the random noise is shown to provide a regularization effect on the energy estimates, which we obtain by constructing suitable Lyapunov functions. However, its nonlocality also brings analytical challenges. We develop a bootstrap type estimate based on the kinematic viscosity together with a delicate stopping time argument to prove the global existence and uniqueness of solutions, as well as continuous dependence on the initial value. Furthermore, we also investigated the long-time behavior of the stochastic forced 3D Navier-Stokes equations.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15220v1",
    "categories": ["math.DS"],
    "authors": ["Pierre-Antoine Guihéneuf"],
    "title": "Surface homeomorphisms with big rotation set",
    "abstract": "This article consists in applications of [arXiv:2511.14232] in the case of homemomorphisms of higher genus surfaces whose homological rotation set is big enough -- a class of dynamics that is open. We first prove a structure theorem for the rotation set of such homeomorphisms: it is a finite union of convex sets, we get an optimal bound for the number of such pieces. This bound can be improved in the case of transitive (in this case the rotation set is convex) and non-wandering dynamics (and for such homeomorphisms we get the existence of a family of invariant essential open sets). We also get boundedness of deviations for homeomorphisms with big rotation set and some consequences of it, including a answer to Boyland's conjecture in our framework.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15207v1",
    "categories": ["cs.IT"],
    "authors": [
      "Chaofeng Guan",
      "Gaojun Luo",
      "Lan Luo",
      "Yangyang Fei",
      "Hong Wang"
    ],
    "title": "Generalized Repetition Codes and Their Application to HARQ",
    "abstract": "The inherent uncertainty of communication channels implies that any coding scheme has a non-zero probability of failing to correct errors, making retransmission mechanisms essential. To ensure message reliability and integrity, a dual-layer redundancy framework is typically employed: error correction codes mitigate noise-induced impairments at the physical layer, while cyclic redundancy checks verify message integrity after decoding. Retransmission is initiated if verification fails. This operational model can be categorized into two types of repeated communication models: Type-I systems repeatedly transmit identical codewords, whereas Type-II systems transmit distinct coded representations of the same message. The core challenge lies in maximizing the probability of correct message decoding within a limited number of transmission rounds through verification-based feedback mechanisms.\n  In this paper, we consider a scenario where the same error-correcting code is used for repeated transmissions, and we specifically propose two classes of generalized repetition codes (GRCs), corresponding to the two repeated communication models. In contrast to classical theory, we regard GRCs as error-correcting codes under multiple metrics--that is, GRCs possess multiple minimum distances. This design enables GRCs to perform multi-round error correction under different metrics, achieving stronger error-correction capabilities than classical error-correcting codes. However, the special structure of GRCs makes their construction more challenging, as it requires simultaneously optimizing multiple minimum distances. To address this, we separately investigate the bounds and constructions for Type-I and Type-II GRCs, and obtain numerous optimal Type-I and Type-II GRCs.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15205v1",
    "categories": ["math.CO"],
    "authors": ["Lixiang Chen", "Yongtang Shi", "Liwen Zhang"],
    "title": "The first Steklov eigenvalue bound for graphs of positive genus",
    "abstract": "Let $G$ be a graph of genus $g$ with boundary $δΩ$. For $g=0$, Lin and Zhao [J. Lond. Math. Soc. 112 (2025), Paper No. e70238] proved an upper bound for the first (non-trivial) Steklov eigenvalue of $(G, δΩ)$, and they posed the problem of determining a corresponding bound for graphs of genus $g>0$. In this paper, we prove an $O\\left(\\frac{g}{|δΩ|}\\right)$ bound for a bounded-degree graph of positive genus $g$. Our result can be regarded as a discrete analogue of Kokarev's bound [Adv. Math. 258 (2014), 191-239], up to a constant factor.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15166v1",
    "categories": ["math.AP"],
    "authors": ["Jie Guo", "Quansen Jiu"],
    "title": "Finite time blow-up analysis for the generalized Proudman-Johnson model",
    "abstract": "In this paper, we study the generalized Proudman-Johnson equation posed on the torus. In the critical regime where the parameter $a$ is close to and slightly greater than 1, we establish finite time blow-up of smooth solutions to the inviscid case. Moreover, we show that the blow-up is asymptotically self-similar for a class of smooth initial data. In contrast, when the parameter $a$ lies slightly below 1, we prove the global in time existence for the same initial data. In addition, we demonstrate that inviscid Proudman-Johnson equation with Hölder continuous data also develops a self-similar blow-up. Finally, for the viscous case with $a>1$, we prove that smooth initial data can still lead to finite time blow-up.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15128v1",
    "categories": ["math.CA", "math.FA", "math.NT"],
    "authors": ["Zhiqiang Wang"],
    "title": "On infinite scalings of the canonical spectrum for self-similar spectral measures",
    "abstract": "Let $(μ, Λ)$ be the canonical spectral pair generated by a Hadamard triple $(N,B,L)$ in $\\mathbb{R}$ with $0\\in B \\cap L$, which means that the family $\\big\\{ e_λ(x)=e^{2π\\mathrm{i} λx}: λ\\in Λ\\big\\}$ forms an orthonormal basis in $L^2(μ)$.We prove that if $\\#B < N^{0.677}$, then there are infinitely many primes $p$ such that $(μ, pΛ)$ is also a spectral pair. Under Artin's primitive root conjecture or the Elliott-Halberstam conjecture, the same conclusion holds for $\\# B < N$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15063v1",
    "categories": ["math.GR", "math.GT"],
    "authors": ["Donggyun Seo"],
    "title": "Dynamics of Dehn Twists in the Outer Automorphism Group of a Free Group",
    "abstract": "We study Dehn twists in the outer automorphism group of a finitely generated non-abelian free group. Our main result states that, under certain compatibility conditions, sufficiently large powers of finitely many Dehn twists generate a right-angled Artin group. The proof proceeds by analyzing the geometry of spheres, tori, and simple closed curves in a doubled handlebody. Along the way, we establish the bigon--bihedron criterion and an equivalent condition for commuting Dehn twists. Furthermore, we construct a compact topological space on which every Dehn twist acts parabolically.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15019v1",
    "categories": ["math.OC"],
    "authors": ["Donald Goldfarb", "Lexiao Lai", "Tianyi Lin", "Jiayu Zhang"],
    "title": "Non-Convex Self-Concordant Functions: Practical Algorithms and Complexity Analysis",
    "abstract": "We extend the standard notion of self-concordance to non-convex optimization and develop a family of second-order algorithms with global convergence guarantees. In particular, two function classes -- \\textit{weakly self-concordant} functions and \\textit{$F$-based self-concordant} functions -- generalize the self-concordant framework beyond convexity, without assuming the Lipschitz continuity of the gradient or Hessian. For these function classes, we propose a regularized Newton method and an adaptive regularization method that achieve an $ε$-approximate first-order stationary point in $O(ε^{-2})$ iterations. Equipped with an oracle capable of detecting negative curvature, the adaptive algorithm can further attain convergence to an approximate second-order stationary point. Our experimental results demonstrate that the proposed methods offer superior robustness and computational efficiency compared to cubic regularization and trust-region approaches, underscoring the broad potential of self-concordant regularization for large-scale and neural network optimization problems.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14984v1",
    "categories": ["math.RT", "math.AG"],
    "authors": ["Yuly Billig", "Henrique Rocha"],
    "title": "Differentiable holonomic $AV$-modules",
    "abstract": "We study differentiable holonomic sheaves of $AV$-modules on a smooth quasi-projective variety. We show that a simple differentiable holonomic sheaf $M$ of $AV$-modules is locally the tensor product of a simple holonomic $D$-module and a simple finite-dimensional $gl_n$-module $W$. In particular, in the case when $W$ is integrable, $M$ is the tensor product of a simple holonomic $D$-module and the tensor module associated with $W$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14978v1",
    "categories": ["math.AT"],
    "authors": ["Andrea Bianchi"],
    "title": "String topology and graph cobordisms",
    "abstract": "We introduce a symmetric monoidal $\\infty$-category $\\mathrm{GrCob}$ of graph cobordisms between spaces, and use the homology of its morphism spaces to define string operations. Precisely, for an $E_\\infty$-ring spectrum $R$ and an oriented $d$-dimensional $R$-Poincaré duality space $M$, we construct a ``graph field theory'' $\\mathrm{GFT}_M$, i.e. a symmetric monoidal functor from a suitable $R$-linearisation of $\\mathrm{GrCob}^\\mathrm{op}$ to the category $\\mathrm{Mod}_R$ of $R$-modules in spectra; the graph field theory takes an object $X\\in\\mathrm{GrCob}^\\mathrm{op}$, i.e. a space, to the $R$-module $Σ_+^\\infty\\mathrm{map}(X,M)\\otimes R$ of $R$-chains on the mapping space from $X$ to $M$; by selecting suitable graph cobordisms we recover the basic string operations given by restriction, cross product with the fundamental class, and the Chas-Sullivan operations.\n  The construction is natural with respect to oriented homotopy equivalences of $R$-Poincaré duality spaces; in particular, restricting to the endomorphisms of $\\emptyset\\in\\mathrm{GrCob}^\\mathrm{op}$, we obtain characteristic classes of $R$-oriented $M$-fibrations parametrised by the suitably twisted homology of $\\mathbf{B}\\mathrm{Out}(F_n)$, recovering results of Berglund and Barkan-Steinebrunner.\n  Finally, we describe explicitly the morphism spaces in $\\mathrm{GrCob}$, answering along the way a question by Hatcher. This allows us to construct a symmetric monoidal functor from the open-closed cobordism $\\infty$-category $\\mathcal{OC}$ to $\\mathrm{GrCob}$. Composing with $\\mathrm{GFT}_M$, we obtain an open-closed field theory with values in $\\mathrm{Mod}_R$, attaining values $Σ^\\infty_+LM\\otimes R$ and $Σ^\\infty_+M\\otimes R$ at the circle and at the interval, respectively. We expect this to recover and extend constructions of Cohen, Godin and others.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14926v1",
    "categories": ["math.OC"],
    "authors": [
      "Alfredo R. R. Narváez",
      "Jeinny Peralta",
      "M. A. C. Candezano"
    ],
    "title": "Finite-Horizon LQR for General Markov Jump Linear Systems: Deterministic Reformulation and Reduced-Order Solution",
    "abstract": "This paper studies the Linear Quadratic Regulator (LQR) problem for continuous-time Markov Jump Linear Systems (MJLS) governed by general finite-state Markov chains that may include transient, absorbing, or non-communicating states. The problem, posed over a finite time horizon, is reformulated deterministically by expressing the cost functional in terms of a collection of second-moment matrices of the system state. A projection operator is introduced to restrict the analysis to the subspace of visited states, namely those with positive probability of being reached within the time horizon. The solution of the resulting deterministic problem is obtained from a reduced-order system of coupled matrix Riccati differential equations involving only the visited states, which define a quadratic value function satisfying a Hamilton-Jacobi-Bellman type equation. The structure of this equation is formally justified in the matrix setting via the Riesz-Frechet representation theorem, establishing a rigorous foundation for the deterministic reformulation and resolving an open aspect in previous literature. Several numerical examples, including cases with non-communicating states, validate the theoretical results and illustrate the practical relevance of the proposed generalization.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14915v1",
    "categories": ["math.OC"],
    "authors": ["TaeHo Yoon", "Ernest K. Ryu", "Benjamin Grimmer"],
    "title": "H-invariance theory: A complete characterization of minimax optimal fixed-point algorithms",
    "abstract": "For nonexpansive fixed-point problems, Halpern's method with optimal parameters, its so-called H-dual algorithm, and in fact, an infinite family of algorithms containing them, all exhibit the exactly minimax optimal convergence rates. In this work, we provide a characterization of the complete, exhaustive family of distinct algorithms using predetermined step-sizes, represented as lower triangular H-matrices, which attain the same optimal convergence rate. The characterization is based on polynomials in the entries of the H-matrix that we call H-invariants, whose values stay constant over all optimal H-matrices, together with H-certificates, of which nonnegativity precisely specifies the region of optimality within the common level set of H-invariants. The H-invariance theory we present offers a novel view of optimal acceleration in first-order optimization as a mathematical study of carefully selected invariants, certificates, and structures induced by them.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14898v1",
    "categories": ["math.FA"],
    "authors": [
      "Dmitri Finkelshtein",
      "Eugene Lytvynov",
      "Maria Joao Oliveira"
    ],
    "title": "Lie structures of the group of Sheffer operators",
    "abstract": "Let $Φ$ be an (LB)-space over $\\mathbb F=\\mathbb R$ or $\\mathbb C$, and let $Φ'$ be the dual space of $Φ$. We study the set $\\mathbb S(Φ)$ of Sheffer operators acting in polynomials on $Φ'$, cf.\\ [16,\\,18]. We prove that $\\mathbb S(Φ)$ is a group for the usual product of operators. We equip $\\mathbb S(Φ)$ with a natural topology which makes $\\mathbb S(Φ)$ into an infinite-dimensional manifold with a global parametrization. We show that $\\mathbb S(Φ)$ is an infinite-dimensional, regular Lie group, and provide an explicit description of the Lie algebra of $\\mathbb S(Φ)$, including an explicit form of the Lie bracket on it. Our main results are new even in the one-dimensional case, $Φ=\\mathbb{F}$. Furthermore, our results lead to improved understanding of the Lie algebra of the Riordan group, cf.\\ [8].",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14892v1",
    "categories": ["math.CT", "math.GN"],
    "authors": ["Pedro Resende", "João Paulo Santos"],
    "title": "Scott locales",
    "abstract": "We prove some facts about locales $L$ equipped with the Scott topology $Ω(L)$, in particular studying a canonical frame homomorphism $φ:Ω(L)\\to L$ which is motivated by an application to cognitive science. Such a topological locale $L$ is called a Scott locale if the inclusion of primes $p:Σ(L)\\to L$ is continuous. We prove that the spectrum $Σ(L)$ of a Scott locale $L$ is necessarily $T_1$, and that preregular locales (a generalization of regular locales) are Scott locales. If $L$ is the topology of a topological space $X$ we find a (necessarily unique) continuous map $f:X\\to L$ such that $f^{-1}=φ$ and compare it with the points-to-primes map $p:X\\to L$, showing that $f=p$ if and only if $X$ is preregular, and that a sober space $X$ is Hausdorff if and only if $X$ is $T_1$ and $f(X)\\subseteqΣ(L)$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14871v1",
    "categories": ["math.CO"],
    "authors": ["Saeed Shaebani"],
    "title": "On Fair and Tolerant Colorings of Graphs",
    "abstract": "A (not necessarily proper) vertex coloring of a graph $G$ with color classes $V_1$, $V_2$, $\\dots$, $V_k$, is said to be a {\\it Fair And Tolerant vertex coloring of $G$ with $k$ colors}, whenever $V_1$, $V_2$, $\\dots$, $V_k$ are nonempty and there exist two real numbers $α$ and $β$ such that $α\\in [0,1]$ and $β\\in [0,1]$ and the following condition holds for each arbitrary vertex $v$ and every arbitrary color class $V_i$: $$ \\bigl| V_i \\cap N (v) \\bigr| = \\begin{cases}\n  α°(v) & \\mbox{ if } \\ \\ v \\notin V_i\n  β°(v) & \\mbox{ if } \\ \\ v \\in V_i . \\end{cases} $$ The {\\it FAT chromatic number} of $G$, denoted by $χ^{\\rm FAT} (G)$, is defined as the maximum positive integer $k$ for which $G$ admits a Fair And Tolerant vertex coloring with $k$ colors. The concept of the FAT chromatic number of graphs was introduced and studied by Beers and Mulas, where they asked for the existence of a function $f \\colon \\mathbb{N} \\to \\mathbb{R}$ in such a way that the inequality $χ^{\\rm FAT} (G) \\ \\leq \\ f \\big( χ(G) \\big)$ holds for all graphs $G$. Another similar interesting question concerns the existence of some function $g \\colon \\mathbb{N} \\to \\mathbb{R}$ such that the inequality $χ(G) \\ \\leq \\ g \\left( χ^{\\rm FAT} (G) \\right)$ holds for every graph $G$. In this paper, we establish that both questions admit negative resolutions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15558v1",
    "categories": ["math.DG", "nlin.SI"],
    "authors": ["Michal Marvan"],
    "title": "Voss surfaces in sine-Gordon hierarchies",
    "abstract": "We explore a method, initiated by Guichard in 1890, which allows to generate sequences of Voss surfaces by quadratures, starting from an arbitrarily chosen pseudospherical surface and a seed solution of the Moutard equation, by means of two simple transformations. In this paper we 1) identify the Guichard transformations with the well-known recursion operators for symmetries of the sine-Gordon equation; 2) prove a lemma which allows us to derive the length of Guichard's sequences from the invariance properties of the initial sine-Gordon solution; 3) introduce an extended class of inverted operators, increasing the number of Voss surfaces obtainable by quadratures. Several Voss nets are presented explicitly.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15555v1",
    "categories": ["cs.IT"],
    "authors": ["Yajun Zhao", "Mengnan Jian", "Yifei Yuan"],
    "title": "RIS-Enabled UAV Communications and Sensing: Opportunities, Challenges, and Key Technologies",
    "abstract": "Unmanned Aerial Vehicles (UAVs) play a pivotal role in the emerging low-altitude economy. However, they face significant challenges in achieving reliable network coverage during transit operations. This paper provides an in-depth investigation into the characteristics and challenges of communication networks tailored for UAVs. First, we outline typical operational scenarios, traffic patterns, and a dual-layer heterogeneous network topology. This topology is essential for enabling three-dimensional continuous coverage and ensuring seamless network coexistence between UAVs and other network entities. Moreover, the paper delves into the channel characteristics and specific challenges faced by UAV Integrated Sensing and Communication (ISAC) networks. It highlights the limitations of traditional Active Phased Array Antenna (APAA)-based networks, particularly regarding cost, complexity, and site deployment constraints. We then introduce Reconfigurable Intelligent Surface (RIS)-assisted networks as a promising solution for enhancing UAV signal coverage. The key technical features of RIS are discussed, including design principles, antenna tilt configurations, new beam types, and beam tracking mechanisms. In addition, we examine the impact of highfrequency bands and their absorption peaks on signal attenuation. The paper further explores network architecture designs aimed at improving UAV signal coverage, facilitating network coexistence, and supporting RIS-enhanced UAV sensing. Field trial results evaluating the effectiveness of RIS in improving UAV coverage are presented. Finally, we outline future technological trends and highlight potential advancements to further optimize UAV communication systems. We also emphasize the importance of engineering implementation and standardization efforts in RIS-based UAV-ISAC networks.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15508v1",
    "categories": ["math.CO"],
    "authors": ["Peter Frankl", "Jian Wang"],
    "title": "On the largest degrees in intersecting hypergraphs",
    "abstract": "Let $\\binom{[n]}{k}$ denote the collection of all $k$-subsets of the standard $n$-set $[n]=\\{1,2,\\ldots,n\\}$. Let $n>2k$ and let $\\mathcal{F}\\subset \\binom{[n]}{k}$ be an {\\it intersecting} $k$-graph, i.e., $F\\cap F'\\neq \\emptyset$ for all $F,F'\\in \\mathcal{F}$. The number of edges $F\\in \\mathcal{F}$ containing $x\\in [n]$ is called the {\\it degree} of $x$. Assume that $d_1\\geq d_2\\geq \\ldots\\geq d_n$ are the degrees of $\\mathcal{F}$ in decreasing order. An important result of Huang and Zhao states that for $n>2k$ the minimum degree $d_n$ is at most $\\binom{n-2}{k-2}$. For $n\\geq 6k-9$ we strengthen this result by showing $d_{2k+1}\\leq \\binom{n-2}{k-2}$. As to the second and third largest degrees we prove the best possible bound $d_3\\leq d_2\\leq \\binom{n-2}{k-2}+\\binom{n-3}{k-2}$ for $n>2k$. Several more best possible results of a similar nature are established.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15489v1",
    "categories": ["math.CO"],
    "authors": [
      "Jiangdong Ai",
      "Qiwen Guo",
      "Gregory Gutin",
      "Yiming Hao",
      "Anders Yeo"
    ],
    "title": "Odd Induced Subgraphs in Graphs of Maximum Degree Four",
    "abstract": "A graph is called odd if all of its vertex degrees are odd. A long-standing conjecture asked whether there exists a positive constant $c$ such that every $n$-vertex graph without isolated vertices contains an odd induced subgraph on at least $cn$ vertices. In 2022, Ferber and Krivelevich resolved this conjecture affirmatively with $c=10^{-4}$. A natural question is to determine the largest possible constant $c$. In 1994, Caro remarked that if $2/7$ is a valid value for $c$, then it is the largest possible one. To the best of our knowledge, the bound $c\\ge 2/7$ has not been improved. Previous research has established tight bounds for specific graph classes -- for instance, $c = 2/5$ for graphs with maximum degree at most $3$ and without isolated vertices. In this paper, we prove that $c=2/7$ is the tight bound for graphs with maximum degree at most $4$ and without isolated vertices. Our result provides some support for $2/7$ being the largest value of $c$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15448v1",
    "categories": ["math.RA"],
    "authors": ["Vincent Astier", "Thomas Unger"],
    "title": "Continuity of total signature maps for Azumaya algebras with involution",
    "abstract": "In this paper we continue our investigation of signatures of hermitian forms over Azumaya algebras with involution over commutative rings. We show that the approach used in an earlier paper for central simple algebras can be extended to Azumaya algebras and leads to a natural way of choosing the signature of a hermitian form at a given ordering, producing total signatures of hermitian forms that are continuous functions on the real spectrum of the base ring.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15428v1",
    "categories": ["math.AP", "math.OC"],
    "authors": ["Junyoung Heo", "Yubin Lee"],
    "title": "Optimizing Resource Distribution in a One-Dimensional Logistic Diffusion Model",
    "abstract": "In this article, we study the optimization of resource distributions in a one-dimensional logistic diffusive model. The goal is to determine a distribution on a bounded one-dimensional domain that maximizes the total population at equilibrium. Previous works have shown that optimal resources are bang-bang, and in one dimension, a sufficiently large dispersal rate forces the optimal resource to be concentrated. For general dispersal rates, however, the analysis becomes more difficult because the equilibrium population may behave irregularly, and the optimal resource may be fragmented. To address this, we introduce a block decomposition that reduces fragmented resources to a collection of concentrated blocks. We then define an advantage function, which measures the gain in the equilibrium population obtained by allocating resources on a fixed interval and is used to analyze the contribution of each block to the total population. This function also allows us to reformulate the optimization problem as a convexity analysis of the advantage function. We prove the superlinearity of this function when the total resource is small enough, and this property leads to an explicit characterization of the optimal control with sufficiently small total resource.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15395v1",
    "categories": ["math.NA"],
    "authors": ["Ludovico Bruni Bruno", "Stefano Serra-Capizzano"],
    "title": "On the conditioning of histopolation",
    "abstract": "Histopolation is the approximation procedure that associates a degree $ d-1 $ polynomial $ p_{d-1} \\in \\mathscr{P}_{d-1} (I) $ with a locally integrable function $ f $ imposing that the integral (or, equivalently, the average) of $p$ coincides with that of $f$ on a collection of $ d $ distinct segments $s_i$. In this work we discuss unisolvence and conditioning of the associated matrices, in an asymptotic linear algebra perspective, i.e., when the matrix-size $d$ tends to infinity. While the unisolvence is a rather sparse topic, the conditioning in the unisolvent setting has a uniform behavior: as for the case of standard Vandermonde matrix-sequences with real nodes, the conditioning is inherently exponential as a function of $d$ when the monomial basis is chosen. In contrast, for an appropriate selection of supports, the Chebyshev basis of second kind has a bounded conditioning. A linear behavior is also observed in the Frobenius norm.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14943v1",
    "categories": ["math-ph"],
    "authors": ["Thomas Karabela", "Wenjun Niu"],
    "title": "Higgs Branches in the Omega-background via the Category of Line Operators",
    "abstract": "The vacuum manifold $\\mathcal{M}$ of a topological twist of a 3d $\\mathcal{N}=4$ gauge theory is a hyper-Kähler variety; deformations and quantizations of $\\mathcal{M}$ can be constructed in the framework of 3 dimensional topological quantum field theories. In particular, based on physics arguments, turning on an omega-background results in the quantization of $\\mathbb{C}[\\mathcal{M}]$ as a Poisson algebra. In this paper, we implement this idea mathematically, in the context of the B-twist of 3d $\\mathcal{N}=4$ gauge theories, namely for Higgs branches. Our strategy is to implement omega-background in the category of line operators via the choice of a ribbon twist, and obtain the quantum Hamiltonian reduction as derived endomorphisms in the equivariant category, the category where the ribbon twist acts trivially. We apply quadratic Koszul duality to perform this computation.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15587v1",
    "categories": ["math.AP", "math-ph"],
    "authors": ["Ioakeim Ampatzoglou", "Tristan Léger"],
    "title": "On the optimal local well-posedness of the wave kinetic equation in $L^r$",
    "abstract": "In this paper, we give a unified treatment of the local well-posedness for the wave kinetic equation in almost critical weighted $L^r$ spaces with $2 \\leq r \\leq \\infty.$ The proof builds on ideas from our earlier works \\cite{AmLe24, AmLemain25}. Our approach is based solely on kinetic tools, with no appeal to Fourier theory.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15568v1",
    "categories": ["math.NT", "math.DS"],
    "authors": ["René Pfitscher"],
    "title": "Integrability of Siegel transforms and an application",
    "abstract": "We establish sharp algebraic criteria for the $L^{p}$-integrability, for $p = 1, 2, \\infty$, of a natural generalization of the Siegel transform to the setting of rational representations of semisimple algebraic $\\mathbb{Q}$-groups, extending Siegel's analytic work in the geometry of numbers.\n  As an application, we derive an effective asymptotic formula for the number of rational approximations of bounded height to almost every real point on a rank-one flag variety at the Diophantine exponent. The argument combines the integrability criterion with effective equidistribution estimates for translated orbits of maximal compact subgroups, a result of independent interest.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15478v1",
    "categories": ["math.NA"],
    "authors": ["Ritu Kumari", "Mani Mehra", "Abhishek Kumar Singh"],
    "title": "Fractional Quadrature rule and using its Exactness for the Müntz-Legendre Scaling Functions for Solving Fractional Differential Equations",
    "abstract": "Fractional operators (derivatives/integrals) are defined via the integration of the functions. When the function is produced by a spanning set of fractional power functions, traditional quadrature rules often need to be revised, failing to provide exact evaluations for fractional power functions and thus introducing approximation errors. In this paper, we have formulated a fractional quadrature rule that achieves exact integration for functions within this specific set to address this issue. Some properties of the fractional quadrature rule have been proved, and the absolute error bound in the proposed fractional quadrature rule has been derived. The behavior of roots of the orthogonal Müntz polynomial has also been observed for its application as nodes in the fractional quadrature rule. To illustrate the effectiveness of the newly proposed fractional quadrature rule, we focus on fractional differential equations that incorporate the left Caputo fractional derivative. In this context, Müntz-Legendre scaling functions are utilized to approximate the Caputo derivative of functions involved in these equations. Additionally, we have derived an operational matrix for Riemann-Liouville integration to approximate the respective functions with the help of the fractional quadrature rule. To demonstrate the practical utility of our method, we provide illustrative examples that compare the $L_2$-error estimates in the solutions of fractional differential equations using our approach against those obtained with the Block-pulse method. These comparisons underscore the superior accuracy of our proposed method.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15455v1",
    "categories": ["math.OC", "math.AP"],
    "authors": ["Rossana Capuani", "Antonio Marigonda", "Marc Quincampoix"],
    "title": "Generalized differentiation in Wasserstein space and application to multiagent control problem",
    "abstract": "Several concepts of generalized differentiation in Wasserstein space have been proposed in order to deal with the intrinsic nonsmoothness arising in the context of optimization problems in Wasserstein spaces. In this paper we introduce a concept of admissible variation encompassing some of the most popular definitions as special cases, and using it to derive a comparison principle for viscosity solutions of an Hamilton Jacobi Bellman equation following from an optimal control of a multiagent systems.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14818v1",
    "categories": ["math.GR", "math.CO"],
    "authors": ["P. C. Hua", "C. H. Li", "J. B. Zhang", "H. Zhou"],
    "title": "Finite solvable groups of square-free Euler characteristic",
    "abstract": "A characterization is completed for finite groups which act regularly on maps with square-free Euler characteristic, associated with infinite families of square-free Euler characteristic regular maps presented. This is based on a classification of finite groups of which each Sylow subgroup has a cyclic or dihedral subgroup of prime index.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14862v1",
    "categories": ["math.CO", "math.OC", "math.PR"],
    "authors": [
      "Phuong N. Hoàng",
      "Kevin McGoff",
      "Andrew B. Nobel",
      "Yang Xiang",
      "Bongsoo Yi"
    ],
    "title": "Optimal graph joining with applications to isomorphism detection and identification",
    "abstract": "We introduce an optimal transport based approach for comparing undirected graphs with non-negative edge weights and general vertex labels, and we study connections between the resulting linear program and the graph isomorphism problem. Our approach is based on the notion of a joining of two graphs $G$ and $H$, which is a product graph that preserves their marginal structure. Given $G$ and $H$ and a vertex-based cost function $c$, the optimal graph joining (OGJ) problem finds a joining of $G$ and $H$ minimizing degree weighted cost. The OGJ problem can be written as a linear program with a convex polyhedral solution set. We establish several basic properties of the OGJ problem, and present theoretical results connecting the OGJ problem to the graph isomorphism problem. In particular, we examine a variety of conditions on graph families that are sufficient to ensure that for every pair of graphs $G$ and $H$ in the family (i) $G$ and $H$ are isomorphic if and only if their optimal joining cost is zero, and (ii) if $G$ and $H$ are isomorphic, the the extreme points of the solution set of the OGJ problem are deterministic joinings corresponding to the isomorphisms from $G$ to $H$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15334v1",
    "categories": ["math.OA"],
    "authors": ["Rajibul Haque", "Ujjal Karmakar", "Arnab Mandal"],
    "title": "Some Results on Bichon's Quantum Automorphism Group of Graphs",
    "abstract": "The notion of the quantum automorphism group of a graph was introduced by J. Bichon in 2003 and T. Banica in 2005 respectively. This article explores primarily the quantum automorphism group of a graph $Γ$, denoted by $QAut_{Bic}(Γ)$, in Bichon's framework. First, we provide a sufficient condition for non-commutativity of Bichon's quantum automorphism group and discuss several applications of this criterion. Although it is known that $QAut_{Bic}(Γ) \\cong QAut_{Bic}(Γ^c)$ does not hold in general, we identify a family of graphs for which this isomorphism enforces that the graph has no quantum symmetry. Moreover, we describe a few families of graphs having quantum symmetries whose quantum automorphism groups in Bichon's sense are commutative. Finally, we show that free product, tensor product and free wreath product constructions can arise as Bichon's quantum automorphism groups of connected graphs in the following sense: For a finite family of compact matrix quantum groups $\\{Q_i\\}_{i=1}^{m}$ arising as Bichon's quantum automorphism groups of certain graphs, there exist connected graphs $Γ_{free}$, $Γ_{ten}$ and $Γ_{wr}$ whose quantum automorphism groups are $*_{i=1}^{m} Q_{i}$, $\\otimes_{i=1}^{m} Q_i$ and $Q_1 \\wr_{*} Q_2$ respectively.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15273v1",
    "categories": ["math.OC", "cs.IT", "math.DS", "math.NA"],
    "authors": ["Alexander Stotsky"],
    "title": "RLS Framework with Segmentation of the Forgetting Profile and Low Rank Updates",
    "abstract": "This report describes a new regularization approach based on segmentation of the forgetting profile in sliding window least squares estimation. Each segment is designed to enforce specific desirable properties of the estimator such as rapidity, desired condition number of the information matrix, accuracy, numerical stability, etc. The forgetting profile is divided in three segments, where the speed of estimation is ensured by the first segment, which employs rapid exponential forgetting of recent data.The second segment features a decline in the profile and marks the transition to the third segment, characterized by slow exponential forgetting to reduce the condition number of the information matrix using more distant data. Condition number reduction mitigates error propagation, thereby enhancing accuracy and stability. This approach facilitates the incorporation of a priori information regarding signal characteristics (i.e., the expected behavior of the signal) into the estimator. Recursive and computationally efficient algorithm with low rank updates based on new matrix inversion lemma for moving window associated with this regularization approach is developed. New algorithms significantly improve the approximation accuracy of low resolution daily temperature measurements obtained at the Stockholm Old Astronomical Observatory, thereby enhancing the reliability of temperature predictions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15264v1",
    "categories": ["math.CT"],
    "authors": ["Marco Grandis", "Robert Paré"],
    "title": "Multiple categories of general quintets",
    "abstract": "We construct various multiple categories, based on generalised Ehresmann quintets. The main construction is a multiple category whose objects are all the `lax' multiple categories; the transversal arrows are their strict multiple functors while the arrows in a positive direction are multiple functors of a `mixed laxity', varying from the lax ones (in direction 1) to the colax ones (in direction \\infty).",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15243v1",
    "categories": ["math.NT"],
    "authors": ["Stéphane Louboutin"],
    "title": "Ideal class groups of some quadratic number fields and factorization of values of some quadratic polynomials",
    "abstract": "We fill the gaps in A. Gica's determination of all the odd positive integers $d$ for which the number of distinct prime divisors of $f_d(x)=d+x^2$ is less than or equal to $2$ for all the positive and odd integers $x\\leq\\sqrt{d}$. We also determine all the even positive integers $d$ for which the number of distinct prime divisors of $f_d(x)$ is less than or equal to $2$ for all the positive and even integers $x\\leq\\sqrt{d}$. These problems are related to the famous Frobenius-Rabinowitsch's characterization of the imaginary quadratic number fields ${\\mathbb Q}(\\sqrt{-d})$ of odd discriminants with class number one in terms of the primality of $f_d(x)/4$ for all the positive and odd integers $x\\leq\\sqrt{d}$. However, the solution to our problem is much more difficult to come up with. We also begin to address the same problems for the case of $f_d(x)=d-x^2$, in relation with the class groups of the real quadratic number fields ${\\mathbb Q}(\\sqrt{d})$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15171v1",
    "categories": ["math.OC"],
    "authors": ["Yibei Li", "Yuexin Cao", "Zhixin Liu", "Lihua Xie"],
    "title": "Adaptive Inverse Reinforcement Learning with Online Off-Policy Data Collection",
    "abstract": "In this paper, the inverse reinforcement learning (IRL) problem is addressed to reconstruct the unknown cost function underlying an observed optimal policy in a model-free manner, whose online adaptation with completely off-policy system data still remains unclear in the literature. Without prior knowledge of the system model parameters, an adaptive and direct learning rule for the cost parameter is proposed using online off-policy system data, which only needs to satisfy the mild persistently exciting condition in the general data-driven paradigm. The adaptive and online IRL algorithm is achieved by designing full Nesterov-Todd (NT)-step primal-dual interior-point iterations. Despite solving a nonlinear and time-varying semi-definite program (SDP), the influence of system noise is rigorously analyzed, and the proposed online algorithm is shown to achieve a sublinear convergence. The proposed method is further generalized to nonlinear IRL based on differential dynamic programming. The gradient of the loss function is directly obtained via a backward pass, which eliminates the need to repeatedly solve forward RL problems as in conventional bi-level IRL frameworks. Finally, the efficiency and effectiveness of the proposed algorithms are demonstrated by numerical examples.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15161v1",
    "categories": ["math.ST", "stat.ME"],
    "authors": ["Dogyoon Song"],
    "title": "Design-based finite-sample analysis for regression adjustment",
    "abstract": "In randomized experiments, regression adjustment leverages covariates to improve the precision of average treatment effect (ATE) estimation without requiring a correctly specified outcome model. Although well understood in low-dimensional settings, its behavior in high-dimensional regimes -- where the number of covariates $p$ may exceed the number of observations $n$ -- remains underexplored. Furthermore, existing theory is largely asymptotic, providing limited guidance for finite-sample inference. We develop a design-based, non-asymptotic analysis of the regression-adjusted ATE estimator under complete randomization. Specifically, we derive finite-sample-valid confidence intervals with explicit, instance-adaptive widths that remain informative even when $p > n$. These intervals rely on oracle (population-level) quantities, and we also outline data-driven envelopes that are computable from observed data. Our approach hinges on a refined swap sensitivity analysis: stochastic fluctuation is controlled via a variance-adaptive Doob martingale and Freedman's inequality, while design bias is bounded using Stein's method of exchangeable pairs. The analysis suggests how covariate geometry governs concentration and bias through leverages and cross-leverages, shedding light on when and how regression adjustment improves on the difference-in-means baseline.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15156v1",
    "categories": ["math.CO", "cs.DM"],
    "authors": ["Nikolai Karol"],
    "title": "String Graphs: Product Structure and Localised Representations",
    "abstract": "We investigate string graphs through the lens of graph product structure theory, which describes complicated graphs as subgraphs of strong products of simpler building blocks. A graph $G$ is called a string graph if its vertices can be represented by a collection $\\mathcal{C}$ of continuous curves (called a string representation of $G$) in a surface so that two vertices are adjacent in $G$ if and only if the corresponding curves in $\\mathcal{C}$ cross. We prove that every string graph with bounded maximum degree in a fixed surface is isomorphic to a subgraph of the strong product of a graph with bounded treewidth and a path. This extends recent product structure theorems for string graphs. Applications of this result are presented. This product structure theorem ceases to be true if the `bounded maximum degree' assumption is relaxed to `bounded degeneracy'. For string graphs in the plane, we give an alternative proof of this result. Specifically, we show that every string graph in the plane has a `localised' string representation where the number of crossing points on the curve representing a vertex $u$ is bounded by a function of the degree of $u$.\n  Our proof of the product structure theorem also leads to a result about the treewidth of outerstring graphs, which qualitatively extends a result of Fox and Pach [Eur. J. Comb. 2012] about outerstring graphs with bounded maximum degree. We extend our result to outerstring graphs defined in arbitrary surfaces.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15133v1",
    "categories": ["math.NT"],
    "authors": ["Seon-Hong Kim", "Kenneth B. Stolarsky"],
    "title": "A Balanced Three-term Generalization of Nicomachus' Identity",
    "abstract": "We present a generalization of the classical Nicomachus' identity for the sum of the first $n$ cubes. Unlike previous generalizations, it has three rather than two terms, and involves not just one, but two distinct triangular numbers, and each term is of degree $4$ in $\\lfloor n/2 \\rfloor$. The asymptotic behavior for large $n$ leads to continued fractions with remarkable (but conjectural) properties. Moreover, we give a way of looking at squares of triangular numbers that involves the square root of $11$ and show it is a limiting case of a non-obvious identity involving truncations of the continued fraction expansion of that square root. The details involve a nonlinear recurrence that (with appropriate initial conditions) unexpectedly produces only integers, a ``Somos-type'' phenomenon.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14985v1",
    "categories": ["math.GT"],
    "authors": [
      "Francisco Javier González-Acuña",
      "Araceli Guzmán Tristán",
      "Jesús Rodríguez-Viorato",
      "José Andrés Rodríguez Migueles"
    ],
    "title": "3-manifolds with universal links are spherical",
    "abstract": "We determine which orientable 3-manifolds are dominated by the 3-sphere. This characterization implies that the closed 3-manifolds that admit a universal link are spherical. Moreover, we show examples of complement universal links that are not universal.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15104v1",
    "categories": ["math.NA"],
    "authors": ["Zhihao Qi", "Weibing Deng", "Fuhai Zhu"],
    "title": "Error Analysis on a Novel Class of Exponential Integrators with Local Linear Extension Techniques for Highly Oscillatory ODEs",
    "abstract": "This paper studies a class of non-autonomous highly oscillatory ordinary differential equations (ODEs) featuring a linear component inversely proportional to a small parameter $\\varepsilon$ with purely imaginary eigenvalues, alongside an $\\varepsilon$-independent nonlinear component. When $0<\\varepsilon\\ll 1$, the rapidly oscillatory solution constrains the step size selection and numerical accuracy, resulting in significant computational challenges. Motivated by linearization through introducing auxiliary polynomial variables, a new class of explicit exponential integrators (EIs) has recently been developed. The methods do not require the linear part to be diagonal or with all eigenvalues to be integer multiples of a fixed value - a general assumption in multiscale methods - and attain arbitrarily high convergence order without any order conditions. The main contribution of this work is to establish a rigorous error analysis for the new class of methods. To do this, we first demonstrate the equivalence between the high-dimensional system and the original problem by employing algebraic techniques. Building upon these fundamental results, we prove that the numerical schemes have a uniform convergence order of $O(h^{k+1})$ for the solution when using at most $k$-degree auxiliary polynomial variables with time step sizes smaller than $\\varepsilon$. For larger step sizes under the bounded oscillatory energy condition, the methods achieve a convergence order of $O(\\varepsilon h^k)$ for the solution. These theoretical results are further applied to second-order oscillatory equations, yielding improved uniform accuracy with respect to $\\varepsilon$. Finally, numerical experiments confirm the optimality of the derived error estimates.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15086v1",
    "categories": ["math.FA"],
    "authors": [
      "Soumitra Daptari",
      "Koki Igarashi",
      "Jumpei Nakamura",
      "Ryotaro Tanaka"
    ],
    "title": "On relationship among three types of Birkhoff-James orthogonality",
    "abstract": "In this paper, we study three types of Birkhoff-James orthogonality in Hilbert $C^*$-modules, that is, the strong, quasi-strong, and original Birkhoff-James orthogonality. In general, the strong Birkhoff-James orthogonality is stronger than the quasi-strong Birkhoff-James orthogonality, and the quasi-strong Birkhoff-James orthogonality is stronger than the original Birkhoff-James orthogonality. Meanwhile, each reverse implication in this chain requires additional conditions. As the main results, we show that the strong and quasi-strong Birkhoff-James orthogonality are equivalent in a full Hilbert $C^*$-module if and only if the underlying $C^*$-algebra is commutative, and that the equivalence of the quasi-strong and original Birkhoff-James orthogonality in a full Hilbert $C^*$-module implies the primeness of the underlying $C^*$-algebra. Moreover, two examples, explaining the complexity of conditions for full Hilbert $C^*$-modules in which the quasi-strong and original Birkhoff-James orthogonality are equivalent, are given in the $C^*$-algebra settings.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14924v1",
    "categories": ["math.CO", "gr-qc"],
    "authors": ["Ian George", "Karen Yeats"],
    "title": "The Generalized Interval Polynomial of a Poset",
    "abstract": "For any finite poset we define a generating polynomial counting upsets, downsets, and their intersection. We investigate the behaviour of this polynomial with respect to poset operations, show that it distinguishes series-parallel posets, and comment on connections to the causal set approach to quantum gravity.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15280v1",
    "categories": ["math.CO"],
    "authors": [
      "Sam Adriaensen",
      "Jan De Beule",
      "Jozefien D'haeseleer",
      "Sam Mattheus"
    ],
    "title": "A note on the classification of classical distance-regular graphs of negative type and the non-existence of hemisystems",
    "abstract": "The goal of this note is to connect some interesting results in the literature on algebraic graph theory and finite geometry. In 1999, Weng gave an almost complete classification of classical distance-regular graphs of negative type with diameter at least 4. He proved that these graphs are either dual polar graphs of Hermitian polar spaces, Hermitian forms graphs, or fall into a last category. It was recently proved by Yian et al. that the latter category does not exist when the diameter equals 3, which by Weng's results proves that they do not exist for bigger diameter. Using a result of Vanhove, this proves that certain hemisystems in Hermitian polar spaces cannot exist.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15360v1",
    "categories": ["math.OC"],
    "authors": [
      "Bastien Cavarretta",
      "Florentin Goyens",
      "Clément W. Royer",
      "Florian Yger"
    ],
    "title": "Complexity guarantees and polling strategies for Riemannian direct-search methods",
    "abstract": "Direct-search algorithms are derivative-free optimization techniques that operate by polling the variable space along specific directions forming positive spanning sets (PSSs). When the problem variables are constrained to lie on a Riemannian manifold, polling must be performed along tangent directions. Although Riemannian variants of direct search have already been proposed and endowed with asymptotic guarantees, a proper generalization of PSSs on manifolds remains to be investigated. In particular, a measure of quality for those PSSs is required to obtain complexity bounds for direct search.\n  In this paper, we derive complexity guarantees for a class of Riemannian direct-search techniques, and study two ways of generating positive spanning sets in tangent spaces. We pay particular attention the unit hypersphere case, for which we establish that generating directions directly within the tangent space leads to better complexity properties than projecting PSSs from the ambient space onto the tangent space. Our numerical experiments highlight the impact of dimension and codimension in more general settings.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15647v1",
    "categories": ["math.PR"],
    "authors": ["Gabriel Flath"],
    "title": "A simpler path to Ergodic Theorems for the Frontier of Branching Brownian Motion",
    "abstract": "We revisit the ergodic theorem for the frontier of branching Brownian motion (BBM). Motivated by the proof of Arguin, Bovier, and Kistler \\cite{arguin2012ergodic}, we provide a shorter and more direct argument. It relies on two observations: pairs of extremal particles observed at distinct times far apart must have branched early, and pairs of early-branching extremal particles have negatively correlated positions. This yields the ergodic theorem for BBM. We also address a gap in the path localization argument of \\cite{arguin2012ergodic}.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15621v1",
    "categories": ["math.AP"],
    "authors": ["Chong Gu", "Nam Q. Le"],
    "title": "A Green's function approach to linearized Monge-Ampère equations in divergence form and application to singular Abreu type equations",
    "abstract": "In this paper, we establish local and global regularity estimates for linearized Monge-Ampère equations in divergence form via critical Lorentz space estimates for the Green's function of the linearized Monge-Ampère operator and its gradient. These estimates hold under suitable conditions on the data and the convex Monge-Ampère potential is assumed to have Hessian determinant bounded between two positive constants. As an application, we obtain the solvability in all dimensions of the second boundary value problem for a class of singular fourth-order Abreu type equations that arise from the approximation analysis of variational problems subject to convexity constraints.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15611v1",
    "categories": ["math.AG"],
    "authors": [
      "Narasimha Chary Bonala",
      "S Senthamarai Kannan",
      "Santosha Pattanayak"
    ],
    "title": "On the GIT quotient of Grassmannians by one dimensional torus",
    "abstract": "We consider the action of the one-parameter subgroup of the special linear group corresponding to a simple root on Grassmannians and describe the structure of the associated Geometric Invariant Theory (GIT) quotients with respect to Plücker line bundle. Using the combinatorics of Weyl group elements, we explicitly describe the semistable loci and identify cases where the resulting quotient admits the structure of a parabolic induction of a projective space. We further analyze the orbit structure under the Levi subgroup, compute the Picard group, connected component of the automorphism group and examine key geometric features such as Fano properties, cohomology of line bundles, and projective normality with respect to the descended linearization.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15598v1",
    "categories": ["math.DG"],
    "authors": ["Haoran Wu", "Xuwen Zhu"],
    "title": "Two families of reducible spherical conical metrics",
    "abstract": "We analyze a 1-parameter family of heart shape and a 3-parameter family obtained by gluing three footballs, both of which are examples of reducible spherical conical metrics. For these examples we verify the structure theorem given in [15] and show that such metrics naturally arise from Abelian differentials of the third kind. We then obtain the geometric decomposition using explicit metric and geodesic calculations. This offers new evidence for the interaction between the synthetic spherical geometry and the complex analytic structure of reducible conical metrics.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15152v1",
    "categories": ["math.AP"],
    "authors": ["Chengyu Zhang", "Borui Miao", "Yi Zhu"],
    "title": "Pseudo-magnetic Fields and Effective Dynamics in Strained Honeycomb Structures",
    "abstract": "Strain offers a straightforward and effective method for generating pseudo-magnetic fields in optical and acoustic materials, thereby enabling precise manipulation of wave propagation. In this article, we investigate and justify wave packet dynamics localized near Dirac points in strained honeycomb-structured media. We develop a novel approach based on spectral analysis to control the error from second-order differential residue terms caused by the strain. The analysis yields a two-dimensional Dirac equation with nontrivial gauge fields governing the envelope dynamics, which is proved to well approximate the true solution in a long but finite time. These results contribute to the mathematical understanding of pseudo-magnetic effects in strained honeycomb structures and pave the way to systems with general higher-order perturbation terms.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15599v1",
    "categories": ["math.AP", "cond-mat.stat-mech", "q-bio.PE", "q-bio.SC"],
    "authors": ["Tommaso Lorenzi", "Horacio Tettamanti", "Mattia Zanella"],
    "title": "Kinetic and mean-field modeling of muscular dystrophies",
    "abstract": "We present a new class of models for assessing the cell dynamics characterising muscular dystrophies. The proposed approach comprises a system of integro-differential equations for the statistical distributions, over a large patient cohort, of the densities of muscle fibers and immune cells implicated in muscle inflammation, degeneration, and regeneration, which underpin disease development. Considering an appropriately scaled version of this model, we formally derive, as the corresponding mean-field limit, a system of Fokker-Planck equations, from which we subsequently derive, as a macroscopic model counterpart, a system of differential equations for the mean densities of muscle and immune cells in the cohort of patients and the related variances. Then, we study long-time asymptotics for the mean-field model by determining the quasi-equilibrium cell distribution functions, which are in the form of probability density functions of inverse Gamma distributions, and proving the long-time convergence to such quasi-equilibrium distributions. The analytical results obtained are illustrated by means of a sample of results of numerical simulations. The modeling approach presented here has the potential to offer new insights into the balance between degeneration and regeneration mechanisms in the progression of muscular dystrophies, and provides a basis for future extensions, including the modeling of therapeutic interventions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15554v1",
    "categories": ["math.DS", "q-bio.MN"],
    "authors": ["Tomislav Plesa"],
    "title": "Chemical systems with chaos",
    "abstract": "Three-dimensional polynomial dynamical systems (DSs) can display chaos with various properties already in the quadratic case with only one or two quadratic monomials. In particular, one-wing chaos is reported in quadratic DSs with only one quadratic monomial, while two-wing and hidden chaos in quadratic DSs with only two quadratic monomials. However, none of the reported DSs can be realized with chemical reactions. To bridge this gap, in this paper, we investigate chaos in chemical dynamical systems (CDSs) - a subset of polynomial DSs that can model the dynamics of mass-action chemical reaction networks. To this end, we develop a fundamental theory for mapping polynomial DSs into CDSs of the same dimension and with a reduced number of non-linear terms. Applying this theory, we show that, under suitable robustness assumptions, quadratic CDSs, and cubic CDSs with only one cubic, can display a rich set of chaotic solutions already in three dimensions. Furthermore, we construct some relatively simple three-dimensional examples, including a quadratic CDS with one-wing chaos and three quadratics, a cubic CDS with two-wing chaos and one cubic, and a quadratic CDS with hidden chaos and five quadratics.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15548v1",
    "categories": ["math.PR", "math.OC"],
    "authors": ["Guanwei Cheng", "Shuzhen Yang"],
    "title": "Infinite Anticipation Backward Stochastic Differential Equations",
    "abstract": "In this paper, we introduce a new type of backward stochastic differential equations (BSDEs) with infinite anticipation, where the generator depends on the entire future values of the solution in infinite horizon. We show that the new BSDEs has a unique solution and admits a comparison result. In the end, we solve a stochastic control problem via a duality between BSDEs with infinite anticipation and stochastic differential equations (SDEs) with infinite delay.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15502v1",
    "categories": ["math.GR"],
    "authors": ["Istvan Heckenberger", "Fengchang Li"],
    "title": "Subracks and second homology of the conjugacy classes of finite projective special linear groups of degree two",
    "abstract": "We describe the subracks of the conjugacy classes of $\\mathrm{PSL}(2,q)$ based on Dickson's theorem on subgroups of $\\mathrm{PSL}(2,q)$. All minimal non-abelian subracks of $\\mathrm{PSL}(2,q)$ are determined. Further, we provide a general result on the relationship of associated groups of conjugacy classes in perfect groups to the Schur multiplier of the group. This allows us to conclude explicit descriptions of the associated groups and the second homology of the conjugacy classes of $\\mathrm{PSL}(2,q)$ for $q>3$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15501v1",
    "categories": ["math.AP", "math-ph"],
    "authors": ["Sepehr Mohammadkhani", "Huy Q. Nguyen"],
    "title": "On Moffatt's magnetic relaxation for 2D and 2.5D flows",
    "abstract": "We study the Moffatt's magnetic relaxation equation with Darcy-type regularization for the constitutive law. This is a topology-preserving dissipative equation, whose solutions are conjectured to converge in the infinite time limit towards equilibria of the incompressible Euler equations. Our goal is to prove this conjectured property for various equilibria in various domains. The first result concerns a class of non-constant shear flows in a 2D periodic channel. In the second result, by adopting a geometric approach, we address a class of 2.5D equilibria in $Ω\\times \\mathbb{R}$, where $Ω\\subset \\mathbb{R}^2$ can be a periodic channel or any bounded domain.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15498v1",
    "categories": ["math.AP"],
    "authors": ["Ren-Jun Duan", "Feimin Huang", "Rui Li", "Lingda Xu"],
    "title": "Asymptotic stability of planar entropy wave for 3-d Navier-Stokes equations in Eulerian coordinates",
    "abstract": "We investigate the large-time asymptotic behavior toward the planar entropy wave for the three-dimensional Navier-Stokes equations in Eulerian coordinates, considering two types of initial perturbations -- with and without the assumption that the integral of the initial perturbation is zero. Generic perturbations generate diffusion waves, and structural conditions fail for multi-dimensional Navier-Stokes equations in Eulerian coordinates. These two aspects have posed significant challenges and left the problem unresolved for years. On one hand, since \\cite{LX}, the study of the entropy wave has been based on the left-right structural conditions. Without these structural conditions, the decay rates of lower-order terms become too slow to close the {\\it a priori} assumption. On the other hand, the presence of diffusion waves yields problematic error terms in the perturbation system. In this work, we introduce a new transformation to ensure that both left-right structural conditions hold for the perturbation system. Additionally, using the fact that the derivative of the entropy wave maintains a fixed sign, we employ well-designed weighted energy estimates to control the slowly decaying terms. This enables us to establish asymptotic stability and derive the optimal decay rate. Furthermore, we address the case of initial perturbations with the zero mass condition and obtain the optimal decay rate by additionally developing a Poincaré type inequality and a key cancellation.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15488v1",
    "categories": ["math.CA"],
    "authors": ["Rocío Ayala", "Fabio Berra", "Gladis Pradolini"],
    "title": "Revisiting mixed weak inequalities of Fefferman-Stein type for commutators of Calderón-Zygmund operators: an improvement",
    "abstract": "In this paper we establish mixed weak inequalities of Fefferman-Stein type for Calderón-Zygmund operators and their commutators, improving some previous results known in the literature. The main estimates also generalize the classical weighted weak Fefferman-Stein inequalities proved in [19] and [22]. In order to obtain the main results, our approach is to give a strong Fefferman-Stein type inequality for the operators involved with respect to an adequate measure.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15457v1",
    "categories": ["math.OC"],
    "authors": ["Ziheng Su", "Huifu Xu"],
    "title": "Existence and Uniqueness Theorem of Continuous and Monotone Bayesian Nash Equilibrium and Stability Analysis",
    "abstract": "Since the seminal work by Meirowitz, there has been growing attention on the existence and uniqueness of continuous Bayesian Nash equilibria. In the existing literature, existence is typically established using Schauder's fixed-point theorem, relying on the equicontinuity of players' best response functions. Uniqueness, on the other hand, is usually derived under additional monotonicity conditions. In this paper, we revisit the issues of existence and uniqueness, and advance the literature by establishing both simultaneously using the Banach fixed-point theorem under a set of moderate conditions. Furthermore, we analyze the stability of such equilibria with respect to perturbations in the joint probability distribution of type parameters, offering theoretical support for the application of Bayesian Nash equilibrium models in data-driven contexts.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15410v1",
    "categories": ["math.CT", "quant-ph"],
    "authors": ["Jan Paseka", "Thomas Vetterlein"],
    "title": "Axiomatising the dagger category of complex Hilbert spaces",
    "abstract": "We axiomatise the dagger category of complex Hilbert spaces and bounded linear maps, using exclusively purely categorical conditions. Our axioms are chosen with the aim of an easy interpretability: two of them describe the composition of objecs, two further ones deal with the decomposition of objects, and a final axiom expresses a symmetry property.\n  The categorical reconstruction of complex Hilbert spaces addresses foundational issues in quantum physics. We present a simplified alternative to recent characterisations.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15373v1",
    "categories": ["math.ST"],
    "authors": ["Eitan Greenshtein"],
    "title": "Consistent Empirical Bayes Estimation of the Mean of a Mixing Distribution with Applications to Treatment of Nonresponse",
    "abstract": "We consider a Nonparametric Empirical Bayes (NPEB) framework. Let $Y_i$ be random variables, $Y_i \\sim f(y|θ_i)$, $i=1,...,n$, where $θ_i \\sim G$, and $θ_i \\in Θ$ are independent. The variables $Y_i $ are conditionally independent given $θ_i, \\; i=1,...,n$. The mixing distribution $G$ is unknown and assumed to belong to a nonparametric class\n  $\\{G \\}$.\n  Let $η(θ)$ be a function of $θ$. We address the problem of consistently estimating $E_G η(θ) \\equiv η_G$. This problem becomes particularly challenging when $G$ cannot be consistently estimated from the observed data.\n  We motivate this problem, especially in contexts involving nonresponse and missing data. For such cases, a consistent estimation method is suggested and its performance is demonstrated through simulations.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15261v1",
    "categories": ["math.AP", "math.NA"],
    "authors": ["Chaohua Duan", "Yan Jiang", "Hongyu Liu", "Wenjian Peng"],
    "title": "A Wave Front Tracking Scheme for Flux Reconstruction in $2\\times 2$ Hyperbolic Conservation Laws",
    "abstract": "This paper introduces a novel wave front tracking framework for reconstructing unknown flux functions in $2\\times 2$ hyperbolic conservation laws, extending beyond the well-studied scalar case. By analyzing Riemann solutions at fixed observation times, we develop explicit reconstruction formulas that handle arbitrary combinations of shock and rarefaction waves through a unified equivalent shock concept. Our method constructs piecewise quadratic $C^1$ flux approximations with rigorous convergence guarantees: the approximation errors decrease quadratically with the discretization parameters for function values and linearly for derivatives under $C^{1,1}$ regularity, with enhanced cubic and quadratic convergence respectively under $C^3$ regularity. Applications to the isentropic Euler equations and the mathematically equivalent p-system in compressible fluid dynamics demonstrate the method's capability to identify complete equations of state from limited dynamic measurements, providing a systematic approach to a fundamental inverse problem in continuum mechanics.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15254v1",
    "categories": ["math.OC"],
    "authors": ["Xiaozhi Liu", "Yong Xia"],
    "title": "Mini-Extragradient Methods",
    "abstract": "The Extragradient (EG) method stands as a cornerstone algorithm for solving monotone nonlinear equations but faces two important unresolved challenges: (i) how to select stepsizes without relying on the global Lipschitz constant or expensive line-search procedures, and (ii) how to reduce the two full evaluations of the mapping required per iteration to effectively one, without compromising convergence guarantees or computational efficiency. To address the first challenge, we propose the Greedy Mini-Extragradient (Mini-EG) method, which updates only the coordinate associated with the dominant component of the mapping at each extragradient step. This design capitalizes on componentwise Lipschitz constants that are far easier to estimate than the classical global Lipschitz constant. To further lower computational cost, we introduce a Random Mini-EG variant that replaces full mapping evaluations by sampling only a single coordinate per extragradient step. Although this resolves the second challenge from a theoretical standpoint, its practical efficiency remains limited. To bridge this gap, we develop the Watchdog-Max strategy, motivated by the slow decay of dominant component magnitudes. Instead of evaluating the full mapping, Watchdog-Max identifies and tracks only two coordinates at each extragradient step, dramatically reducing per-iteration cost while retaining strong practical performance. We establish convergence guarantees and rate analyses for all proposed methods. In particular, Greedy Mini-EG achieves enhanced convergence rates that surpass the classical guarantees of the vanilla EG method in several standard application settings. Numerical experiments on regularized decentralized logistic regression and compressed sensing show speedups exceeding $13\\times$ compared with the classical EG method on both synthetic and real datasets.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15234v1",
    "categories": ["math.AP"],
    "authors": ["Guocong Shang"],
    "title": "Global Existence for Coupled 3-D Nonlinear Wave and Klein-Gordon Equations with Large Derivatives of Initial Data",
    "abstract": "We consider the Cauchy problem of coupled 3-D wave and Klein-Gordon equations with a quadratic form of nonlinearity. We show global existence under several conditions, including large derivative data for wave equations and the null conditions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15233v1",
    "categories": ["math.AP"],
    "authors": ["Goksu Oruc"],
    "title": "On the Long Time Existence of a Fractional KdV-BBM Type Equation",
    "abstract": "We consider a fractional Korteweg de Vries-Benjamin Bona Mahony (KdV-BBM) type equation including both fractional dispersive terms of fractional KdV and fractional BBM equations. We aim to enhance the existence time of solutions with small initial data $|| u_0||_{H^{N+α/2}}= ε$ from $\\frac{1}ε$ to $\\frac{1}{ε^2}$. The proof relies on the combination of a modified energy method with Fourier techniques. In addition, the long time existence issues are investigated numerically. Numerical observations of the lifespan give an evidence of existence of solutions beyond the hyperbolic time scale. This study provides a detailed analysis from both analytical and numerical aspects for the existence of smooth solutions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15231v1",
    "categories": ["math.AP"],
    "authors": [
      "Ali Haider Shah",
      "Naveed R. Butt",
      "Asif Ahmad",
      "Muhammad Omer Bin Saeed"
    ],
    "title": "Solving Newell-Whitehead-Segel and Allen-Cahn Equations Employing Physics-Informed Neural Networks: A Comparative Analysis with Spline Methods",
    "abstract": "This study focuses on the solution of partial differential equations (PDEs) by using physics-informed neural networks (PINNs). The Newell-Whitehead-Segel (NWS) equation and the Allen-Cahn equation belong to fundamental PDEs used mostly in various scientific disciplines. Different methods, including analytical and numerical approaches, have been proposed for solving these equations alongside the recently introduced PINN method. This study provides a detailed and comprehensive comparison between the developed PINN method and the state-of-the-art spline numerical solution for the NWS and Allen-Cahn equation. Furthermore, the computational time of the trained PINN models is evaluated to determine their computational efficiency. The findings show that PINN is significantly better than spline methods in solving both problems.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15230v1",
    "categories": ["math.NA"],
    "authors": ["Can Huang", "Weiwen Wang", "Chuanju Xu"],
    "title": "An efficient fully explicit scheme for stochastic Navier-Stokes equations driven by multiplicative noise",
    "abstract": "This work proposes an efficient, linear, and fully decoupled pressure-correction scheme for the 2D stochastic Navier-Stokes equations with multiplicative noise and Dirichlet boundary condition. Leveraging the auxiliary variable approach, the scheme is fully explicit yet unconditionally stable. At each time step, it only requires solving Poisson-type equations with constant coefficients. To the best of our knowledge, this is the first application of the auxiliary variable method to stochastic Navier-Stokes equations. We provide a detailed strong convergence analysis for the linearized equation under standard assumptions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15213v1",
    "categories": ["math.FA"],
    "authors": [
      "António Caetano",
      "Simon N. Chandler-Wilde",
      "David P. Hewett"
    ],
    "title": "Properties of IFS attractors with non-empty interiors, related rough domains, and associated function spaces and scattering problems",
    "abstract": "We study fractal sets $Γ\\subset \\mathbb{R}^n$ with non-empty interior $Ω$, that are attractors of iterated function systems (IFSs) of contracting similarities satisfying the open set condition. Examples for $n=2$ are the closures of the Koch snowflake domain and the Gosper island domain. Our first result is that $Ω$ is thick in the sense of Triebel. A consequence is that $C_0^\\infty(Ω)$ is dense in the Sobolev space $H^s_Γ:= \\{φ\\in H^s(\\mathbb{R}^n): \\mathrm{supp}(φ)\\subset Γ\\}$ for all $s\\in\\mathbb{R}$. Our second result, accompanied by results on pointwise multiplication by characteristic functions and uniform extension operators, is that the spaces $\\{H^s(Ω)\\}_{s\\in \\mathbb{R}}$, where $H^s(Ω):=\\{φ|_Ω: u\\in H^s(\\mathbb{R}^n)\\}$, form an interpolation scale. This is established as a special case of new extension and interpolation results for Besov and Triebel-Lizorkin spaces, applying to large classes of domains $Ω$ that are thick and have boundary with Assouad dimension $<n$. Our third contribution is to prove best approximation error estimates in fractional negative-order Sobolev spaces for piecewise constant approximations on a ``fractal mesh'' of $Γ$, generated by the IFS, in which the mesh elements are self-similar copies of $Γ$. As an application we study sound-soft acoustic scattering in $\\mathbb{R}^{n+1}$ by the fractal screen $Γ\\times \\{0\\}$. Using our density result we prove that the standard PDE formulation of this problem is equivalent to the standard first kind boundary integral equation in which the boundary condition is imposed by restriction to the (relative) interior of the screen. To solve this equation we consider a piecewise-constant Galerkin boundary element method on a fractal mesh, and, using our best approximation error estimates, we prove convergence rates for the Galerkin approximation.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15185v1",
    "categories": ["math.AP"],
    "authors": ["Ricardo Alonso", "Zongguang Li"],
    "title": "Well-posedness and time-asymptotic of Boltzmann equations for monatomic and polyatomic mixtures",
    "abstract": "This paper considers a system of Boltzmann equations modelling the mixture of monatomic and polyatomic gases in an $L^{2}-L^{\\infty}$ perturbation theory around global modified Maxwellians accounting for the internal energy of the mixture in the whole space and the torus. We investigate the pointwise decay in velocity and internal energy of the linearized Boltzmann operators in the four types of collisions. A novel approach is developed to deal with the additional internal energy variable $I\\in \\mathbb{R}_+$ and the loss of symmetry due to dissimilar masses of the mixture components. Subsequently, we carry out a classical $L^2-L^\\infty$ method to establish the well-posedness theory of the system. The optimal polynomial time decay rate on the whole space is obtained accordingly based on the spatial Fourier's study of the linearized system. The analysis shows the structure of a perturbed Euler-type model for the solution's macroscopic quantities: density, bulk velocity, and temperature, near the steady state, which gives a potential application to investigate fluid limit problems. In addition, this work proves exponential time decay in the torus and fills the gap of classical multi-species Boltzmann in the whole space.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15176v1",
    "categories": ["math.OC"],
    "authors": ["Yuchen Li", "Zongxia Liang", "Xiang Yu"],
    "title": "Mean-Field Game of Relative Performance Portfolio for Two Populations with Poisson Common Noise",
    "abstract": "This paper studies the mean field game (MFG) and N-player game on relative performance portfolio management with two heterogeneous populations. In addition to the Brownian idiosyncratic and common noise, the first population invests in assets driven by idiosyncratic Poisson jump risk, while the second population invests in assets subject to Poisson common noise. We establish the characterization of the mean-field equilibrium (MFE) in MFG with two populations as well as the Nash equilibrium in the $N_1+N_2$-player game. Furthermore, we prove the convergence of the Nash equilibrium in the $N_1+N_2$-player game to the MFE as the number of players in two populations tends to infinity. We also discuss some impacts on MFE by the Poisson idiosyncratic risk and Poisson common noise in the context of relative performance, compensated by some numerical examples and financial implications.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15157v1",
    "categories": ["math.AP"],
    "authors": ["Yangkendi Deng", "Chenjie Fan", "Zehua Zhao"],
    "title": "Sharp $L^4$ Strichartz estimate for Hyperbolic Schrödinger equation on $\\mathbb{R}\\times \\mathbb{T}$",
    "abstract": "We prove the sharp $L^4$ Strichartz estimate without derivative loss for the hyperbolic Schrödinger equation on $\\mathbb{R}\\times\\mathbb{T}$, \\begin{equation} \\|e^{it (\\partial_{x_{1}}^2-\\partial_{x_{2}}^2)} φ\\|_{L^4_{t,x_{1},x_{2}}([0,1]\\times \\mathbb{R} \\times \\mathbb{T})}\\lesssim \\|φ\\|_{L_{x_{1},x_{2}}^2(\\mathbb{R} \\times \\mathbb{T})}, \\end{equation} which serves as the hyperbolic analogue of the classical result of Takaoka-Tzvetkov \\cite{takaoka20012d}. The proof is based on the combination of a robust kernel decomposition method with precise measure estimates for semi-algebraic sets. As an immediate application, we establish the global well-posedness for the cubic hyperbolic Schrödinger equation on $\\mathbb{R}\\times\\mathbb{T}$ in the $L^2$-critical space with sufficiently small initial data.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15126v1",
    "categories": ["math.AG"],
    "authors": ["Xiaohuan Long", "Yibin Wang", "Xiangdong Wu", "Ru Yi"],
    "title": "$G$-gerbes on perfectoid spaces",
    "abstract": "Let $K$ be a complete non-archimedean field over $\\mathbb{Q}_p$, $G$ be a rigid group over $K$, and $X$ be a perfectoid space over $K$. We consider the natural morphism of sites $ν: X_v \\to X_{\\mathrm{\\acute{e}t}}$. It is known from work of Heuer that the direct image functor $ν_*$ induces an equivalence of the categories of $G$-torsors. In this article, we show that there is an equivalence of 2-categories of $G$-gerbes on these two topologies.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15671v1",
    "categories": ["cs.IT"],
    "authors": ["Mihir Rao"],
    "title": "Information Efficiency of Scientific Automation",
    "abstract": "Scientific discovery can be framed as a thermodynamic process in which an agent invests physical work to acquire information about an environment under a finite work budget. Using established results about the thermodynamics of computing, we derive finite-budget bounds on information gain over rounds of sequential Bayesian learning. We also propose a metric of information-work efficiency, and compare unpartitioned and federated learning strategies under matched work budgets. The presented results offer guidance in the form of bounds and an information efficiency metric for efforts in scientific automation at large.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15653v1",
    "categories": ["math.AT", "math.RT"],
    "authors": ["Guy Boyde"],
    "title": "The dga of planar loops when $2n=4$",
    "abstract": "The dga of planar loops was introduced in recent work of the author, Boyd, Randal-Williams, and Sroka, where a minimal model for it was given. This dga enjoys two natural `reflection' involutions. In the first nontrivial case, $2n=4$, we give a new model which incorporates these involutions, as well as a more explicit description of the existing model.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15625v1",
    "categories": ["math.FA"],
    "authors": ["Pu-Ting Yu"],
    "title": "Spectrum of normal operators that generate certain scalable iterative systems",
    "abstract": "Let $A\\colon H\\rightarrow H$ be a normal operator on an infinite-dimensional separable Hilbert space $H$ and let $S\\subseteq H$ be a finite subset such that $\\{A^nx\\}_{n\\geq 0,\\,x\\in S}$ can be rescaled to form a frame for $H$. That is, there exist some subsets $J_x\\subseteq \\mathbb{N}\\cup\\{0\\}$ and some set of nonzero scalars $(c_{n,x})_{n\\in J_x,\\,x\\in S}$ such that $\\{c_{n,x}A^nx\\}_{n\\in J_x,\\,x\\in S}$ forms a frame for $H.$ Assume that there exist some $η\\in\\mathbb{N}$ and $δ>0$ such that for each infinite $J_x$ there is an increasing syndetic subsequence $(n^x_{k})_{k\\in \\mathbb{N}}\\subseteq J_x$ satisfying $|c_{n^x_{k},x}|\\|A^{i^x_{k}}x\\|\\geq δ$ for some non-negative integers $i^x_{k}$ with $|i^x_{k}- n^x_{k}|\\leq η$ for all $k\\in \\mathbb{N}$. We prove that there exist finitely many numbers $(r_i)_{i=1}^N$ such that the continuous spectrum of $A$ is concentrated on arcs of a circle centered at origin with radius $r_i$. In particular, $A$ must be a diagonal operator if $S$ is a singleton.\n  As an application, we establish the conjecture proposed by Aldroubi et al.\\ asserting that the iterative system $\\{\\frac{A^nx}{\\|A^nx\\|}\\}_{n\\geq 0,\\,x\\in S}$ is never a frame for $H$, provided one of the following two conditions holds: (i) The continuous spectrum of $A$ contains more than $|S|-1$ points with distinct moduli; (ii) $S$ is a singleton and $A$ is not a diagonal operator",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15612v1",
    "categories": ["math.ST", "cs.IT", "eess.SP", "math.DG"],
    "authors": ["Sunder Ram Krishnan"],
    "title": "Cartan meets Cramér-Rao",
    "abstract": "This paper develops a jet bundle and Cartan geometric foundation for the curvature-aware refinements of the Cramér-Rao bound (CRB) introduced in our earlier work. We show that the extrinsic corrections to variance bounds, previously derived from the second fundamental form of the square root embedding $s_θ=\\sqrt{f(\\cdot;θ)}\\in L^2(μ)$ for model density $f(\\cdot;θ)$ with scalar parameter $θ$, admit an intrinsic formulation within the Cartan prolongation framework. Starting from the canonical contact forms and total derivative on the finite jet bundle $J^m(\\mathbb{R}\\times \\mathbb{R})$, we construct the Cartan distribution and the associated Ehresmann connection, whose non-integrability and torsion encode the geometric source of curvature corrections in statistical estimation. In the statistical jet bundle $E=\\mathbb{R}\\times L^2(μ)$, we point out that the condition for an estimator error to lie in the span of derivatives of $s_θ$ up to order $m$ is equivalent to the square root map satisfying a linear differential equation of order~$m$. The corresponding submanifold of $J^m(E)$ defined by this equation represents the locus of $m$-th order efficient models, and the prolonged section must form an integral curve of the restricted Cartan vector field. This establishes a one-to-one correspondence between algebraic projection conditions underlying CRB and Bhattacharyya-type bounds and geometric integrability conditions for the statistical section in the jet bundle hierarchy. The resulting framework links variance bounds, curvature, and estimator efficiency through the geometry of Cartan distributions, offering a new differential equation and connection-theoretic interpretation of higher-order information inequalities.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15629v1",
    "categories": ["math.OC", "eess.SY"],
    "authors": ["Thomas Lee", "Andy Sun"],
    "title": "GPU-Accelerated Dynamic Programming for Multistage Stochastic Energy Storage Arbitrage",
    "abstract": "We develop a GPU-accelerated dynamic programming (DP) method for valuing, operating, and bidding energy storage under multistage stochastic electricity prices. Motivated by computational limitations in existing models, we formulate DP backward induction entirely in tensor-based algebraic operations that map naturally onto massively parallel GPU hardware. Our method accommodates general, potentially non-concave payoff structures, by combining a discretized DP formulation with a convexification procedure that produces market-feasible, monotonic price-quantity bid curves. Numerical experiments using ISO-NE real-time prices demonstrate up to a 100x speedup by the proposed GPU-based DP method relative to CPU computation, and an 8,000x speedup compared to a commercial MILP solver, while retaining sub-0.3% optimality gaps compared to exact benchmarks.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15103v1",
    "categories": ["math.AP"],
    "authors": ["Wenliang Pei", "Chonghao Deng"],
    "title": "Normalized solutions to subcritical Choquard systems with double couplings",
    "abstract": "We consider the Choquard system with both linear and nonlinear couplings\n  $-Δu + μ_1 u =λ_1 ( I_α* |u|^{r_1} ) |u|^{r_1-2} u + βp( I_α* |v|^q)|u|^{p-2} u + κv,$\n  $-Δv + μ_2 v =λ_2 ( I_α* |v|^{r_2} ) |v|^{r_2-2} v + βq( I_α* |u|^p)|v|^{q-2} v + κu , $\n  $\\int_{\\mathbb{R}^N} u^2 = ρ_1^2\\, , \\int_{\\mathbb{R}^N} v^2 = ρ_2^2,$ where $N \\in \\{3,4\\}$, $λ_1, λ_2, β, κ, ρ_1,ρ_2 > 0$, $2_{α,*} :=\\frac{N+α}{N} <p,q , r_1, r_2 <2_α^*:=\\frac{N+α}{N-2}$ and $p+q\\leq 2r_1 \\leq 2r_2$ . We investigate a classification result as the parameters $p+q$, $2r_1$ and $2r_2$ vary across the ranges $(\\frac{2N+2α}{N},\\frac{2N+2α+4}{N})$,\n  $\\{\\frac{2N+2α+4}{N}\\}$, and $(\\frac{2N+2α+4}{N},\\frac{2N+2α}{N-2})$. Employing variational methods, we demonstrate the existence of a normalized ground state for the system in the mass subcritical, critical, and supercritical cases.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15078v1",
    "categories": ["math.SG", "math.AG", "math.AT"],
    "authors": ["Ángel Rodríguez--López"],
    "title": "Computable Sheaf Invariants for Legendrian Rainbow Closures",
    "abstract": "For any Legendrian link in $\\displaystyle \\mathbb{R}^{3}$ given by the rainbow closure of a positive braid word, we develop an explicit and computable description of a Legendrian isotopy invariant associated with it, namely the cohomological category of compactly supported, microlocal rank-one sheaves with singular support on the Legendrian link. In particular, we parametrize the objects of the category by points of a braid variety, and for any pair of objects, we provide a linear map that algebraically characterizes their possible non-trivial graded morphism spaces. In addition, we provide combinatorial rules governing the compositions of graded morphisms in the category under consideration. Finally, we present several applications of our results, highlighting the structural features captured by the categorical invariant of interest.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15050v1",
    "categories": ["math.AP"],
    "authors": ["Wei-Xi Li", "Zhan Xu", "Ping Zhang"],
    "title": "Global Gevrey solution of 3D anisotropic Navier-Stokes system in a strip domain",
    "abstract": "We investigate the three-dimensional (3D) incompressible anisotropic Navier-Stokes system with dissipation only in the horizontal variables, posed in a strip domain. To overcome the difficulties arising from the boundary terms and the absence of vertical dissipation, we impose a Gevrey-class regularity condition in the vertical direction. For the remaining directions, we prove that the solution exhibits space-time analytic or Gevrey-class regularization. Furthermore, the solution is shown to possess an enhanced Gevrey regularity in the direction of strong diffusion, which is unconstrained by boundaries.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15039v1",
    "categories": ["math.AP"],
    "authors": ["Kousuke Kuto", "Yaping Wu"],
    "title": "The existence and instability of blowing-up steady states for the Shigesada-Kawasaki-Teramoto competition model with cross-diffusion",
    "abstract": "We investigate the existence and instability of a class of blowing-up positive steady states arising in a shadow system of the Shigesada-Kawasaki-Teramoto (SKT) two-species competition model, as well as in the corresponding perturbed SKT model with a sufficiently large cross-diffusion coefficient and bounded random diffusion parameters. In their classical work (Lou-Ni, 1999), it was shown that, under the limit where one cross-diffusion parameter tends to infinity, coexistence steady states of the SKT model are characterized by three types of shadow systems. In a previous study (Kuto, 2015), the first author analyzed one of these shadow systems in one space dimension (the second shadow system) and proved that a component of a bifurcating branch blows up as the bifurcation parameter approaches the first positive Neumann eigenvalue of $-Δ$. In the present paper, using a new approach based on suitable transformations and the Lyapunov-Schmidt reduction method, we derive the existence and detailed asymptotic structure of several branches of positive steady states near blow-up points for shadow systems with one or two cross-diffusion terms, in both one- and multi-dimensional domains. We further show that all such large-amplitude steady state branches are spectrally unstable. Moreover, by means of perturbation arguments, we establish the existence and instability of corresponding branches of perturbed positive steady states for the original SKT model when one cross-diffusion coefficient is sufficiently large.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14979v1",
    "categories": ["math.FA", "math.NA"],
    "authors": [
      "Soma Hirai",
      "Ryoto Watanabe",
      "Yuki Nishida",
      "Masashi Iwasaki"
    ],
    "title": "Transformation from integral operator with separable kernel to matrix in eigenvalue problem",
    "abstract": "This paper investigates the eigenvalue problem of integral operators whose kernels can be expressed as a finite sum of pairwise products of single-variable functions, making them separable. By consdiering the matrix form of the separable kernel in the integral operator, we establish the relationship between the eigenvalues and eigenfunctions of the integral operator and the eigenpairs of a matrix. We next generalize the eigenfunction of an integral operator based on the concept of generalized eigenvectors of matrices, and show that solving the Fredholm integral equation of the second kind reduces to computing matrix eigenpairs and generalized eigenvectors. We also provide several examples to validate our results.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14944v1",
    "categories": ["math.DS"],
    "authors": ["Jashan Bal"],
    "title": "Projectivity in topological dynamics",
    "abstract": "We study projectivity in the category of $G$-flows and affine $G$-flows for Polish groups $G$. We also introduce the notion of \\emph{proximally irreducible} extensions between affine $G$-flows. Using this we provide a characterization of extreme amenability, strong amenability, and amenability for closed subgroups $H \\leq G$ in terms of certain ``dynamical irreducibility'' properties of the Samuel compactification of $G/H$. We then apply this to answer an open question of Zucker by proving a structure theorem for when the universal minimal proximal flow of $G$ is metrizable or contains a comeager orbit.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14935v1",
    "categories": ["math.OC"],
    "authors": [
      "Peter Benner",
      "Volker Mehrmann",
      "Anshul Prajapati",
      "Punit Sharma"
    ],
    "title": "Computation of structured stability radii for Dissipative-Hamiltonian systems",
    "abstract": "We study linear time-invariant Dissipative Hamiltonian (DH) systems arising in energy-based modeling of dynamical systems. An advantage of DH systems is that they are always stable due to the structure of their coefficient matrices, and, under further weak conditions, even asymptotically stable. In this paper, we discuss the computation of the stability radii for a given asymptotically stable DH system; i.e., the smallest structured perturbation that puts a DH system on the boundary of the region of asymptotic stability, so that it has purely imaginary eigenvalues. We obtain explicit computable formulas for various structured stability radii. For this, the problem of computing stability radii is reformulated in terms of minimizing the Rayleigh quotient of a Hermitian matrix or the sum of two generalized Rayleigh quotients of Hermitian semidefinite matrices. This reformulation results in the problem of minimizing the largest eigenvalue of an eigenvector-dependent Hermitian matrix or minimizing the smallest eigenvalue of a Hermitian matrix which depends on the eigenvector. It is also demonstrated (via numerical experiments) that, under structure-preserving perturbations, the asymptotic stability of a DH system is much more robust than under general perturbations, since the distance to instability is typically much larger when structure-preserving perturbations are considered. Finally, similar results are obtained for optimally robust representations of stable systems.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14873v1",
    "categories": ["math.FA", "math-ph", "math.OC"],
    "authors": ["Ryshard-Pavel Kostecki"],
    "title": "Vaĭnberg--Brègman geometry and quasinonexpansive operators",
    "abstract": "We obtain an array of new results in the theory of Vaĭnberg--Brègman relative entropies and quasinonexpansive operators on reflexive Banach spaces, and we also develop an extension of this theory to nonreflexive Banach spaces, providing a joint generalisation of the reflexive approach with the finite-dimensional information geometric approach. In the reflexive case, we study generalised pythagorean inequality, as well as norm-to-norm, uniform, and Lipschitz--Hölder continuity of entropic projections, proximal maps, and resolvents. We also provide a detailed account of the family of Vaĭnberg--Brègman geometries that are naturally encoding the geometric properties of the underlying Banach space norm. The extended theory belongs to the intersection of convex theoretic and homeomorphic approaches to nonlinear analysis. Its models are constructed using integration theory on order unit spaces. Our main focus is on geometry of, and nonlinear quasinonexpansive operators on, normal state spaces of JBW- and W*-algebras, modelled via nonlinear embeddings into reflexive rearrangement invariant spaces. For example, we analyse the extended Vaĭnberg--Brègman geometries induced by norm geometry of noncommutative and nonassociative L$_p$ spaces via Mazur embeddings, providing sufficient conditions for monoidal composability of extended quasinonexpansive operators, and computing the exponent parameters of Lipschitz--Hölder continuity of the corresponding extended entropic projections and resolvents. Other models feature the (commutative and noncommutative) Lozanovskiĭ factorisation map, generalised spin factors, finite dimensional base normed spaces, and convex spectral functions on unitarily invariant ideals of compact operators. We also discuss several categories of entropic projections and quasinonexpansive operators naturally appearing in this framework.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15602v1",
    "categories": ["math.GR", "math.CO"],
    "authors": [
      "Midhuna V Ajith",
      "Peter J Cameron",
      "Mainak Ghosh",
      "Aparna Lakshmanan S"
    ],
    "title": "Endomorphism and automorphism graphs of finite groups",
    "abstract": "Let $G$ be a group. The directed endomorphism graph, $\\dend(G)$ of $G$ is a directed graph with vertex set $G$ and there is a directed edge from the vertex $a$ to the vertex $b$ if $a \\neq b$ and there exists an endomorphism on $G$ mapping $a$ to $b$. The endomorphism graph, $\\uend(G)$ is the corresponding undirected simple graph. The automorphism graph of $G$ is similarly defined for automorphisms: it is a disjoint union of complete graphs on the orbits of $\\Aut(G)$. The endomorphism digraph is a special case of a digraph associated with a transformation monoid, and we begin by introducing this. We have explored graph theoretic properties like size, planarity, girth etc. and tried finding out for which types of groups these graphs are complete, diconnected, trees, bipartite and so on, as well as computing these graphs for some special groups. We conclude with examples showing that things are not always simple.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15419v1",
    "categories": ["math.ST", "math.AG"],
    "authors": [
      "Mathias Drton",
      "Elizabeth Gross",
      "Dimitra Kosta",
      "Anton Leykin",
      "Seth Sullivant",
      "Daniel Windisch"
    ],
    "title": "Singular Learning Theory for Factor Analysis",
    "abstract": "Watanabe's singular learning theory provides a framework for asymptotic analysis of Bayesian model selection for statistical models with singularities, where traditional statistical regularity assumptions fail. Learning coefficients, also known as real log canonical thresholds, play a central role in singular learning, as they govern the asymptotic behavior of Bayesian marginal likelihood integrals in settings where the Laplace approximations used for regular statistical models are not applicable. Learning coefficients are algebraic invariants that quantify the geometric complexity of a model and reveal how the singular structure impacts the model's generalization properties. In this paper, we apply algebraic methods to study the learning coefficients of factor analysis models, which are widely used latent variable models for continuously distributed data. Our main results provide a general upper bound for the learning coefficients as well as exact formulas for specific cases.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15662v1",
    "categories": ["math.DS"],
    "authors": [
      "Kostiantyn Drach",
      "Zhi Fu",
      "Vadim Kaloshin",
      "Zhiqiang Li",
      "Carlangelo Liverani"
    ],
    "title": "Normal distribution of Lyapunov exponents of periodic orbits for expanding circle maps",
    "abstract": "For a smooth expanding circle map, we show that the empirical distribution of Lyapunov exponents of periodic points of any fixed period is close to normal, with an error that decreases as the period grows. This establishes a version of the Central Limit Theorem for such finite periodic orbits.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14883v1",
    "categories": ["math.AP"],
    "authors": ["Bernhard Aigner", "Marcus Waurick"],
    "title": "Evolutionary equations with state-dependent delay",
    "abstract": "We extend a contraction mapping argument for ordinary state-dependent delay differential equations to evolutionary partial differential equations in the sense of R. Picard, that is, to equations of the form $\\bigl(\\partial_{t} M(\\partial_{t}) + A\\bigr) u(t) = F\\bigl(t,u_{(t)}\\bigr)$, where $A$ is an $\\mathrm{m}$-accretive (unbounded) linear operator and $M$ is a material law. We establish local well-posedness (in the sense of weak solutions) of generalized initial value problems that stem from a distributional formulation. We require prehistories in $H^{1}$ with bounded derivative, a regularity increasing right-hand side and a consistency condition. We showcase the viability of our results by applying them to classical examples (heat, wave and Maxwell's equations), examples from semigroup theory, port-Hamiltonian systems, as well as equations featuring fractional derivatives and convolutions (in time) with bounded operators.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14812v1",
    "categories": ["math.ST", "stat.ME"],
    "authors": ["Charles D. Coleman"],
    "title": "The Asymptotic Equivalence of Level-Based and Share-Based Loss Functions",
    "abstract": "Level-based and share-based loss functions are asymptotically equivalent if, in the limit, their averages converge almost surely to a constant ratio. These loss functions take a target value and its realization as arguments and are often used to measure accuracy. The equivalence is proved for a large class of loss functions, the weighted exponentiated functions, when the weights are decomposable as a particular product form. An upshot is that when losses are averaged for a large number of units, differences in ratios and, hence, ranks, are negligible, when the average (or summed) difference between the target values and their realizations is around zero. This implies the almost sure asymptotic convergence of numerical and distributive accuracy when using these loss functions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15668v1",
    "categories": ["math.AP"],
    "authors": ["Bartosz Bieganowski", "Daniel Strzelecki"],
    "title": "Nonlinear scalar field equations with a critical Hardy potential",
    "abstract": "We study the existence of solutions for the nonlinear scalar field equation $$-Δu - \\frac{(N-2)^2}{4|x|^2} u = g(u), \\quad \\mbox{in } \\mathbb{R}^N \\setminus \\{0\\},$$ where the potential $-\\frac{(N-2)^2}{4|x|^2}$ is the critical Hardy potential and $N \\geq 3$. The nonlinearity $g$ is continuous and satisfies general subcritical growth assumptions of the Berestycki-Lions type. The problem is approached using variational methods within a non-standard functional setting. The natural energy functional associated with the equation is defined on the space $X^1(\\mathbb{R}^N)$, which is the completion of $H^1(\\mathbb{R}^N)$ with respect to the norm induced by the quadratic part of the functional. We establish the existence of a nontrivial solution $u_0 \\in X^1(\\mathbb{R}^N)$ that satisfies the Pohožaev constraint $\\mathcal{M}$ and minimizes the energy functional on $\\mathcal{M}$. Furthermore, assuming $g$ is odd, we prove the existence of at least one non-radial solution.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15664v1",
    "categories": ["math-ph", "quant-ph"],
    "authors": [
      "Houssam Abdul-Rahman",
      "Christopher Cedzich",
      "Günter Stolz",
      "Albert H. Werner"
    ],
    "title": "Exponential Suppression of Transport in Electric Quantum Walks",
    "abstract": "We establish exact scalings for the maximal group velocity of translation-invariant quantum walks in periodic electric fields. Our main result shows that the maximal group velocity decays exponentially with the period of the field in the whole parameter range, thus affirming a conjecture of arXiv:2302.01869 and at the same time augmenting it to an exact equality. We further demonstrate explicit revival relations and characterize the absolutely continuous spectrum in these models. Our results apply directly also to generalized CMV matrices.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15663v1",
    "categories": ["math.LO"],
    "authors": [
      "Claudio Agostini",
      "Nick Chapman",
      "Luca Motto Ros",
      "Beatrice Pitton"
    ],
    "title": "Generalized Borel Sets",
    "abstract": "Generalizing classical descriptive set theory opens foundational questions about the Borel hierarchy. In this paper we systematically study those questions, working in the general framework of Polish-like spaces relative to an uncountable cardinal $κ$, possibly singular, satisfying $2^{<κ}=κ$. We provide fundamental properties of the $κ^+$-Borel hierarchy of any regular Hausdorff space of weight at most $κ$, and establish sufficient conditions for its non-collapse. We highlight a unique phenomenon that arises in the case of singular cardinals, namely, the existence of a second, distinct Borel hierarchy, the $κ$-Borel hierarchy: we prove that it is strictly finer than the $κ^+$-Borel hierarchy, and then characterize the precise relationship between the two. Finally, for regular cardinals, we resolve three questions about the behavior of the $κ^+$-Borel hierarchy on subspaces of the generalized Baire space ${}^κκ$, constructing various models via forcing where several nontrivial constellations for the length of the $κ^+$-Borel hierarchy on the space are realized.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15583v1",
    "categories": ["math.NA"],
    "authors": ["Alberto Bucci", "Yuji Nakatsukasa", "Taejun Park"],
    "title": "Numerical Stability of the Nyström Method",
    "abstract": "The Nyström method is a widely used technique for improving the scalability of kernel-based algorithms, including kernel ridge regression, spectral clustering, and Gaussian processes. Despite its popularity, the numerical stability of the method has remained largely an unresolved problem. In particular, the pseudo-inversion of the submatrix involved in the Nyström method may pose stability issues as the submatrix is likely to be ill-conditioned, resulting in numerically poor approximation. In this work, we establish conditions under which the Nyström method is numerically stable. We show that stability can be achieved through an appropriate choice of column subsets and a careful implementation of the pseudoinverse. Our results and experiments provide theoretical justification and practical guidance for the stable application of the Nyström method in large-scale kernel computations.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15530v1",
    "categories": ["math.NA", "cs.LG"],
    "authors": ["Max Hirsch", "Federico Pichi"],
    "title": "Convergence and Sketching-Based Efficient Computation of Neural Tangent Kernel Weights in Physics-Based Loss",
    "abstract": "In multi-objective optimization, multiple loss terms are weighted and added together to form a single objective. These weights are chosen to properly balance the competing losses according to some meta-goal. For example, in physics-informed neural networks (PINNs), these weights are often adaptively chosen to improve the network's generalization error. A popular choice of adaptive weights is based on the neural tangent kernel (NTK) of the PINN, which describes the evolution of the network in predictor space during training. The convergence of such an adaptive weighting algorithm is not clear a priori. Moreover, these NTK-based weights would be updated frequently during training, further increasing the computational burden of the learning process. In this paper, we prove that under appropriate conditions, gradient descent enhanced with adaptive NTK-based weights is convergent in a suitable sense. We then address the problem of computational efficiency by developing a randomized algorithm inspired by a predictor-corrector approach and matrix sketching, which produces unbiased estimates of the NTK up to an arbitrarily small discretization error. Finally, we provide numerical experiments to support our theoretical findings and to show the efficacy of our randomized algorithm. Code Availability: https://github.com/maxhirsch/Efficient-NTK",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15425v1",
    "categories": ["math.FA", "math.NA"],
    "authors": ["Martin Schäfer", "Tino Ullrich"],
    "title": "Beyond Tchakaloff Quadrature: Positive Functionals, Frames and Widths",
    "abstract": "Tchakaloff's theorem from 1957 asserts the existence of exact quadrature rules with non-negative weights for any polynomial space of finite degree on $\\mathbb{R}^d$ if the underlying measure is positive, compactly supported, and absolutely continuous with respect to the Lebesgue measure. This classical result coined the term Tchakaloff quadrature for quadrature that is exact and only uses non-negative weights. It has been a long-standing endeavor, under which conditions such rules exist. A final answer was given in 2012 by Bisgaard with the insight that, in fact, every finite-dimensional space of integrable functions on a positive measure space admits them. In this article we recall this result and provide a major extension to the question of positive discretizability of $\\mathbb{C}$-linear functionals on finite-dimensional spaces. We introduce the notion of strict $S$-positivity for such functionals, where $S$ are subsets of the functional's domain, and show the equivalence of positive discretizability to being strictly $S$-positive for a suitable choice of $S$. We further investigate consequences for other discretization problems. One fundamental implication is the guaranteed existence of $L_p$-Marcinkiewicz-Zygmund equalities in finite-dimensional spaces of $p$-integrable functions in case that $p$ is an even integer, another the exact discretizability of any frame in $\\mathbb{K}^n$, where $\\mathbb{K}\\in\\{\\mathbb{R},\\mathbb{C}\\}$, if a rescaling of the frame elements is allowed. In addition, we provide bounds for Tchakaloff quadrature widths $κ_n^+$ and, addressing the question of constructibility of discretization points, establish a connection to $D$-optimal design.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14799v1",
    "categories": ["math.CO"],
    "authors": ["Kunle Adegoke", "Robert Frontczak", "Karol Gryszka"],
    "title": "Double sums associated with binomial transforms",
    "abstract": "In this paper, we continue our investigation of double sums where the inner sum is binomial but incomplete. We prove many new results for these types of double sums associated with binomial transform pairs. As applications we deduce new identities for double sums involving special numbers like Bernoulli numbers, Fibonacci numbers, harmonic numbers, Catalan numbers and Stirling numbers of the second kind. We also consider families of polynomials like Fibonacci polynomials, Chebyshev polynomials, Bernoulli polynomials, and others. Finally, we state new double sums involving hyperbolic functions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14785v1",
    "categories": ["math.HO"],
    "authors": ["Aleksei Panov", "Aleksei Khovanskii"],
    "title": "13 or 14, Halloween surprise",
    "abstract": "We discuss here the history of the rhombocuboctahedron and pseudorombocuboctahedron and describe the structure of their paper models. It turns out that one of them serves as an excellent basis for creating a Jack-o'-lantern. The note is written primarily for school students.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15596v1",
    "categories": ["math.OA", "math.MG"],
    "authors": ["Bhishan Jacelon"],
    "title": "Tracially lyriform $\\mathrm{C}^*$-algebras",
    "abstract": "Quantum metric Choquet simplices are special kinds of compact quantum metric spaces designed for distance measurement in and around the category of stably finite Elliott-classifiable $\\mathrm{C}^*$-algebras. The primary objective of this article is to introduce versions of these structures for which the associated tracial metrics need not be induced by Lipschitz seminorms and may induce strictly stronger topologies than the weak$^*$-topology. The resulting category of 'tracially lyriform $\\mathrm{C}^*$-algebras' behaves well with respect to sequential inductive limits and accommodates the full family of classical $p$-Wasserstein metrics on probability spaces, including $p=\\infty$. Examples of projectionless, classifiable tracial Wasserstein spaces are built as noncommutative spaces of observables of certain compact length spaces, including: fractals like the Sierpiński gasket, the Sierpiński carpet and the Menger sponge; finite-dimensional Alexandrov spaces with two-sided curvature bounds; and metric spaces like simplicial spheres and balls that are Lipschitz equivalent to Riemannian. These simplicial structures are used as building blocks that furnish arbitrary simple inductive limits of prime dimension drop algebras with tracial lyriform structure. Appealing to optimal transport theory, we study the geometry and statistics of the spaces of embeddings of these building blocks and their limits into suitable classifiable $\\mathrm{C}^*$-algebras like the Jiang-Su algebra $\\mathcal{Z}$ or the universal UHF algebra $\\mathcal{Q}$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15595v1",
    "categories": ["math.NT", "math.PR"],
    "authors": ["Christoph Aistleitner", "Lorenz Fruehwirth", "Joscha Prochno"],
    "title": "A sharp threshold for arithmetic effects on the tail probabilities of lacunary sums",
    "abstract": "A classical observation in analysis asserts that lacunary systems of dilated functions show many properties which are also typical for systems of independent random variables. For example, if $(n_k)_{k \\ge 1}$ is a sequence of integers satisfying the Hadamard gap condition $n_{k+1}/n_k\\ge q > 1,~k \\ge 1$, then the normalized sums $\\sum_{n=1}^N \\cos(2πn_k x)$, considered on the probability space $[0,1]$ with Borel $σ$-field and Lebesgue measure, satisfy the central limit theorem (CLT) and the law of the iterated logarithm (LIL). Remarkably, the situation becomes much more deliacate when the trigonometric function $\\cos(2 πx)$ is replaced by a more general 1-periodic function $f$, and fine arithmetic properties of the sequence $(n_k)_{k \\ge 1}$ come into play. The most relevant arithmetic property can be phrased in terms of the number of solutions of certain 2-variable Diophantine equations. Recently, the authors proved that the validity of the LIL requires a strictly stronger Diophantine criterion than the CLT. In the present paper we show that this is only a special case of a wide-ranging general principle: there is a sharp cutoff, which can be expressed in form of a Diophantine criterion on the sequence $(n_k)_{k \\ge 1}$, at which the tail probabilities of $\\sum_{k=1}^N f(n_k x)$ change from Gaussian to potentially erratic behavior. More precisely, let $L(N,a,b,c)$ be the number of solutions $(k,\\ell)$ of the equation $a n_k - b n_\\ell= c$, where $1\\leq k,\\ell \\leq N$. Roughly speaking, we prove: if $L(N,a,b,c) \\le N / g_N$ for some $g_N$, then $\\mathbb{P} \\left[\\sum_{k=1}^N f(n_k x) > t \\|f\\|_2 \\sqrt{N} \\right]$ is asymptotically is accordance with standard normal behavior for all $t$ up to $\\sqrt{2 \\log g_N}$. We also show that this criterion is optimal in the sense that under the same premises, the conclusion can fail to be true for values of $t$ beyond this threshold.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15588v1",
    "categories": ["math.OC"],
    "authors": [
      "Gage MacLin",
      "Venanzio Cichella",
      "Andrew Patterson",
      "Irene Gregory"
    ],
    "title": "Real-Time Optimal Control via Transformer Networks and Bernstein Polynomials",
    "abstract": "In this paper, we propose a Transformer-based framework for approximating solutions to infinite-dimensional optimization problems: calculus of variations problems and optimal control problems. Our approach leverages offline training on data generated by solving a sample of infinite- dimensional optimization problems using composite Bernstein collocation. Once trained, the Transformer efficiently generates near-optimal, feasible trajectories, making it well-suited for real-time applications. In motion planning for autonomous vehicles, for instance, these trajectories can serve to warm- start optimal motion planners or undergo rigorous evaluation to ensure safety. We demonstrate the effectiveness of this method through numerical results on a classical control problem and an online obstacle avoidance task. This data-driven approach offers a promising solution for real-time optimal control of nonlinear, nonconvex systems.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15577v1",
    "categories": ["math.GT"],
    "authors": ["Pietro Capovilla"],
    "title": "Aspherical 4-manifolds with positive Euler characteristic and their geography",
    "abstract": "We present an explicit construction of closed oriented aspherical smooth 4-manifolds with $χ= σ= n$ for every positive integer $n$. This proves a conjecture of Edmonds by providing a closed oriented aspherical 4-manifold with Euler characteristic 1, and it shows that the real analogue of the Bogomolov-Miyaoka-Yau inequality fails for aspherical 4-manifolds. By the Hitchin-Thorpe inequality, these manifolds do not admit Einstein metrics. As a further consequence of our construction, we show that every closed aspherical 3-manifold with amenable fundamental group is virtually the $π_1$-injective boundary of an aspherical 4-manifold with vanishing Euler characteristic and vanishing simplicial volume, thereby answering questions of Edmonds and of Löh-Moraschini-Raptis up to finite covers.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15519v1",
    "categories": ["math.NT", "math.CA", "math.CO"],
    "authors": [
      "Heng Huat Chan",
      "Song Heng Chan",
      "Zhi-Guo Liu",
      "Wadim Zudilin"
    ],
    "title": "On Schultz's generalization of Borweins' cubic identity",
    "abstract": "Around 1991, J.M. and P.B. Borwein established a cubic analogue of Jacobi's fundamental identity for theta functions. Their identity serves as the foundation for the subsequent development by B.C. Berndt, S. Bhargava, and F.G. Garvan of Ramanujan's theory of elliptic functions to the cubic base. In 2013, D. Schultz discovered an identity for theta series in three variables which generalizes the Borweins' identity. In this article, we revisit Schultz's identity and present two distinct approaches to its derivation. Our investigation not only provides new proofs but also yields several identities of a similar type. Furthermore, this study enables us to construct new two-variable generalizations of Jacobi's original classical identity.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15473v1",
    "categories": ["math.PR", "math.AP"],
    "authors": ["Peter S. Morfe", "Felix Otto", "Christian Wagner"],
    "title": "A Critical Drift-Diffusion Equation: Intermittent Behavior via Geometric Brownian Motion on $ \\textbf{SL}(n)$",
    "abstract": "This paper concerns the so-called diffusion in the curl of the 2d Gaussian free field, and its generalization to higher dimensions $n \\geq 2$, building on the scale-by-scale homogenization approach developed recently by Chatzigeorgiou, Morfe, Otto, and Wang [13]. It begins by reformulating the approximation scheme of that work in terms of SDEs in the length scale $L$. This exposes an unexpected connection with a certain geometric Brownian motion on the special linear group $\\textbf{SL}(n)$. The analysis of this process sheds light on the original problem, particularly as it pertains to intermittent behavior exhibited by the (averaged) Lagrangian coordinate.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15436v1",
    "categories": ["math.GN", "math.AC"],
    "authors": ["Soumajit Dey", "Sudip Kumar Acharyya", "Dhananjoy Mandal"],
    "title": "Measure finite topology on the ring of measurable functions",
    "abstract": "Let $\\mathcal{M}(X,\\mathcal{A},μ)$ be the ring of all real-valued measurable functions constructed over a measure space $(X,\\mathcal{A},μ)$. A topology on $\\mathcal{M}(X,\\mathcal{A},μ)$, called the {$F_μ$-topology} weaker than the { $U_μ$-topology} is introduced. It is realized that the {component}, the {quasi component} and the {path component }in this {$F_μ$-topology} are identical. It turns out that the {$F_μ$-topology} on $\\mathcal{M}(X,\\mathcal{A},μ)$ becomes {connected} if and only if it is {path connected} if and only if $μ$ is an {atomic measure} of a special type. It is also proved that the {$F_μ$-topology} is {first countable} when and only when $μ$ is a {hemifinite measure.} Finally, it is shown that the {second countability} of the {$F_μ$-topology} is equivalent to the {hemifiniteness} of the measure $μ$ together with the {countable chain condition} of the {$F_μ$-topology}.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15404v1",
    "categories": ["cs.IT"],
    "authors": [
      "Zizhen Zhou",
      "Ying-Chang Liang",
      "Yanyu Cheng",
      "Wei Yang Bryan Lim"
    ],
    "title": "Communication-Pipelined Split Federated Learning for Foundation Model Fine-Tuning in UAV Networks",
    "abstract": "Deploying foundation models (FMs) on uncrewed aerial vehicles (UAVs) promises broad ``low-altitude economy'' applications. Split federated learning (SFL)-based fine-tuning leverages distributed data while keeping raw data local and reduces client-side burden by partitioning the model between client and server. However, the per-round training latency is dominated by stragglers. Training paradigms featuring parallel gradient transmission (GT) allocate dedicated portions of downlink communication resources to each client. They may leave resources idle and suffer from prolonged GT latency, especially in UAV networks, where the communication latency typically far exceeds the computation latency. To address this, we propose a sequential GT paradigm, where the server dedicates all downlink resources for the current GT. We further propose communication-pipelined SFL (CPSFL), characterized by downlink GT priority scheduling and intra-round asynchronous training. We investigate CPSFL-based LoRA fine-tuning of FMs in UAV networks and formulate an optimization problem to minimize a weighted sum of per-round training latency and worst-case client energy consumption by optimizing the split point selection (SPS) and the computing and communication resource allocation (CCRA) (the uplink bandwidth allocation and the server computing frequency allocation). To solve this problem, we develop an attention-based deep reinforcement learning (DRL) framework, where the base station agent decides the split point and the CCRA in each round by leveraging previous round information, including UAV trajectories. Simulation results show that the proposed DRL-based CPSFL scheme outperforms the parallel GT benchmarks, the ablation variants, the fixed CCRA scheme, while approaching the best fixed-SPS scheme.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15372v1",
    "categories": ["math.CO"],
    "authors": ["Sam Adriaensen", "Peter Sziklai", "Zsuzsa Weiner"],
    "title": "A note on short minimal codes from subgeometries",
    "abstract": "In a 2022, Bartoli, Cossidente, Marino, and Pavese proved that in the projective space ${\\rm PG}(3,q^3)$, one can find three $\\mathbb F_q$-subgeometries such that the union of their point sets is a strong blocking set. This proves the existence of linear minimal codes with parameters $[3(q^2+1)(q+1),4]_{q^3}$ for every prime power $q$. We give a short proof of this result for odd values of $q > 9$, using the theory of small blocking sets in projective planes.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15356v1",
    "categories": ["math.DG", "cs.IT", "math.AP", "math.MG", "math.PR"],
    "authors": ["Amandip Sangha"],
    "title": "An Information-Theoretic Route to Isoperimetric Inequalities via Heat Flow and Entropy Dissipation",
    "abstract": "We develop an information-theoretic approach to isoperimetric inequalities based on entropy dissipation under heat flow. By viewing diffusion as a noisy information channel, we measure how mutual information about set membership decays over time. This decay rate is shown to be determined by the boundary measure of the set, leading to a new proof of the Euclidean isoperimetric inequality with its sharp constant. The method extends to Riemannian manifolds satisfying curvature-dimension conditions, yielding Levy-Gromov and Gaussian isoperimetric results within a single analytic principle. Quantitative and stability bounds follow from refined entropy inequalities linking information loss to geometric rigidity. The approach connects geometric analysis and information theory, revealing how entropy dissipation encodes the geometry of diffusion and boundary.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15041v1",
    "categories": ["cs.IT"],
    "authors": [
      "Jingchen Peng",
      "Chaowen Deng",
      "Yili Deng",
      "Boxiang Ren",
      "Lu Yang"
    ],
    "title": "Hyper-VIB: A Hypernetwork-Enhanced Information Bottleneck Approach for Task-Oriented Communications",
    "abstract": "This paper presents Hyper-VIB, a hypernetwork-enhanced information bottleneck (IB) approach designed to enable efficient task-oriented communications in 6G collaborative intelligent systems. Leveraging IB theory, our approach enables an optimal end-to-end joint training of device and network models, in terms of the maximal task execution accuracy as well as the minimal communication overhead, through optimizing the trade-off hyperparameter. To address computational intractability in high-dimensional IB optimization, a tractable variational upper-bound approximation is derived. Unlike conventional grid or random search methods that require multiple training rounds with substantial computational costs, Hyper-VIB introduces a hypernetwork that generates approximately optimal DNN parameters for different values of the hyperparameter within a single training phase. Theoretical analysis in the linear case validates the hypernetwork design. Experimental results demonstrate our Hyper-VIB's superior accuracy and training efficiency over conventional VIB approaches in both classification and regression tasks.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15018v1",
    "categories": ["math.OC"],
    "authors": [
      "Nick-Marios T. Kokolakis",
      "Shanqing Liu",
      "Jerome Darbon",
      "Rahul Mangharam",
      "George Em Karniadakis"
    ],
    "title": "Adversarial Physics-Informed Machine Learning for Robust Optimal Safe Predefined-Time Stabilization: A Game-Theoretic Approach",
    "abstract": "We develop a game-theoretic framework for adversarially robust optimal safe predefined-time stabilization of parameter-dependent nonlinear dynamical systems with nonquadratic cost functionals. Our approach ensures that all system trajectories remain within a specified admissible set and converge to equilibrium in a predefined time despite adversarial disturbances. The control problem is formulated as a two-player zero-sum differential game, where the controller is a minimizing player and the adversary a maximizing player. We derive sufficient conditions for the existence of a saddle-point solution and safe predefined-time stability using a barrier Lyapunov function that satisfies a differential inequality and the steady-state Hamilton-Jacobi-Isaacs (HJI) equation. To address the analytical intractability of solving the HJI equation, we introduce a physics-informed learning algorithm that robustly learns the Nash safely predefined-time stabilizing control strategy. Simulation results demonstrate the efficacy and resilience of the proposed method in ensuring robust optimal safe predefined-time stabilization under adversarial disturbances.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14991v1",
    "categories": ["math.MG"],
    "authors": ["Arkadiy Aliev"],
    "title": "Mahler-type volume inequality for convex bodies with tetrahedral symmetry",
    "abstract": "Let $ K $ be a convex body in $ \\mathbb{R}^n $. We denote the volume of $ K $ by $ \\vert K\\vert $, and the polar body of its difference body $ K - K $ by $ (K - K)^{\\circ} $. We provide a new proof of the well-known estimate \\[ |K||(K - K)^{\\circ}| \\geq \\frac{3}{2} \\] for $ K \\subset \\mathbb{R}^2 $, with equality attained for a triangle. For $ K \\subset \\mathbb{R}^3 $ with tetrahedral symmetry, we prove that \\[ |K| |(K - K)^{\\circ}| \\geq \\frac{2}{3}, \\] with equality attained for a tetrahedron.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14959v1",
    "categories": ["math.AG"],
    "authors": ["Joaquín Moraga", "Juan Pablo Zúñiga"],
    "title": "Degenerations of cluster type varieties",
    "abstract": "We study degenerations of cluster type varieties and pairs. Our first theorem proves that degenerations of toric pairs are finite quotients of toric pairs. In a similar vein, under some mild conditions, we prove that degenerations of cluster type pairs are finite quotients of cluster type pairs. Then, we focus on degenerations of cluster type surfaces. We give some general criteria for the existence of $1$-complements on degenerations of toric surfaces. We prove that for almost all $(a,b,c)\\in \\mathbb{Z}_{\\geq 1}^3$ the weighted projective plane $\\mathbb{P}(a,b,c)$ has no non-trivial degenerations. In particular, for a Markov triple $(a,b,c)\\in \\mathbb{Z}_{\\geq 2}^3$, we prove that $\\mathbb{P}(a^2,b^2,c^2)$ admits no non-trivial degenerations. Finally, we give a complete classification of the degenerations of $\\mathbb{P}(1,1,n)$ for $n\\geq 3$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14885v1",
    "categories": ["math.AP", "math.DG", "math.FA", "math.MG"],
    "authors": ["Eleonora Cinti", "Enzo Maria Merlino", "Berardo Ruffini"],
    "title": "A strong quantitative form of the fractional isoperimetric inequality",
    "abstract": "We show a strong version of the fractional quantitative isoperimetric inequality, in which the isoperimetric deficit controls not only the Fraenkel asymmetry but also a sort of oscillation of the boundary. This generalizes the local result by Fusco and Julin in \\cite{FJ}. The proof follows a regularization process as in \\cite{FJ} but it is quite different in its spirit. Then, as a consequence of the quantitative inequality, we prove some stability estimates for a fractional Cheeger inequality.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14880v1",
    "categories": ["math.AP"],
    "authors": ["Michał Kowalczyk", "Javier Monreal"],
    "title": "Yang-Mills instanton on a four dimensional wormhole: asymptotic stability in the energy space",
    "abstract": "In this paper we consider an $SU(2)$ Yang-Mills field propagating in the $4+1$ dimensional wormhole spacetime. Assuming the spherically symmetric magnetic ansatz the problem reduces to a one dimensional non linear wave equation. This equation posses a degree one solution (instanton) which is odd in space. We consider small, odd perturbations of the instanton and show that it is conditionally asymptotically stable in the odd energy space.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14867v1",
    "categories": ["math.CO"],
    "authors": ["Sayan Gupta", "Kaushik Majumder"],
    "title": "An exact Ramsey number of large bipartite graphs versus odd wheel",
    "abstract": "The Ramsey number for the pair of graphs $\\mathbb{K}_{1,n}$ (star) versus $W_{m}$ (wheel) has been extensively studied. In contrast, the Ramsey number of $\\mathbb{K}_{2,n}$ versus wheel is not yet explored due to the structural complexity of $\\mathbb{K}_{2,n}$. In this article, we have established an exact value of $\\mathbb{K}_{2,n}$ versus $W_{m}$ for large $n$ and $m$. In particular, we have proved \\begin{equation*} R(\\mathbb{K}_{2,n}, W_{m})=3n+4 \\end{equation*} if $n$ and $m$ are sufficiently large integers where $n\\geq4m$ and $m$ is an odd integer. This also proves the $W_{m}$-goodness of $\\mathbb{K}_{2,n}$. We have used a probabilistic method composed of structural analysis in our proof.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15348v1",
    "categories": ["math.FA"],
    "authors": ["Cornelis van der Mee"],
    "title": "Matrix Zakharov-Shabat Systems with Zero Diagonal Entry",
    "abstract": "In this article we develop the direct and inverse scattering theory of the Ablowitz-Kaup-Newell-Segur (AKNS) system $\\bv_x=(ik\\zS+\\CQ(x))\\bv$, where $\\zS$ is a diagonal $n\\times n$ matrix with diagonal entries $1$ and $-1$ and a single zero diagonal entry and $\\CQ(x)$ is an $n\\times n$ potential anticommuting with $\\zS$ with entries in $L^1(\\R)$. We derive the time evolution of the scattering data which, through the inverse scattering transform, lead to the solution of the initial-value problem for a system of long-wave-short-wave equations.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15319v1",
    "categories": ["math.AC"],
    "authors": ["Dario Spirito"],
    "title": "Smooth sequences and overring operators",
    "abstract": "We introduce smooth sequences of integral domains as well-ordered ascending chains that behave well at limit ordinals. Subsequently, we use this notion to give some conditions on the freeness of kernels of extension maps between groups of invertible ideals of Prüfer domains. We also define overring operators to construct smooth sequences in a recursive way.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15301v1",
    "categories": ["math.HO"],
    "authors": ["Stelios Negrepontis", "Athanase Papadopoulos"],
    "title": "The mathematics of periodic anthyphairesis as a basis for the full understanding of Plato's philosophy",
    "abstract": "Even though Plato's philosophy in ancient times was always closely associated with mathematics, modern Platonic scholarship, during the last five centuries, has moved steadily toward de-mathematization. The present work aims to outline a radical re-interpretation of Plato's philosophy, according to which the Platonic Idea, that is, the intelligible Being, has the structure of the philosophical analogue of a geometric dyad in a philosophic anthyphaeresis -- the precursor of modern continued fractions -- which was studied by the Pythagoreans, Theodorus and Theaetetus in relation with the discoveries of quadratic incommensurabilities. This mathematical structure is clearly visible in the Platonic method of Division and Collection, equivalently Name and Logos, equivalently True Opinion plus Logos, in the dialogues Theaetetus, Sophist, Statesman, Meno, and Parmenides. Equipped with this structure of an intelligible Being, we provide definitive answers to fundamental questions, that were not be resolved by Platonists, concerning the following topics: the dialectic numbers, which are based on the anthyphairetic periodicity and the plus one rule, stating that the dialectic number of terms of a sequence is the (number of) ratios of successive terms plus one (stated in the Parmenides 148d-149d); the description of the intelligible being as an Indivisible Line, a statement bordering on the contradictory; the also seemingly contradictory Sophist 's statement that ``the not-Being is a Being'', based on the equalization of the two elements of the dyad defining an intelligible Being; the more general self-similar Oneness of an intelligible Being, based on the equalization of all parts generated by the anthyphairetic division of an intelligible Being; and finally the Third Man Argument in the Introduction to the Parmenides, appearing as a threat for Plato's theory, but essentially innocuous because of the self-similar Oneness. The third part of our study aims to prove that, contrary to the presently dominant interpretation of Zeno's arguments and paradoxes as being devoid of mathematical content, the analysis of Zeno's presence in the Parmenides, Sophist (via the Eleatic Stranger), and Zeno's verbatim Fragments preserved by Simplicius, show that Plato's intelligible Beings essentially coincide with Zeno's true Beings, and hence that Zeno's philosophical thought was already anthyphairetic, and hence heavily influenced by the Pythagorean's Mathematics. These findings run against Burkert's claim that ``ontology is prior to mathematics''. Modern Platonists have never obtained a clear description of the structure of an intelligible Idea in terms of the mathematics of periodic anthyphairesis, and thus were not able to answer fundamental questions, nor to realize the close connection of Zeno's intelligible beings with Zeno's true Beings.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15297v1",
    "categories": ["math.DG", "math.AP"],
    "authors": ["Sourav Ghosh"],
    "title": "Decay order bound for mean curvature flow near compact singularities",
    "abstract": "We consider the rescaled flow associated with a mean curvature flow that develops a compact singularity of multiplicity one. We prove that the ``decay order'' of such a rescaled flow is uniformly bounded. As a consequence, we prove a unique continuation result.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15228v1",
    "categories": ["math.PR"],
    "authors": ["Liu Chang", "Wang Ran"],
    "title": "Chung's LIL for the linear stochastic fractional heat equation at origin",
    "abstract": "Consider the linear stochastic fractional heat equation with vanishing initial condition: $$\n  \\frac{\\partial u (t,x)}{\\partial t}=-(-Δ)^{\\fracα2}u (t,x) + \\dot{W}(t,x),\\quad t> 0,\\,\n  x\\in \\mathbb R, $$\n  where $-(-Δ)^{\\fracα{2}}$ denotes the fractional Laplacian with power $α\\in (1,2]$, and the driving noise $\\dot W$ is a centered Gaussian field which is white in time and has the covariance of a fractional Brownian motion with Hurst parameter $H\\in\\left(\\frac {2-α}2,1\\right)$. We establish Chung's law of the iterated logarithm for the solution at $t=0$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15216v1",
    "categories": ["math.AP"],
    "authors": ["Alexander Shlapunov", "Pavel Vilkov"],
    "title": "On approximation theorems for solutions to strongly parabolic systems in anisotropic Sobolev spaces",
    "abstract": "We investigate the problem on Runge pairs for Sobolev solutions of strongly uniformly parabolic systems in non-cylindrical domains of a special kind. We prove that if the coefficients of a parabolic operator are constant, then two domains with sufficiently smooth boundaries, no parts of which are parallel to the plane $t=0$, form a Runge pair if and only if the complements of any section of the larger domain to the section of the smaller domain by planes $t = const$, have no compact components in the larger section.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15180v1",
    "categories": ["math.AP"],
    "authors": ["Geng Chen", "Faris A. El-Katri", "Yanbo Hu", "Yannan Shen"],
    "title": "Singularity formation for the supersonic inward wave of compressible Euler equations with radial symmetry",
    "abstract": "In this paper, we consider the singularity formation of smooth solutions for the compressible radially symmetric Euler equations. By applying the characteristic method and the invariant domain idea, we show that, for polytropic ideal gases with $γ\\geq3$, the smooth solution develops a singularity in finite time for a class of initial supersonic inward waves.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15149v1",
    "categories": ["math.NT"],
    "authors": ["Diksha Rani Bansal", "Bibekananda Maji", "Pragya Singh"],
    "title": "Analogues of Hargoltz-Zagier-Novikov function",
    "abstract": "Recently, Choie and Kumar extensively studied the Herglotz-Zagier-Novikov function $\\mathfrak{F}(z;u,v)$, defined as \\begin{align*} \\mathfrak{F}(z;u,v) = \\int_{0}^{1} \\frac{\\log(1-ut^z)}{v^{-1}-t} dt, \\quad \\textrm{for} \\quad \\mathfrak{Re}(z)>0. \\end{align*} They obtained two-term, three-term and six-term functional equations for $\\mathfrak{F}(z;u,v)$ and also evaluated special values in terms of di-logarithmic functions. Motivated from their work, we study the following two integrals, \\begin{align*} \\mathfrak{F}(z;u,v,w) &=\\int_{0}^1 \\frac{\\log(1-ut^z)\\log(1-wt^z)}{v^{-1}-t}\\text{d}t, \\\\ \\mathfrak{F}_k(z;u,v) &= \\int_{0}^{1} \\frac{\\log^k(1-ut^z)}{v^{-1}-t} \\, \\text{d}t, \\end{align*} for $\\mathfrak{Re}(z)>0$ and $k \\in \\mathbb{N}$. For $k=1$, the integral $\\mathfrak{F}_k(z;u,v)$ reduces to $\\mathfrak{F}(z;u,v)$. This allows us to recover the properties of $\\mathfrak{F}(z;u,v)$ by studying the properties of $\\mathfrak{F}_k(z;u,v)$. We evaluate special values of these two functions in terms of poly-logarithmic functions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15113v1",
    "categories": ["math.RA", "math.DG"],
    "authors": ["Andrés Rubiano"],
    "title": "Smooth geometry of graded skew Clifford algebras",
    "abstract": "In this paper, we investigate the differential smoothness of graded skew Clifford algebras.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15673v1",
    "categories": ["math.CO"],
    "authors": ["Jun Yan"],
    "title": "Asymmetric Ramsey numbers of trees",
    "abstract": "Let $n\\geqν$, let $T$ be an $n$-vertex tree with bipartition class sizes $t_1\\geq t_2$, and let $S$ be a $ν$-vertex tree with bipartition class sizes $τ_1\\geqτ_2$. Using four natural constructions, we show that the Ramsey number $R(T,S)$ is lower bounded by $\\underline{R}(T,S)=\\max\\{n+τ_2,ν+\\min\\{t_2,ν\\},\\min\\{2t_1,2ν\\},2τ_1\\}-1$.\n  Our main result shows that there exists a constant $c>0$, such that for all sufficiently large integers $n\\geqν$, if (i) $Δ(T)\\leq cn/\\log n$ and $Δ(S)\\leq cν/\\logν$, (ii) $τ_2\\geq t_2$, and (iii) $ν\\geq t_1$, then $R(T,S)=\\underline{R}(T,S)$. In particular, this determines the exact Ramsey numbers for a large family of pairs of trees. We also provide examples showing that $R(T,S)$ can exceed $\\underline{R}(T,S)$ if any one of the three assumptions (i), (ii), and (iii) is removed.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15631v1",
    "categories": ["math.AP"],
    "authors": ["Giuseppe Maria Coclite", "Nicola De Nitti", "Kuang Huang"],
    "title": "Singular limit for a class of nonlocal conservation laws via compensated compactness",
    "abstract": "We consider a class of nonlocal conservation laws modeling traffic flows, given by $ \\partial_t u_\\varepsilon + \\partial_x(V(u_\\varepsilon \\ast γ_\\varepsilon) u_\\varepsilon) = 0$, with a rescaled convolution kernel $γ_\\varepsilon(\\cdot) := \\varepsilon^{-1}γ(\\cdot/\\varepsilon)$. We establish the strong $\\mathrm L^1_{\\mathrm{loc}}$-convergence of weak solutions $u_\\varepsilon$ toward the entropy-admissible solution of the corresponding local conservation law as the kernel $γ_\\varepsilon$ concentrates to a Dirac delta distribution when $\\varepsilon \\searrow 0$. In contrast to previous literature, we obtain compactness of the family $\\{u_\\varepsilon \\ast γ_\\varepsilon\\}_{\\varepsilon>0}$ without relying on total variation bounds or Oleĭnik-type estimates. Instead, we establish $\\mathrm L^2$-type bounds on its entropy production and use the theory of compensated compactness, assuming that the initial datum merely belongs to $\\mathrm L^1\\cap \\mathrm L^\\infty$. Our results are twofold. First, we establish the nonlocal-to-local limit for the piecewise constant kernel $γ(\\cdot) := {1}_{[-1,0]}(\\cdot)$ combined with the affine velocity function from Greenshields' traffic model. Second, we prove the limit for strictly monotone kernels along with decreasing velocity functions. These results settle a long-standing open problem concerning the nonlocal-to-local convergence for non-convex kernels.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15285v1",
    "categories": ["math.AP"],
    "authors": ["Laura Baldelli", "Norihisa Ikoma"],
    "title": "Normalized Solutions for the $(2,q)$-Laplacian Operator Between Mass-Critical Exponents",
    "abstract": "This paper concerns the existence of normalized solutions to a class of $(2,q)$-Laplacian equations with a power type nonlinearity in the intermediate regime between the two mass critical exponents $2(1+2/N)$, $q(1+2/N)$. More precisely, we prove the existence of solutions with negative energy obtained through a global minimization procedure, and of solutions with positive energy established via a local minimization technique and a mountain-pass argument. Furthermore, we derive both existence and nonexistence results for the zero-mass case $λ= 0$, highlighting the role of the mixed diffusion in determining the qualitative behavior of solutions. Specifically, this paper's novelty lies in providing a comprehensive understanding of the intermediate cases that arise when the non-homogeneous $(2,q)$-Laplacian operator appears. Our analysis combines variational methods, compactness arguments, and delicate energy estimates adapted to the nonhomogeneous nature of the $(2,q)$-Laplacian operator.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15648v1",
    "categories": ["math.AP"],
    "authors": [
      "Théo André",
      "Szymon Cygan",
      "Anna Marciniak-Czochra",
      "Finn Münnich"
    ],
    "title": "Spatial scale separation and emergent patterns in coupled diffusive-nondiffusive systems",
    "abstract": "This paper investigates pattern formation in reaction-diffusion systems with both diffusive and nondiffusive components, establishing the existence of far-from-equilibrium patterns and providing necessary and sufficient conditions for diffusion-driven instability (DDI). In particular, we prove the existence of far-from-equilibrium patterns exhibiting branch-switching and discontinuities in the nondiffusive components, which cannot occur in classical reaction-diffusion equations. While previous work has linked DDI to instability in the purely nondiffusive subsystem -- thereby destabilizing all regular Turing patterns -- we show that DDI can also arise from subsystems involving nondiffusive and slow-diffusive components. This leads to simple sufficient conditions for DDI in systems with arbitrary numbers of components. Further, we fully classify all possible sources of DDI in the case of two diffusive and one nondiffusive component, illustrating our results with a receptor-based model supported by numerical bifurcation analysis and simulations. These findings extend the theoretical foundations of pattern formation, demonstrating how coupling between diffusive and nondiffusive dynamics can generate patterns beyond the reach of the classical reaction-diffusion framework.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15531v1",
    "categories": ["math.LO"],
    "authors": ["Haruka Kogure", "Taishi Kurahashi"],
    "title": "Modal logical aspects of provability predicates and consistency statements",
    "abstract": "This paper studies the modal logical aspects of provability predicates and consistency statements for theories of arithmetic. First, we provide an overview of previous works on the correspondence between various derivability conditions for provability predicates and different modal logics. The main technical contribution of the present paper is to establish the arithmetical completeness of the logics $\\mathsf{NP}$, $\\mathsf{ND}$, $\\mathsf{NP4}$, and $\\mathsf{ND4}$ by extending Solovay's method and refining Arai's construction of Rosser provability predicates.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15445v1",
    "categories": ["math.NA", "cs.LG"],
    "authors": [
      "Victorita Dolean",
      "Daria Hrebenshchykova",
      "Stéphane Lanteri",
      "Victor Michel-Dansac"
    ],
    "title": "Neural network-driven domain decomposition for efficient solutions to the Helmholtz equation",
    "abstract": "Accurately simulating wave propagation is crucial in fields such as acoustics, electromagnetism, and seismic analysis. Traditional numerical methods, like finite difference and finite element approaches, are widely used to solve governing partial differential equations (PDEs) such as the Helmholtz equation. However, these methods face significant computational challenges when applied to high-frequency wave problems in complex two-dimensional domains. This work investigates Finite Basis Physics-Informed Neural Networks (FBPINNs) and their multilevel extensions as a promising alternative. These methods leverage domain decomposition, partitioning the computational domain into overlapping sub-domains, each governed by a local neural network. We assess their accuracy and computational efficiency in solving the Helmholtz equation for the homogeneous case, demonstrating their potential to mitigate the limitations of traditional approaches.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15616v1",
    "categories": ["math.AG", "math.AC", "math.AT", "math.KT"],
    "authors": ["Aravind Asok", "Jean Fasel", "Samuel Lerbet"],
    "title": "Splitting vector bundles over real algebraic varieties",
    "abstract": "Suppose $X$ is a smooth affine real variety and $\\mathscr{E}$ is a vector bundle over $X$. We analyze the problem of splitting off a free rank one summand from $\\mathscr{E}$ in corank $0$ and $1$. The problem in corank $0$ can be viewed as the search for a real analog of Murthy's celebrating splitting theorem in the algebraically closed case: to wit, beyond the vanishing of the top Chern class in Chow theory, are the obstructions to splitting ``purely topological''? In a sense, the answer in this case is yes, and we give a proof, using motivic techniques, of a mild extension of the results of Bhatwadekar-Sridharan and Bhatwadekar-Das-Mandal.\n  In corank $1$, in the algebraically closed situation, Murthy's splitting conjecture (now a theorem in characteristic $0$) predicts that the vanishing of the top Chern class in Chow theory is the only obstruction to splitting off a free rank $1$ summand, and we can search for a suitable ``real'' analog of this assertion. We observe that several natural guesses for a ``real'' analog of Murthy's splitting conjecture cannot be true, i.e., that the situation over the real numbers is rather complicated.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15387v1",
    "categories": ["math.RA", "math.CT", "math.RT"],
    "authors": ["Xiao-Wu Chen"],
    "title": "The singularity category via the stabilization",
    "abstract": "We give a detailed proof of the following fundamental result: the singularity category of a ring is triangle equivalent to the stabilization of its stable module category. The result yields singular equivalences between rings of different nature. We use Leavitt rings to describe singularity categories of artinian rings.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15382v1",
    "categories": ["math.OC", "math.AP"],
    "authors": ["Vanja Nikolić", "Belkacem Said-Houari"],
    "title": "Optimal Neumann boundary and distributed control of the Westervelt equation with time-fractional attenuation",
    "abstract": "Optimal control of nonlinear acoustic waves is relevant in many medical ultrasound technologies, ranging from cancer therapy to targeted drug delivery, where it can help guide the precise deposition of acoustic energy. In this work, we study Neumann boundary and distributed control problems for tracking a prescribed pressure field governed by the Westervelt equation with time-fractional dissipation. This model captures nonlinear ultrasonic wave propagation in biological media and accounts for the experimentally observed power-law attenuation. We begin by extending the existing well-posedness theory for time-fractional equations to include inhomogeneous Neumann boundary data used as control inputs, which requires constructing an appropriate data extension and regularization. Using these analytical results for the forward problem, we prove the existence of globally optimal controls and analyze the stability of the optimization problem with respect to perturbations in the target pressure field and to vanishing regularization parameters. Finally, we investigate the associated adjoint equation, which has state-dependent coefficients, and use it to derive first-order necessary optimality conditions.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15374v1",
    "categories": ["math.DS"],
    "authors": ["Ruifen Dai", "Xin Zheng", "Fang Wang", "Lei Guo"],
    "title": "Judicial Sentencing Prediction Based on Hybrid Models and Two-Stage Learning Algorithms",
    "abstract": "The investigation of legal judgment prediction (LJP), such as sentencing prediction, has attracted broad attention for its potential to promote judicial fairness, making the accuracy and reliability of its computation result an increasingly critical concern. In view of this, we present a new sentencing model that shares both legal logic interpretability and strong prediction capability by introducing a two-stage learning algorithm. Specifically, we first construct a hybrid model that synthesizes a mechanism model based on the main factors for sentencing with a neural network modeling possible uncertain features. We then propose a two-stage learning algorithm: First, an adaptive stochastic gradient (ASG) algorithm is used to get good estimates for the unknown parameters in the mechanistic component of the hybrid model. Then, the Adam optimizer tunes all parameters to enhance the predictive performance of the entire hybrid model. The asymptotic convergence of the ASG-based adaptive predictor is established without requiring any excitation data conditions, thereby providing a good initial parameter estimate for prediction. Based on this, the fast-converging Adam optimizer further refines the parameters to enhance overall prediction accuracy. Experiments on a real-world dataset of intentional injury cases in China show that our new hybrid model combined with our two-stage ASG-Adam algorithm, outperforms the existing related methods in sentencing prediction performance, including those based on neural networks and saturated mechanism models.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15345v1",
    "categories": ["math.NA"],
    "authors": [
      "Alessandra Crippa",
      "Julien Coatléven",
      "Daniele A. Di Pietro",
      "Nicolas Guy",
      "Yousef Soleiman"
    ],
    "title": "A Hybrid-High Order method for fracture modelling",
    "abstract": "In this work, we introduce a new Hybrid High-Order method for the numerical simulation of fracture propagation based on phase-field models. The proposed method supports general meshes made of polygonal/polyhedral elements, which provides great flexibility in mesh design and adaptation, and can accommodate large variations of both the displacement and damage variables thanks to the use of fully discontinuous spaces. The resolution of the corresponding algebraic problem is based on a staggered time stepping scheme which takes advantage of static condensation for each subproblem. We provide extensive numerical validation of the method on classical two-dimensional fracture propagation problems, including a comparison with a more standard finite element scheme.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15306v1",
    "categories": ["math.CV", "math.SG"],
    "authors": ["Purvi Gupta", "Rudranil Sahu"],
    "title": "A complex-analytic characterization of Lagrangian immersions in $\\mathbb C^n$ with transverse double points",
    "abstract": "Given a compact smooth totally real immersed $n$-submanifold $M\\subset\\mathbb C^n$ with only finitely many transverse double points, it is known that if $M$ is Lagrangian with respect to some K{ä}hler form on $\\mathbb C^n$, then it is rationally convex in $\\mathbb C^n$ (Gayet, 2000), but the converse is not true (Mitrea, 2020). We show that $M$ is Lagrangian with respect to some K{ä}hler form on $\\mathbb C^n$ if and only if $M$ is rationally convex {\\em and} at each double point, the pair of transverse tangent planes to $M$ satisfies the following diagonalizability condition: there is a complex linear transformation on $\\mathbb C^n$ that maps the pair to $\\left(\\mathbb R^n,(D+i)\\mathbb R^n\\right)$ for some real diagonal $n\\times n$ matrix $D$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15255v1",
    "categories": ["cs.IT"],
    "authors": ["Yassine Hamdi", "Aaron B. Wagner", "Deniz Gündüz"],
    "title": "The Rate-Distortion-Perception Trade-Off with Algorithmic Realism",
    "abstract": "Realism constraints (or constraints on perceptual quality) have received considerable recent attention within the context of lossy compression, particularly of images. Theoretical studies of lossy compression indicate that high-rate common randomness between the compressor and the decompressor is a valuable resource for achieving realism. On the other hand, the utility of significant amounts of common randomness has not been noted in practice. We offer an explanation for this discrepancy by considering a realism constraint that requires satisfying a universal critic that inspects realizations of individual compressed reconstructions, or batches thereof. We characterize the optimal rate-distortion trade-off under such a realism constraint, and show that it is asymptotically achievable without any common randomness, unless the batch size is impractically large.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15232v1",
    "categories": ["math.OC", "math.MG"],
    "authors": ["Gisella Croce", "Antoine Henrot"],
    "title": "Optimal sets for the quantitative isoperimetric inequality in the plane with the barycentric distance",
    "abstract": "In a recent paper, C. Gambicchia and A. Pratelli proved a quantitative isoperimetric inequality involving the isoperimetric deficit $δ(K)$ and the barycentric distance $λ_0(K)$ for sets $K\\subset \\mathbb{R}^N$ with given diameter $D$ and measure. In this work we are interested in the optimal sets for this inequality in the plane, i.e. sets that minimize the ratio $δ(K)/λ_0(K)^2$. We prove existence of optimal sets (at least when $D$ is large enough), regularity and express the optimality conditions. Moreover, we prove that the optimal sets have exactly two connected components and their boundary does not contain any arc of circle.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15212v1",
    "categories": ["math.GT", "math.GR"],
    "authors": ["Jens Harlander", "Stephan Rosebrock"],
    "title": "Local indicability in the presence of diagrammatic reducibility",
    "abstract": "If a complex $X$ is a subcomplex of a diagrammatically reducible 2-complex $Y$ that has locally indicable fundamental group, then $X$ has locally indicable fundamental group. This is a consequence of the Corson-Trace characterization of diagrammatic reducibility. In this paper we use a Corson-Trace like characterization of diagrammatic reducibility away from a subcomplex to obtain a considerable stronger result. We apply this to the question of local indicability in the context of Whitehead's asphericity conjecture. We show that an injective labeled oriented tree (LOT) that is diagrammatically reducible of degree 2, and all its quotients are as well, is locally indicable.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15135v1",
    "categories": ["math.CO"],
    "authors": ["Terence Tao"],
    "title": "Sum-difference exponents for boundedly many slopes, and rational complexity",
    "abstract": "The dimension of Kakeya sets can be bounded using sum-difference exponents $\\SD(R;s)$ for various sets of rational slopes $R$ and output slope $s$; the arithmetic Kakeya conjecture, which implies the Kakeya conjecture in all dimensions, asserts that the infimum of such exponents is $1$. The best upper bound on this infimum currently is $1.67513\\dots$. In this note, inspired by numerical explorations from the tool \\texttt{AlphaEvolve}, we study the regime where the cardinality of the set of slopes $R$ is bounded. In this regime, we establish that these exponents converge to $2$ at a rate controlled by the \\emph{rational complexity} of $s$ relative to $R$, which measures how efficiently $s$ can be expressed as a rational combination of slopes in $R$.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15094v1",
    "categories": ["math.CO", "math.AG"],
    "authors": ["Peter L. Guo"],
    "title": "Richardson tableaux and noncrossing partial matchings",
    "abstract": "Richardson tableaux are a remarkable subfamily of standard Young tableaux introduced by Karp and Precup in order to index the irreducible components of Springer fibers equal to Richardson varieties. We show that the set of insertion tableaux of noncrossing partial matchings on $\\{1,2,,\\ldots, n\\}$ by applying the Robinson--Schensted algorithm coincides with the set of Richardson tableaux of size $n$. This leads to a natural one-to-one correspondence between the set of Richardson tableaux of size $n$ and the set of Motzkin paths with $n$ steps, in response to a problem proposed by Karp and Precup. As consequences, we recover some known and establish new properties for Richardson tableaux. Especially, we relate the $q$-counting of Richardson tableaux to $q$-Catalan numbers.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15051v1",
    "categories": ["cs.IT", "cs.CR"],
    "authors": ["Pengcheng Su", "Haibo Cheng", "Ping Wang"],
    "title": "Mutual Information Bounds in the Shuffle Model",
    "abstract": "The shuffle model enhances privacy by anonymizing users' reports through random permutation. This paper presents the first systematic study of the single-message shuffle model from an information-theoretic perspective. We analyze two regimes: the shuffle-only setting, where each user directly submits its message ($Y_i=X_i$), and the shuffle-DP setting, where each user first applies a local $\\varepsilon_0$-differentially private mechanism before shuffling ($Y_i=\\mathcal{R}(X_i)$). Let $\\boldsymbol{Z} = (Y_{σ(i)})_i$ denote the shuffled sequence produced by a uniformly random permutation $σ$, and let $K = σ^{-1}(1)$ represent the position of user 1's message after shuffling.\n  For the shuffle-only setting, we focus on a tractable yet expressive \\emph{basic configuration}, where the target user's message follows $Y_1 \\sim P$ and the remaining users' messages are i.i.d.\\ samples from $Q$, i.e., $Y_2,\\dots,Y_n \\sim Q$. We derive asymptotic expressions for the mutual information quantities $I(Y_1;\\boldsymbol{Z})$ and $I(K;\\boldsymbol{Z})$ as $n \\to \\infty$, and demonstrate how this analytical framework naturally extends to settings with heterogeneous user distributions.\n  For the shuffle-DP setting, we establish information-theoretic upper bounds on total information leakage. When each user applies an $\\varepsilon_0$-DP mechanism, the overall leakage satisfies $I(K; \\boldsymbol{Z}) \\le 2\\varepsilon_0$ and $I(X_1; \\boldsymbol{Z}\\mid (X_i)_{i=2}^n) \\le (e^{\\varepsilon_0}-1)/(2n) + O(n^{-3/2})$. These results bridge shuffle differential privacy and mutual-information-based privacy.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15037v1",
    "categories": ["math.AP"],
    "authors": ["Jian Zhai", "Kelvin Shuangjian Zhang"],
    "title": "An inverse problem in optimal transport on closed Riemannian manifolds",
    "abstract": "We consider the problem of recovering the Riemannian metric on a compact closed manifold from the optimal transport maps when the underlying cost function is the squared Riemann distance. We show that the metric can be uniquely determined up to a multiplicative constant.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14976v1",
    "categories": ["math.GT", "math.DS"],
    "authors": ["Adam R. Smith"],
    "title": "Embeddings of mapping tori for end-periodic graph maps",
    "abstract": "End-periodic homotopy equivalences of infinite, locally finite graphs serve as dimension-one analogs of the end-periodic automorphisms traditionally defined on infinite-type surfaces. We demonstrate that if $Γ$ is an infinite graph with finitely many ends, and $g \\colon Γ\\to Γ$ is end-periodic, then its mapping torus $Z_g$ admits a flowline-preserving homotopy equivalence with a finite 2-complex. With additional hypotheses on $g$, this compactified mapping torus subsequently embeds in the mapping torus of a homotopy equivalence on a finite-rank graph via a $π_1$-injective, flow-preserving map. We prove that every mapping class of $Γ$ arising from an end-periodic homotopy equivalence contains a representative whose mapping torus realizes such an embedding.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14929v1",
    "categories": ["math.NA"],
    "authors": ["Ahmed E. Seleit"],
    "title": "Adaptive Ch Method with Local Coupled Multiquadrics for Solving Partial Differential Equations",
    "abstract": "We present a new adaptive collocation scheme for solving partial differential equations based on Local Coupled Multiquadrics (LCMQs) within a covers-and-nodes framework. The method, referred to as the Adaptive Ch Method, automatically prioritizes adjusting the local cover size C then refines local nodal spacing h to achieve a prescribed tolerance. Numerical examples for one- and two-dimensional Poisson problems demonstrate accurate solutions across a wide range of shape parameter values, while preserving the advantages of local collocation. The proposed approximation approach is truly meshless, requiring no element, connectivity or continuity to construct trial functions or weights.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14906v1",
    "categories": ["cs.IT"],
    "authors": ["Yasser Al Eryani"],
    "title": "Beyond the \"G\" Frontier: A Time Traveler's Century-Long Vision for Wireless Intelligence",
    "abstract": "This article travels one century into the future--from 2025 to 2125--through the analytical lens of the Information--Curvature Efficiency Law (ICEL). It contends that wireless evolution will not proceed through incremental generations such as 6G or 7G, but through a curvature-managed integration of electromagnetics, biology, thermodynamics, and cognition. The resulting infrastructure will constitute a global ecology of self-aware information flow, where geometry and communication converge to sustain both technological and biological life.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14877v1",
    "categories": ["math.FA"],
    "authors": ["Patricia Alonso Ruiz", "Valentia Fragkiadaki"],
    "title": "Dyadic fractional Sobolev spaces: Embeddings and algebra property",
    "abstract": "This paper studies a dyadic version of fractional Sobolev spaces in $\\mathbb{R}^n$ for $n\\geq 1$. It provides new proofs of the corresponding fractional Sobolev embedding as well as the algebra property of the spaces, which rely solely on dyadic techniques and in particular bypass the Fourier transform. Specific counterexamples are constructed to verify the failure of the algebra property in low-regularity ranges.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15685v1",
    "categories": ["math.OC", "eess.SY"],
    "authors": [
      "Eric Haag",
      "Yuhao Chen",
      "Giri Venkataramanan",
      "Manish K. Singh"
    ],
    "title": "Assessing Power Flow Controllability via Variable Line Reactance",
    "abstract": "The rapid growth of large data center loads and inverter-based generation is increasing the stress on transmission networks, while expanding grid capacity at the required pace remains challenging. Power flow controllers (PFCs) that adjust effective line reactances to redistribute flows are often viewed as an interim solution to improve transmission network utilization. Traditional flexibility metrics and analysis approaches for PFCs focus on a limited number of operating points and contingencies. Towards gaining system-wide insights, this paper introduces a framework to quantify network flow controllability- the extent to which line flows can be reshaped through reactance adjustments. We derive analytical results demonstrating that installing PFCs on all lines enables complete controllability of feasible flow patterns. Building on these, we conduct empirical studies on the IEEE 39-bus system to examine how controllability varies with the number of PFCs and their reactance adjustment range. These analyses employ a mixed-integer linear program to optimize the siting and sizing of PFCs. Finally, we validate findings under AC power flow physics using an optimization routine that steers flows toward desired setpoints.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15058v1",
    "categories": ["math.NA"],
    "authors": [
      "Jorn Zimmerling",
      "Mikhail Zaslavsky",
      "Alexander V. Mamonov",
      "Vladimir Druskin",
      "Anarzhan Abilgazy"
    ],
    "title": "Lippmann-Schwinger-Lanczos algorithm for inverse scattering problems with unknown reflectivity and loss distributions: One-dimensional Case",
    "abstract": "We consider one-dimensional inverse scattering in attenuating media where both the reflectivity and loss distributions are unknown. Mathematically, this corresponds to recovering the coefficients of a damped wave operator, or equivalently, a quadratic operator pencil in the frequency domain.\n  The Lippmann-Schwinger equation maps the unknown reflectivity and loss distribution to the measured scattered data. This mapping is nonlinear, as it requires knowledge of the internal wavefield, which itself depends on the reflectivity and loss distribution. The Lippmann-Schwinger-Lanczos method addresses this nonlinearity by approximating the internal solutions through the lifting of states from a reduced-order model constructed directly from the measured data.\n  In this work, we extend the method to dissipative problems, enabling the approximation of internal partial differential equation (PDE) solutions in media with both reflectivity and loss distributions. We present two complementary constructions of such internal solutions: one based on spectral data and another on frequency-domain measurements over a finite interval. This development establishes a direct link between data-driven reduced-order models for inverse problems and port-Hamiltonian dynamical systems, with reduced models obtained either from the associated spectral measure or via rational approximation. Compared to the Born approximation, which replaces the internal field with the background field, our approach yields more accurate internal reconstructions and enables faster and more robust recovery of the contrast as evidenced by our numerical experiments.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14810v1",
    "categories": ["math.NT"],
    "authors": ["Trey Smith"],
    "title": "A Generalized Elliott-Halberstam Conjecture Implying the Twin Prime Hypothesis",
    "abstract": "We propose a generalization of the Elliott-Halberstam conjecture concerning the distribution of prime pairs in arithmetic progressions. This conjecture, which we call the Generalized Elliott-Halberstam Conjecture for Shifted Convolutions (GEH-2), provides a level of distribution for correlations of the von Mangoldt function. We show that GEH-2 implies the twin prime conjecture, describe heuristic and analytic motivation, and discuss implications for prime gaps and $k$-tuple patterns.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.14954v1",
    "categories": ["math.NT"],
    "authors": ["Sam Chow", "Qing-Long Zhou"],
    "title": "Twisted Diophantine approximation for matrix transformations of tori",
    "abstract": "Consider a sequence of integral matrices $\\mathcal{A}=(A_n)_{n\\in\\N}$, and a $d$-tuple function ${\\bf r}=(r_1,\\ldots,r_d)\\colon \\N\\to (0,\\frac{1}{2})$. For a fixed vector ${\\bm α},$ we are interested in the set $\\mathcal{T}_{\\bm α}(\\mathcal{A}, {\\bf r})$ of vectors ${\\bm β}\\in[0,1)^{d}$ for which $A_n{\\bm α}~~\\!\\!\\!\\!\\!\\pmod{1}$ infinitely often lies in the box centred at ${\\bm β}$, with side lengths $2r_i(n)$ in each coordinate direction. Under mild conditions on $\\mathcal{A}$ and ${\\bf r}$, we prove a metric dichotomy for the size of $\\mathcal{T}_{\\bm α}(\\mathcal{A}, {\\bf r}),$ valid for almost every ${\\bm α}$ with respect to any fractal measure with a certain polynomial Fourier decay rate. Furthermore, removing all restrictions on ${\\bf r}$, we establish a metric dichotomy for Lebesgue almost every ${\\bm α}.$ This solves a variant of a conjecture of González Robert, Hussain, Shulga and Ward [Conjecture 1.10, Bull. London Math. Soc. 2025]. Finally, we also establish a Jarník-type theorem for $\\mathcal{T}_{\\bm α}(\\mathcal{A}, {\\bf r}).$",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15287v1",
    "categories": ["math.NA", "math.AP"],
    "authors": ["Jeffrey Galkowski", "Euan A. Spence"],
    "title": "Numerical analysis of the high-frequency Helmholtz equation using semiclassical analysis",
    "abstract": "We consider the numerical solution of high-frequency scattering problems modeled by the Helmholtz equation with a bounded obstacle. Although the analysis of this problem dates back at least 50 years, over the past decade or so, tools and techniques from $\\textit{semiclassical analysis}$ have provided a new perspective and been used to settle several long-standing open problems in this area. Semiclassical analysis works in phase space (i.e., position and frequency) and describes rigorously the extent to which solutions of high-frequency PDEs are dictated by the properties of the corresponding geometric-optic rays.\n  The goals of the article are to (i) give a introduction to semiclassical analysis aimed at non-experts and (ii) showcase some of the numerical-analysis results about finite-element methods, boundary-element methods, and domain-decomposition methods obtained using semiclassical techniques.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15021v1",
    "categories": ["math.AP"],
    "authors": ["Tianling Jin", "YanYan Li", "Hung V. Tran", "Xushan Tu"],
    "title": "A Liouville theorem for convex functions with periodic Monge-Ampère measure",
    "abstract": "Let $μ\\not\\equiv 0$ be a nonnegative locally finite periodic Borel measure on $\\mathbb{R}^n$. We show that any convex solution to the Monge-Ampère equation \\[ \\det D^2 u = μ\\quad \\text{in } \\mathbb{R}^n \\] admits a unique decomposition (up to addition of constants) as the sum of a quadratic polynomial and a periodic function. This result extends, in full generality, the earlier works for the case $μ=f(x)\\,\\mathrm{d} x$: when $\\log f \\in C^α$, it was established by Caffarelli and Li; and when $\\log f$ is merely bounded, it was proved by Li and Lu. Our result thus answers a question raised by Li and Lu. A key ingredient in the proof is a new dichotomous Harnack-type inequality for linearized Monge-Ampère equations with nonnegative periodic measures.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15527v1",
    "categories": [
      "math-ph",
      "cond-mat.stat-mech",
      "cond-mat.str-el",
      "quant-ph"
    ],
    "authors": [
      "Nicolas Crampé",
      "Quentin Labriet",
      "Lucia Morey",
      "Gilles Parez",
      "Luc Vinet"
    ],
    "title": "Inhomogeneous SSH models and the doubling of orthogonal polynomials",
    "abstract": "We analyze Su-Schrieffer-Heeger (SSH) models using the doubling method for orthogonal polynomial sequences. This approach yields the analytical spectrum and exact eigenstates of the models. We demonstrate that the standard SSH model is associated with the doubling of Chebyshev polynomials. Extending this technique to the doubling of other finite sequences enables the construction of Hamiltonians for inhomogeneous SSH models which are exactly solvable. We detail the specific cases associated with Krawtchouk and $q$-Racah polynomials. This work highlights the utility of polynomial-doubling techniques in obtaining exact solutions for physical models.",
    "date": "11-20"
  },
  {
    "link": "https://arxiv.org/pdf/2511.15635v1",
    "categories": ["math.NT"],
    "authors": ["Maleeha Khawaja", "Samir Siksek"],
    "title": "New Algebraic Points on Curves",
    "abstract": "Let $C$ be a smooth projective absolutely irreducible curve of genus at least 2, defined over the rationals. For a number field $L$, let $C(L)_{new} = \\{P \\in C(L) : \\mathbb{Q}(P)=L\\}$. Let $n$ be at least 2. We conjecture that $C(L)_{new}$ is empty for 100 percent of degree $n$ number fields $L$ when ordered by absolute discriminant. We prove our conjecture for $n=3$ with $C$ any of the modular curves $X_0(23)$, $X_0(29)$, $X_0(31)$ and $X_0(64)$. Moreover, we prove the analogue of this conjecture for the unit equation, again with $n=3$.",
    "date": "11-20"
  }
]
