[
  {
    "link": "https://arxiv.org/pdf/2601.21243v1",
    "categories": [
      "math.OC",
      "cs.LG",
      "math.NA"
    ],
    "authors": [
      "Amir Ali Farzin",
      "Yuen-Man Pun",
      "Philipp Braun",
      "Tyler Summers",
      "Iman Shames"
    ],
    "title": "Solving the Offline and Online Min-Max Problem of Non-smooth Submodular-Concave Functions: A Zeroth-Order Approach",
    "abstract": "We consider max-min and min-max problems with objective functions that are possibly non-smooth, submodular with respect to the minimiser and concave with respect to the maximiser. We investigate the performance of a zeroth-order method applied to this problem. The method is based on the subgradient of the Lovász extension of the objective function with respect to the minimiser and based on Gaussian smoothing to estimate the smoothed function gradient with respect to the maximiser. In expectation sense, we prove the convergence of the algorithm to an $ε$-saddle point in the offline case. Moreover, we show that, in the expectation sense, in the online setting, the algorithm achieves $O(\\sqrt{N\\bar{P}_N})$ online duality gap, where $N$ is the number of iterations and $\\bar{P}_N$ is the path length of the sequence of optimal decisions. The complexity analysis and hyperparameter selection are presented for all the cases. The theoretical results are illustrated via numerical examples.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21236v1",
    "categories": [
      "cs.IT",
      "cs.DM",
      "cs.DS"
    ],
    "authors": [
      "Huiling Xie",
      "Zitan Chen"
    ],
    "title": "Deletion-correcting codes for an adversarial nanopore channel",
    "abstract": "We study deletion-correcting codes for an adversarial nanopore channel in which at most $t$ deletions may occur. We propose an explicit construction of $q$-ary codes of length $n$ for this channel with $2t\\log_q n+Θ(\\log\\log n)$ redundant symbols. We also show that the optimal redundancy is between $t\\log_q n+Ω(1)$ and $2t\\log_q n-\\log_q\\log_2 n+O(1)$, so our explicit construction matches the existential upper bound to first order. In contrast, for the classical adversarial $q$-ary deletion channel, the smallest redundancy achieved by known explicit constructions that correct up to $t$ deletions is $4t(1+ε)\\log_q n+o(\\log n)$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21227v1",
    "categories": [
      "math.DG",
      "math.AP"
    ],
    "authors": [
      "Ben Andrews",
      "Glen Wheeler"
    ],
    "title": "Jellyfish exist",
    "abstract": "We show the existence of infinitely many geometrically distinct homothetic expanders (jellyfish) for the elastic flow, epicyclic shrinkers for the curve diffusion flow, and epicyclic expanders for the ideal flow.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21195v1",
    "categories": [
      "math.CO",
      "math.PR",
      "math.RT"
    ],
    "authors": [
      "Arvind Ayyer",
      "Sarah Brauner",
      "Jan de Gier",
      "Anne Schilling"
    ],
    "title": "$q$-deformations of the Tsetlin library",
    "abstract": "The Tsetlin library is a random shuffling process on permutations of $n$ letters, where each letter $i$ can be interpreted as a book; book $i$ is brought to the front of the bookshelf with an assigned probability $x_i$. We define a $q$-deformation of the Tsetlin library by replacing the symmetric group action on permutations by the action of the type $A$ Iwahori-Hecke algebra. We compute the stationary distribution and spectrum of this Markov chain by relating it to a Markov chain on complete flags over the finite field vector space $\\mathbb{F}_q^n$ and applying techniques from semigroup theory. We also generalize the $q$-Tsetlin library to words (with repeated letters), and compute its stationary distribution and spectrum.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21158v1",
    "categories": [
      "math.CO",
      "math.PR"
    ],
    "authors": [
      "Jonathan Boretsky",
      "Alvaro Cornejo",
      "Reuven Hodges",
      "Paul Horn",
      "Nathan Lesnevich",
      "Tyrrell McAllister"
    ],
    "title": "Comparability in Bruhat orders",
    "abstract": "We determine the sharp asymptotic scale of the probability that two uniformly random permutations are comparable in weak Bruhat order, showing that $\\mathbb{P}(σ_1 \\preceq_W σ_2)=\\exp\\Bigl(\\bigl(-\\tfrac12+o(1)\\bigr)\\,n\\log n\\Bigr)$. This significantly improves both of the best known bounds, due to Hammett and Pittel, which placed this probability between $\\exp((-1+o(1))n\\log n)$ and $\\exp(-Θ(n))$. We also improve the best known lower bound for strong Bruhat-order comparability, due to the same authors, by proving a subexponential lower bound. The Bruhat orders are natural partial orders on the symmetric group, appearing in wide-reaching settings including the geometry of flag manifolds, the representation theory of $\\mathfrak{S}_{n}$, and the combinatorics of the permutohedron. To analyze weak Bruhat order, we combine classic analytic, tableau-theoretic, and poset-theoretic tools, including the Plancherel measure and the RSK bijection. For strong Bruhat order we construct large families where members are comparable with high probability. Our proof that members are comparable combines the tableau criterion with an associated random-walk-type deviation process.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21073v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Adrián Esparza-Amador",
      "Mónica Moreno Rocha"
    ],
    "title": "Dynamics of Newton's method for odd and even elliptic functions",
    "abstract": "We investigate Newton's method applied to any odd or any even elliptic function with an arbitrary period lattice. For any function of this type whose set of poles coincides with its period lattice, we show that the Julia set of its Newton map is connected, as long as no Herman rings exist. Moreover, we provide sufficient conditions on the Newton's method of any odd or even elliptic function to exhibit wandering domains coexisting with attracting basins. This phenomenon was first reported by Florido and Fagella for the Newton's method applied to a family of entire functions; however, our approach does not employ the lifting technique. We also provide a detailed study of a one-parameter family of elliptic functions given by $\\wp_Λ+b$ with $Λ$ any triangular period lattice and $b\\in\\mathbb{C}$. We show that their associated Newton maps do not exhibit Herman rings or Baker domains, and any other Fatou component, including wandering, is bounded.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21034v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Steven Brown"
    ],
    "title": "A proof of Spence's formula using the reciprocity law for Dedekind sums",
    "abstract": "In 1963, Edward Spence published a proof of the following\n  With $φ$ being Euler totient function, if $n>1$ is an integer, and if \\begin{equation*} 0<a_1<\\cdots<a_{φ(n)}<n, \\end{equation*} are the positive integers less than $n$, coprime with $n$, then \\begin{equation*} \\sum_{j=1}^{φ(n)}ja_j = \\frac{φ(n)}{24}\\left(8nφ(n)+6n+2φ(m)(-1)^{ω(m)}-2^{ω(m)}\\right), \\end{equation*} where $m$ is the square-free part of $n$ and $ω(m)$ is the number of prime factors of $m$.\n  Spence's proof relies on an ingenious observation considering Nagell's totient function. Later in 1971, Lucien Van Hamme provided an alternative proof of the result using Fourier analysis and previous work from Hubert Delange in 1968. In this paper I propose another proof of the formula using the reciprocity law for Dedekind sums. If the formula is of interest on its own, it also plays a role in the analysis of the distribution of the $a_j$ as suggested by the work from Hubert Delange.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21018v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Barbara Kaltenbacher",
      "William Rundell"
    ],
    "title": "Identification of space-dependent coefficients in two competing terms of a nonlinear subdiffusion equation",
    "abstract": "We consider a (sub)diffusion equation with a nonlinearity of the form $pf(u)-qu$, where $p$ and $q$ are space dependent functions. Prominent examples are the Fisher-KPP, the Frank-Kamenetskii-Zeldovich and the Allen-Cahn equations. We devise a fixed point scheme for reconstructing the spatially varying coefficients from interior observations a) at final time under two different excitations b) at two different time instances under a single excitation. Convergence of the scheme as well as local uniqueness of these coefficients is proven. Numerical experiments illustrate the performance of the reconstruction scheme.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21580v1",
    "categories": [
      "math.CO",
      "math.OC"
    ],
    "authors": [
      "Qingjie Ye"
    ],
    "title": "On the minimum doubly resolving set problem in line graphs",
    "abstract": "Given a connected graph $G$ with at least three vertices, let $d_G(u,v)$ denote the distance between vertices $u,v\\in V(G)$. A subset $S\\subseteq V$ is called a doubly resolving set (DRS) of $G$ if for any two distinct vertices $u, v \\in V(G)$, there exists a pair $\\{x,y\\}\\subseteq S$ such that $d_G(u,x)-d_G(u,y)\\neq d_G(v,x)-d_G(v,y)$. This paper studies the minimum cardinality of a DRS in the line graph of $G$, denoted by $Ψ(L(G))$. First, we prove that computing $Ψ(L(G))$ is NP-hard, even when $G$ is a bipartite graph. Second, we establish that $\\lceil \\log_2 (1+Δ(G))\\rceil \\le Ψ(L(G)) \\le |V(G)| - 1$ holds for all $G$ with maximum degree $Δ(G)$, and show that both inequalities are tight. Finally, we determine the exact value of $Ψ(L(G))$ provided $G$ is a tree.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21556v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Dimpy Mala Dutta",
      "A. M. Buhphang",
      "M. B. Rege"
    ],
    "title": "On J-torsionless modules",
    "abstract": "In this paper, we introduce the concept of JReject of a class of modules as a generalization of the notion of reject of a class of modules. We also introduce the notion of J-torsionless modules and give a characterization of regularity on the basis of the J-torsionless condition. A necessary and sufficient condition on $R$ is also given for every cyclic module over $R$ to be J-torsionless. Finally, we give a description of self-injective rings over which every module is J-torsionless.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21539v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Lucia Celli"
    ],
    "title": "Wide neural networks with general weights: convergence rate and explicit dependence on the hyper-parameters",
    "abstract": "Using Stein's method techniques introduced by Chatterjee (2008) and further extended by Kasprzak and Peccati (2022) and by Lachièze-Rey and Peccati (2017), we derive novel quantitative bounds on the convergence in distribution of feed-forward fully connected neural networks (with Lipschitz activation functions) towards Gaussian processes, as the hidden layer width $n$ tends to infinity. We consider networks initialized with independent and identically distributed (i.i.d.) weights possessing sufficiently many finite moments, and i.i.d. Gaussian biases independent of the weights. Specifically, when the network is evaluated at a single input, we obtain convergence rates of order $O(n^{-1/2})$ in both total variation and Wasserstein distances. When evaluated at a general finite collection of inputs, we establish bounds of the same order in terms of the convex distance. All bounds are given in explicit and computable form. As a consequence of our estimates, we also deduce a novel convergence result in the regime where the depth of the neural network increases simultaneously with the width $n$, up to order $O\\big((\\log_2 n)^{1/3}\\big)$. To the best of our knowledge, this is the first CLT in the infinite width/depth limit holding for general (nonlinear) Lipschitz activation functions and non-Gaussian weight distributions. Our analysis yields several results of independent interest, including: (i) an explicit lower bound on the determinant of the limiting covariance matrix and (ii) new advances in Stein's method, both for the one-dimensional Stein's equation associated with the square of a Lipschitz function and for the multivariate Stein's equation associated with the tensor product of a Lipschitz function with itself.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21395v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Zikang Dong",
      "Takao Komatsu"
    ],
    "title": "Finite $q$-multiple harmonic sums on $2-\\cdots-2,1-\\cdots-1$ indices",
    "abstract": "There are many results for explicit expressions about $q$-multiple zeta values or $q$-harmonic sums on $A-\\cdots-A$ indices, that is, the indices are the same. Though the way to treat $q$-multiple zeta values unless the indices are the same, it has been successful to get the explicit expression of $q$-harmonic sums on $1-\\cdots-1,2,1-\\cdots-1$ indices. In this paper, we shall consider more general results when the ratio of indices of $2$ to indices of $1$ increases.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21368v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Peng Yang",
      "Zhimin Zhang"
    ],
    "title": "Natural superconvergence points for splines",
    "abstract": "This paper develops a unified theory of natural superconvergence points for polynomial spline approximations to second-order elliptic problems. Beginning with the one-dimensional case, we establish that when a point $x_0$ is a local symmetric center of the partition, the numerical error $(u-u_h)^{(s)}(x_0)$ exhibits superconvergence whenever the polynomial degree $k$ and the derivative order $s$ share the same parity. In particular, for the smoothest spline (B-spline) solution, the abundance of superconvergence points allows us to construct asymptotic expansion of the error within the element that fully characterize all superconvergence points, for both function values and derivatives. The theoretical framework is then extended to higher-dimensional settings on simplicial and tensor-product meshes, and the essential conclusions are preserved, with one-dimensional derivatives generalized to mixed derivatives. Numerical experiments demonstrate that superconvergence persists even in extremely localized symmetric regions, revealing that superconvergence points are both readily attainable and follow systematic distribution patterns.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21330v1",
    "categories": [
      "cs.IT",
      "quant-ph"
    ],
    "authors": [
      "Avijit Mandal",
      "Henry D. Pfister"
    ],
    "title": "Belief Propagation with Quantum Messages for Symmetric Q-ary Pure-State Channels",
    "abstract": "Belief propagation with quantum messages (BPQM) provides a low-complexity alternative to collective measurements for communication over classical--quantum channels. Prior BPQM constructions and density-evolution (DE) analyses have focused on binary alphabets. Here, we generalize BPQM to symmetric q-ary pure-state channels (PSCs) whose output Gram matrix is circulant. For this class, we show that bit-node and check-node combining can be tracked efficiently via closed-form recursions on the Gram-matrix eigenvalues, independent of the particular physical realization of the output states. These recursions yield explicit BPQM unitaries and analytic bounds on the fidelities of the combined channels in terms of the input-channel fidelities. This provides a DE framework for symmetric q-ary PSCs that allows one to estimate BPQM decoding thresholds for LDPC codes and to construct polar codes on these channels.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21295v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Song Liu",
      "Zhaoyang Yin"
    ],
    "title": "Blow-up phemomenon for the Geng-Xue system and related models",
    "abstract": "In this paper, we consider the Cauchy problem of the Geng-Xue system with cubic nonlinearity. Firstly, we prove a blow-up criteria in the low besov space. Secondly, we prove the blow-up phenomenon by using the method which does not require any conservation law. Finally, we extend our results to the b-family of two-component system with cubic nonlinearity.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21509v1",
    "categories": [
      "math.DG",
      "math.GR",
      "math.MG"
    ],
    "authors": [
      "Enrico Le Donne",
      "Sebastiano Nicolussi Golo",
      "Andrea Tettamanti"
    ],
    "title": "Quantitative versions of Pansu Asymptotic Theorem and of Mitchell Tangent Theorem",
    "abstract": "We quantitatively study the speed of convergence of geodesic Lie groups to their metric limits. For nilpotent geodesic Lie groups, we give estimates on the difference of the original metrics and the asymptotic metrics, while for general geodesic Lie groups, we give similar estimates for the difference of the original metrics and the tangent metrics. In both settings, our results sharpen existing bounds in the literature.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21491v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "D. Latini"
    ],
    "title": "Rigid Body Rotors in Planar Potentials: A Novel type of Superintegrable Mechanical Systems in the Plane",
    "abstract": "We investigate the superintegrability of rigid body rotors coupled to planar systems. In particular, we study the isotropic harmonic oscillator in two dimensions, with its (central) force acting on the rotor's center of mass constrained to move in the plane. By including an internal rotational degree of freedom described by a rigid rotor, the resulting planar system possesses three degrees of freedom: two translational and one rotational. When the orbital motion and the internal rotation are tuned to resonance, additional integrals of motion arise, extending the hidden symmetry algebras of the underlying models. For the oscillator, the well-known $\\mathfrak{su}(2)$ symmetry algebra can be enlarged by the presence of the rotor, with the conserved momentum $p_θ$ reasonably playing the role of a deformation parameter. These algebraic structures remain to be properly understood, and we hope that this short letter will serve as an invitation to further investigate these interesting models. To close the work, we also examine the oscillator in a vertical plane, in the presence of a rotor, under the effect of a uniform gravitational field, showing that the algebraic structure persists as a translated version of the isotropic case, as expected. In all these settings, the extended dynamics admits five functionally independent integrals, thereby confirming maximal superintegrability. Our simple yet nontrivial results suggest that rigid-body rotors provide a natural mechanism for generating new families of (resonant) superintegrable systems, along with their associated symmetry algebras, an outcome that aligns with the main objective of this work.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21466v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Anna Gori",
      "Giulia Sarfatti",
      "Fabio Vlacci"
    ],
    "title": "A note on irreducible slice algebraic sets",
    "abstract": "In this short note we prove that if $I$ is a right radical and quasi prime ideal in the ring of quaternionic slice regular polynomials, then the symmetrization $\\mathbb S_{V_c(I)}$ is an irreducible algebraic set, where $V_c(I)$ is the set of common zeros with commuting components of polynomials in $I$. Combining this fact with the results proved in our previous paper [3], we obtain that for $I$ radical, $V_c(I)$ is irreducible if and only if $I$ is quasi prime.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21431v1",
    "categories": [
      "math.DS",
      "math.DG"
    ],
    "authors": [
      "Mounib Abouanass"
    ],
    "title": "On transversely holomorphic partially hyperbolic flows",
    "abstract": "In this paper, we study transversely holomorphic partially hyperbolic flows, i.e. those whose holonomy pseudo-group is given by biholomorphic maps. We prove in the seven-dimensional case that under the assumption that the subcenter distribution is integrable to a flow invariant compact foliation with trivial holonomy, then the flow projects, by a smooth fiber bundle map, to a transversely holomorphic Anosov flow on a smooth five-dimensional manifold which is, in case of topological transitivity, either $C^\\infty$ orbit equivalent to the suspension of a hyperbolic automorphism of a complex torus, or, up to finite covers, $C^\\infty$-orbit equivalent to the geodesic flow of a compact hyperbolic manifold.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20978v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Omid Khosravi",
      "Mehdi Tatari"
    ],
    "title": "Solution of Advection Equation with Discontinuous Initial and Boundary Conditions via Physics-Informed Neural Networks",
    "abstract": "In this paper, we investigate several techniques for modeling the one-dimensional advection equation for a specific class of problems with discontinuous initial and boundary conditions using physics-informed neural networks (PINNs). To mitigate the spectral bias phenomenon, we employ a Fourier feature mapping layer as the input representation, adopt a two-stage training strategy in which the Fourier feature parameters and the neural network weights are optimized sequentially, and incorporate adaptive loss weighting. To further enhance the approximation accuracy, a median filter is applied to the spatial data, and the predicted solution is constrained through a bounded linear mapping. Moreover, for certain nonlinear problems, we introduce a modified loss function inspired by the upwind numerical scheme to alleviate the excessive smoothing of discontinuous solutions typically observed in neural network approximations.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20973v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Asaf Cohen",
      "Ruolan He",
      "Yuqiong Wang"
    ],
    "title": "Thompson Sampling Algorithm for Stochastic Games",
    "abstract": "We study a stochastic differential game with $N$ competitive players in a linear-quadratic framework with ergodic cost, where $d$-dimensional diffusion processes govern the state dynamics with an unknown common drift (matrix). Assuming a Gaussian prior on the drift, we use filtering techniques to update its posterior estimates. Based on these estimates, we propose a Thompson-sampling-based algorithm with dynamic episode lengths to approximate strategies. We show that the Bayesian regret for each player has an error bound of order $O(\\sqrt{T\\log(T)})$, where $T$ is the time-horizon, independent of the number of players. This implies that average regret per unit time goes to zero. Finally, we prove that the algorithm results in a Nash equilibrium.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20970v1",
    "categories": [
      "math.OC",
      "cs.IT",
      "cs.LG"
    ],
    "authors": [
      "Gabriel Ponte",
      "Marcia Fampa",
      "Jon Lee"
    ],
    "title": "The augmented NLP bound for maximum-entropy remote sampling",
    "abstract": "The maximum-entropy remote sampling problem (MERSP) is to select a subset of s random variables from a set of n random variables, so as to maximize the information concerning a set of target random variables that are not directly observable. We assume throughout that the set of all of these random variables follows a joint Gaussian distribution, and that we have the covariance matrix available. Finally, we measure information using Shannon's differential entropy.\n  The main approach for exact solution of moderate-sized instances of MERSP has been branch-and-bound, and so previous work concentrated on upper bounds. Prior to our work, there were two upper-bounding methods for MERSP: the so-called NLP bound and the spectral bound, both introduced 25 years ago. We are able now to establish domination results between these two upper bounds. We propose an ``augmented NLP bound'' based on a subtle convex relaxation. We provide theoretical guarantees, giving sufficient conditions under which the augmented NLP bound strictly dominates the ordinary NLP bound. In addition, the augmented NLP formulation allows us to derive upper bounds for rank-deficient covariance matrices when they satisfy a technical condition. This is in contrast to the earlier work on the ordinary NLP bound that worked with only positive definite covariance matrices. Finally, we introduce a novel and very effective diagonal-scaling technique for MERSP, employing a positive vector of parameters. Numerical experiments on benchmark instances demonstrate the effectiveness of our approaches in advancing the state of the art for calculating upper bounds on MERSP.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20897v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Cihan Sabuncu"
    ],
    "title": "Missing digits and sums of two prime squares",
    "abstract": "We investigate integers whose base $g$ expansion omits a fixed digit and which can be represented as a sum of two prime squares. In the first part of the paper, we apply the Hardy--Littlewood circle method to obtain asymptotic formulas for weighted count of representations of such integers up to $g^k$ as $k\\to\\infty$, where we weight by the von Mangoldt function. In this case, we also get an interesting bias depending on the fixed digit we are missing. In the second part, combining the circle method with sieve methods, we study the second moment of the corresponding unweighted counting function. This allows us to get a nontrivial lower bound for the cardinality of the set $$\\{ n \\leq g^k : n \\text{ omits the digit } b \\text{ in its base } g \\text{ expansion and } n = p^2 + q^2 \\text{ for some primes } p,q \\}. $$",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20865v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Emmanuel Pio Pastore",
      "Francesco De Rango"
    ],
    "title": "The Noncomputability of Immune Reaction Complexity: Algorithmic Information Gaps under Effective Constraints",
    "abstract": "We introduce a validity-filtered, certificate-based view of reactions grounded in Algorithmic Information Theory. A fixed, total, input-blind executor maps a self-delimiting advice string to a candidate response, accepted only if a decidable or semi-decidable validity predicate V(x, r) holds. The minimum feasible realizer complexity M(x) = min_{r: V(x,r)=1} K(r), with K denoting prefix Kolmogorov complexity, measures the minimal information required for a valid outcome. We define the Normalized Advice Quantile (NAQ) as the percentile of M(x) across a reference pool, yielding a scale-free hardness index on [0, 1] robust to the choice of universal machine and comparable across task families. An Exact Realizer Identity shows that the minimal advice for any input-blind executor equals M(x) up to O(1), while a description plus selection upper bound refines it via computable feature maps, separating description cost K(y) from selection cost log i_y(x). In finite-ambiguity regimes M(x) approximately equals min_y K(y); in generic-fiber regimes the bound is tight. NAQ is quasi-invariant under bounded enumeration changes. An operational converse links NAQ to rate-distortion: communicating advice with error epsilon requires average length near the entropy of target features. Extensions include a resource-bounded variant NAQ_t incorporating time-penalized complexity (Levin's Kt) and an NP-style setting showing linear worst-case advice n - O(1). Finally, a DKW bound guarantees convergence of empirical NAQ estimates, enabling data-driven calibration via compressor-based proxies.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21442v1",
    "categories": [
      "math.NT",
      "math.CA"
    ],
    "authors": [
      "Kevin Barreto",
      "Jiwon Kang",
      "Sang-hyun Kim",
      "Vjekoslav Kovač",
      "Shengtong Zhang"
    ],
    "title": "Irrationality of rapidly converging series: a problem of Erdős and Graham",
    "abstract": "Answering a question of Erdős and Graham, we show that the double exponential growth condition $\\limsup_{n\\to\\infty}a_n^{1/φ^n}=\\infty$ for a monotonically increasing sequence of positive integers $\\{a_n\\}_{n=1}^\\infty$, together with the bound $a_n a_{n+1}\\geq n^{1+τ}$, is sufficient for the series $\\sum_{n=1}^\\infty 1/(a_n a_{n+1})$ to have an irrational sum; here $φ$ denotes the golden ratio $(1+\\sqrt{5})/2$ and $τ>0$. We also provide a positive generalization to $\\sum_{n=1}^\\infty 1/(a_n^{w_0}\\cdots a_{n+d-1}^{w_{d-1}})$, and a negative result showing that some of its instances are essentially optimal. The original problem was autonomously solved by the AI agent \\emph{Aletheia}, powered by Gemini Deep Think, while the remaining material is largely a product of human-AI interactions.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20988v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Gabor Lippner",
      "Arturo Ortiz San Miguel"
    ],
    "title": "Maximizing subgraph counts in regular graphs",
    "abstract": "Given a graph $H$, we investigate the $d$-regular graphs $G$ with the highest $H$-density. We reframe the problem as a continuous optimization problem on the eigenvalues of $G$ by relating injective homomorphism numbers from $H$ and homomorphism numbers from quotient graphs of $H$. For almost all $H$, this relation has non-spectral terms, which require bounding by spectral terms in a way that is sharp at the optimal graph.\n  For bipartite $H$ and $d$ large enough, we show $G$ consists of disjoint copies of $K_{d,d}$. For non-bipartite $H$ and $d$ sufficiently large, $G$ is a collection of disjoint $K_{d+1}$ graphs. For $H=C_5$ and $d=3$, disjoint Petersen graphs emerge.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21412v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Alexei Borodin",
      "Alexey Bufetov"
    ],
    "title": "Leaders in multi-type TASEP",
    "abstract": "We study the totally asymmetric simple exclusion process (TASEP) on $\\mathbb{Z}$ with step initial condition, in which all particles have distinct types. Our main object of interest is the type of the rightmost particle -- the leader -- at large time $t$. We prove a central limit theorem for this random variable. Somewhat unexpectedly, the problem is closely connected to certain observables of voter and coalescing processes on $\\mathbb{Z}$; we therefore derive their asymptotics as well. We also analyze the large-time behavior of a few other related observables, including certain multi-particle ones.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21404v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "I. V. Podvigin",
      "V. V. Ryzhikov"
    ],
    "title": "The full diapason of convergence rates of Birkhoff averages for ergodic flows",
    "abstract": "For an ergodic flow, a range of rates of convergence of Birkhoff averages from the maximum rate to an arbitrarily slow rate is realized by choosing the averaging function. For torus windings, the continuity of the averaging functions is ensured. This complements Krengel's classical result on the slow rates of convergence of means for ergodic automorphisms.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21355v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Rongxing Du",
      "Hoi-To Wai"
    ],
    "title": "Decentralized Learning with Dynamically Refined Edge Weights: A Data-Dependent Framework",
    "abstract": "This paper aims to accelerate decentralized optimization by strategically designing the edge weights used in the agent-to-agent message exchanges. We propose a Dynamic Directed Decentralized Gradient (D3GD) framework and show that the proposed data-dependent framework is a practical alternative to the classical directed DGD (Di-DGD) algorithm for learning on directed graphs. To obtain a strategy for edge weights refinement, we derive a design function inspired by the cost-to-go function in a new convergence analysis for Di-DGD. This results in a data-dependent dynamical design for the edge weights. A fully decentralized version of D3GD is developed such that each agent refines its communication strategy using only neighbor's information. Numerical experiments show that D3GD accelerates convergence towards stationary solution by 30-40\\% over Di-DGD, and learns edge weights that adapt to data similarity.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21668v1",
    "categories": [
      "math.NA",
      "physics.comp-ph",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "authors": [
      "Philipp Krah",
      "Zetao Lin",
      "R. -Paul Wilhelm",
      "Fabio Bacchini",
      "Jean-Christophe Nave",
      "Virginie Grandgirard",
      "Kai Schneider"
    ],
    "title": "A Hybrid semi-Lagrangian Flow Mapping Approach for Vlasov Systems: Combining Iterative and Compositional Flow Maps",
    "abstract": "We propose a hybrid semi-Lagrangian scheme for the Vlasov--Poisson equation that combines the Numerical Flow Iteration (NuFI) method with the Characteristic Mapping Method (CMM). Both approaches exploit the semi-group property of the underlying diffeomorphic flow, enabling the reconstruction of solutions through flow maps that trace characteristics back to their initial positions. NuFI builds this flow map iteratively, preserving symplectic structure and conserving invariants, but its computational cost scales quadratically with time. Its advantage lies in a compact, low-dimensional representation depending only on the electric field. In contrast, CMM achieves low computational costs when remapping by composing the global flow map from explicitly stored submaps. The proposed hybrid method merges these strengths: NuFi is employed for accurate and conservative local time stepping, while CMM efficiently propagates the solution through submap composition. This approach reduces storage requirements, maintains accuracy, and improves structural properties. Numerical experiments demonstrate the effectiveness of the scheme and highlight the trade-offs between memory usage and computational cost. We benchmark against a semi-Lagrangian predictor-corrector scheme used in modern gyrokinetic codes, evaluating accuracy and conservation properties.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21620v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Miquel Saucedo",
      "Sergey Tikhonov"
    ],
    "title": "Heisenberg's inequality in $L^p$",
    "abstract": "In this paper, we obtain non-symmetric and symmetric versions of the classical Heisenberg-Pauli-Weyl uncertainty principle in Lebesgue spaces with power weights.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21585v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Ruofeng Rao",
      "Jialin Huang",
      "Xiaodi Li"
    ],
    "title": "Stability analysis of nontrivial stationary solution and constant equilibrium point of reaction-diffusion neural networks with time delays under Dirichlet zero boundary value",
    "abstract": "In this paper, Lyapunov-Razumikhin technique, design of state-dependent switching laws, a fixed point theorem and variational methods are employed to derive the existence and the unique existence results of globally exponentially stable (positive) stationary solution of delayed reaction-diffusion cell neural networks under Dirichlet zero boundary value, including the global stability criteria in the classical meaning. Next, sufficient conditions are proposed to guarantee the global stability invariance of ordinary differential systems under the influence of diffusions. New theorems show that the diffusion is a double-edged sword in judging the stability of diffusion systems. Besides, an example is constructed to illuminate that any non-zero constant equilibrium point must be not in the phase plane of dynamic system under Dirichlet zero boundary value, or it must lead to a contradiction. Next, under Lipschitz assumptions on active function, another example is designed to prove that the small diffusion effect will cause the essential change of the phase plane structure of the dynamic behavior of the delayed neural networks via a Saddle point theorem. Finally, a numerical example illustrates the feasibility of the proposed methods. It is worth mentioning that some interesting mathematical problems are originally put forward in the last chapter.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21563v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Stanisław M. S. Halkiewicz"
    ],
    "title": "Seymour's Second Neighbourhood Conjecture for Oriented Graphs of Order at Most Seven and Split-Twin Extensions",
    "abstract": "For an oriented graph $D$, let $N_1^+(v)$ denote the out-neighborhood of a vertex $v$, and let $N_2^+(v)$ be the set of vertices reachable from $v$ by a directed path of length two that are neither out-neighbors of $v$ nor equal to $v$. The Second Neighborhood Conjecture of Seymour asserts that every oriented graph contains a vertex $v$ with $|N_2^+(v)| \\ge |N_1^+(v)|$. Equivalently, if one defines the second neighborhood invariant \\[ Δ(D)=\\max_{v\\in V(D)}\\bigl(|N_2^+(v)|-|N_1^+(v)|\\bigr), \\] the conjecture asserts that $Δ(D)\\ge 0$ for all oriented graphs.\n  We prove by exhaustive computation that $Δ(D)\\ge 0$ for every oriented graph on at most seven vertices. We also introduce a local graph operation, called a split--twin extension, and prove that it preserves the inequality $Δ(D)\\ge 0$. Consequently, $Δ(D)\\ge 0$ holds for infinite inductively generated families of oriented graphs.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21241v1",
    "categories": [
      "math.NA",
      "physics.flu-dyn"
    ],
    "authors": [
      "Simone Chiocchetti",
      "Giovanni Russo"
    ],
    "title": "An efficient implicit scheme for the multimaterial Euler equations in Lagrangian coordinates",
    "abstract": "Stratified fluids composed of a sequence of alternate layers show interesting macroscopic properties, which may be quite different from those of the individual constituent fluids. On a macroscopic scale, such systems can be considered a sort of fluid metamaterial. In many cases each fluid layer can be described by Euler equations following the stiffened gas equation of state. The computation of detailed numerical solutions of such stratified material poses several challenges, first and foremost the issue of artificial smearing of material parameters across interface boundaries. Lagrangian schemes completely eliminate this issue, but at the cost of rather stringent time step restrictions. In this work we introduce an implicit numerical method for the multimaterial Euler equations in Lagrangian coordinates. The implicit discretization is aimed at bypassing the prohibitive time step restrictions present in flows with stratified media, where one of the materials is particularly dense, or rigid (or both). This is the case for flows of water-air mixtures, air-granular media, or similar high density ratio systems. We will present the novel discretisation approach, which makes extensive use of the remarkable structure of the governing equations in Lagrangian coordinates to find the solution by means of a single implicit discrete wave equation for the pressure field, yielding a symmetric positive definite structure and thus a particularly efficient algorithm. Additionally, we will introduce simple filtering strategies for counteracting the emergence of pressure or density oscillations typically encountered in multimaterial flows, and will present results concerning the robustness, accuracy, and performance of the proposed method, including applications to stratified media with high density and stiffness ratios.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21224v1",
    "categories": [
      "math.FA",
      "math.CA",
      "math.SP"
    ],
    "authors": [
      "Kevin Hughes",
      "Arie Israel",
      "Azita Mayeli"
    ],
    "title": "Wave Packets and Eigenvalue Estimates for Limiting Operators on the Disk",
    "abstract": "We study two-dimensional spatio-spectral limiting operators \\[ T_R := P_{D(R)} B_S P_{D(R)} : L^2(\\mathbb{R}^2) \\rightarrow L^2(\\mathbb{R}^2), \\] where $D(R)$ is a disk of radius $R>1$, $S\\subset\\mathbb{R}^2$ is a domain with well-shaped boundary, $P_{D(R)}$ is the orthogonal projection on the subspace of functions supported on $D(R)$, and $B_S$ is the orthogonal projection on the subspace of functions whose Fourier transform is supported on $S$. We construct a disk-adapted wave-packet frame for $L^2(D(R))$ with frame bounds uniform in $R$ using Gevrey-$s$ cutoffs ($s>1$) to obtain near-exponential Fourier localization. Exploiting these localization estimates, we bound the size of the eigenvalue plunge-region for $T_R$ and prove that for each $s>1$ and each $\\varepsilon\\in(0,1/2)$, \\[ \\#\\{k : λ_k(T_R)\\in(\\varepsilon,1-\\varepsilon)\\} = O\\!\\left(R (\\log(R/\\varepsilon))^{1+2s}\\right), \\] with constants depending on $s$ and the geometric parameters of $S$. This bound improves existing plunge-region estimates in the classical setting where both domains are disks, when $\\varepsilon$ scales like $R^{-ν}$ for a fixed $ν> 0$. By an affine transformation, the same result holds if $D(R)$ is a scaled ellipse.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21156v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Xin-Tong Zhang",
      "Xue-ping Wang"
    ],
    "title": "Further results on fuzzy negations and implications induced by fuzzy conjunctions and disjunctions",
    "abstract": "In this article, we deeply investigate some properties of fuzzy negations induced from fuzzy conjunctions (resp. disjunctions), which are then applied to characterizing the fuzzy negations. We further use the obtained characterization of fuzzy negations to explore some properties of $(D,N)$-implications generated from fuzzy disjunctions and negations. We finally describe $(D,N)$-implications (resp. continuous $(D,N)$-implications) generated from fuzzy disjunctions and negations.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21118v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Jason Block"
    ],
    "title": "Measuring the Complexity of Countable Presburger Models",
    "abstract": "We take two approaches to classifying the complexity of Presburger models: Scott analysis and degree spectra. In particular, we investigate the possible Scott sentence complexities and possible degree spectra of models of Presburger arithmetic. Many of our results will be achieved by showing how given a linear order $\\mathcal{L}$, we can construct a Presburger group $P_\\mathcal{L}$ that maintains much of the structure of $\\mathcal{L}$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21080v1",
    "categories": [
      "math.NA",
      "cs.LG",
      "math-ph"
    ],
    "authors": [
      "Lizuo Liu",
      "Lu Zhang",
      "Anne Gelb"
    ],
    "title": "Parametric Hyperbolic Conservation Laws: A Unified Framework for Conservation, Entropy Stability, and Hyperbolicity",
    "abstract": "We propose a parametric hyperbolic conservation law (SymCLaw) for learning hyperbolic systems directly from data while ensuring conservation, entropy stability, and hyperbolicity by design. Unlike existing approaches that typically enforce only conservation or rely on prior knowledge of the governing equations, our method parameterizes the flux functions in a form that guarantees real eigenvalues and complete eigenvectors of the flux Jacobian, thereby preserving hyperbolicity. At the same time, we embed entropy-stable design principles by jointly learning a convex entropy function and its associated flux potential, ensuring entropy dissipation and the selection of physically admissible weak solutions. A corresponding entropy-stable numerical flux scheme provides compatibility with standard discretizations, allowing seamless integration into classical solvers. Numerical experiments on benchmark problems, including Burgers, shallow water, Euler, and KPP equations, demonstrate that SymCLaw generalizes to unseen initial conditions, maintains stability under noisy training data, and achieves accurate long-time predictions, highlighting its potential as a principled foundation for data-driven modeling of hyperbolic conservation laws.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20977v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Paulo Michel F. Yamagishi",
      "Marcia Fampa",
      "Jon Lee"
    ],
    "title": "The dual-path fixing strategy and its application to the set-covering problem",
    "abstract": "We introduce the dual-path fixing strategy to exploit dual algorithms for solving relaxations of mixed-integer nonlinear-optimization problems. Such dual algorithms are naturally applied in the context of branch-and-bound, and eventual impact on the success of branch-and-bound is our strong motivation. Our fixing strategy aims to be more powerful than the common strategy of fixing variables based on a single dual-feasible solution (e.g., standard reduced-cost fixing for mixed-integer linear optimization), but to be much faster than ``strong fixing'', essentially requiring no more time than that of the dual algorithm that we exploit. We have successfully tested our ideas on mixed-integer linear-optimization set-covering instances from the literature, in the context of the dual-simplex method applied to the continuous relaxations.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21333v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Pinxi Gong",
      "Lexiao Lai",
      "Jianhao Ma"
    ],
    "title": "Certifying optimality in nonconvex robust PCA",
    "abstract": "Robust principal component analysis seeks to recover a low-rank matrix from fully observed data with sparse corruptions. A scalable approach fits a low-rank factorization by minimizing the sum of entrywise absolute residuals, leading to a nonsmooth and nonconvex objective. Under standard incoherence conditions and a random model for the corruption support, we study factorizations of the ground-truth rank-$r$ matrix with both factors of rank $r$. With high probability, every such factorization is a Clarke critical point. We also characterize the local geometry: when the factorization rank equals $r$, these solutions are sharp local minima; when it exceeds $r$, they are strict saddle points.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21007v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Alexa Renner"
    ],
    "title": "Gliders on the Stranded Cellular Automata Model",
    "abstract": "The Stranded Cellular Automata (SCA) model consists of a grid of cells which can each contain between zero and two strands apiece and two turning rules that control when strands turn and when they cross. While patterns on this model have been studied previously, such research has not needed an algebraic description of the model. We provide a formal algebraic definition of patterns on the model, define gliders on the model in a way which is semi-compatible with definitions of gliders in other cellular automata models, and classify all 1- and 2-stranded gliders on this model. In addition, we prove an equivalence of two classes of gliders and design an algorithm to generate all such elements of that class.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20979v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Edgar Costa",
      "Taylor Dupuy",
      "Stefano Marseglia",
      "David Roe",
      "Christelle Vincent"
    ],
    "title": "Ordinary abelian varieties: isogeny graphs and polarizations",
    "abstract": "Given an integer $D$ and an ordinary isogeny class of abelian varieties defined over a finite field $\\mathbb{F}_q$ with commutative $\\mathbb{F}_q$-endomorphism algebra, we provide algorithms for computing all isogenies of degree dividing $D$ and polarizations of degree dividing $D$. We discuss phenomena that arise for higher dimension abelian varieties but not elliptic curves, bounds on the diameter of the graph of minimal isogenies, and decompositions of isogeny graphs into orbits for the Picard group of the Frobenius order.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.20866v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Huiguang Zhang"
    ],
    "title": "Cramér-Rao Bound Analysis and Near-Optimal Performance of the Synchronous Nyquist-Folding Generalized Eigenvalue Method (SNGEM) for Sub-Nyquist Multi-Tone Parameter Estimation",
    "abstract": "The synchronous Nyquist folding generalized eigenvalue method (SNGEM) realizes full frequency/amplitude/phase estimation of multitone signals at extreme sub-Nyquist rates by jointly processing the original signals and their time derivatives. In this paper, accurate Cramer-Rao bounds for amplitude ratio parameter R=A/B=1/(2\\pif) are derived for two channels with equal SNR. Monte-Carlo simulations confirm that SNGEM achieves machine accuracy in noise-free conditions and closely approaches the derived CRB at all SNR levels, even at 10- 20x compression, whereas classical compressive sensing OMP exhibits irreducible error flattening due to DFT grid bias and aliasing noise. These results establish SNGEM as a statistically nearly optimal deterministic sub-Nyquist parameter spectrum analysis",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21213v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Gaofeng Wang",
      "Weike Wang",
      "Tianfang Wu"
    ],
    "title": "Classical solutions to the Boltzmann equations for gas mixture with unequal molecular masses",
    "abstract": "The Boltzmann equation is essential for gas thermodynamics,as it models how the molecular density distribution $F(t,x,v)$ changes over time. However, existing research primarily focuses on the single species Boltzmann equation, while investigations into gas mixtures with unequal molecular masses remain relatively limited. Notably, mixed gas studies have broader applications exemplified by Earth's atmosphere, composed of 78\\% nitrogen, 21\\% oxygen, and 1\\% trace gases, where the $N_2$ to $O_2$ molecular mass ratio is 28:32 (simplified as 7:8). This work addresses the Boltzmann equations for such mixtures with unequal molecular masses $(m^A\\neq m^B)$, establishing the global in time existence of classical solutions near Maxwellians for soft potentials ($-3<γ<0$) in a periodic spatial domain. Our analysis encompasses arbitrary molecular mass ratios. Our analysis encompasses arbitrary molecular mass ratios. The main contribution of this paper lies in the detailed characterization of the linear collision operator's structure and establishing estimates for the nonlinear terms under unequal mass conditions. Consequently, these results may help advance spectral analysis for soft potentials as well as $L^2,L^{\\infty}$ frameworks in future studies of multi-component Boltzmann equations.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21209v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Daichi Matsuzuki",
      "Honami Sakamoto",
      "Jun Ueki"
    ],
    "title": "Positive characteristic analogues of finite algebraic numbers",
    "abstract": "J.~Rosen introduced the ring $\\mathcal{P}^0_{\\mathcal{A}}$ of so-called finite algebraic numbers, which may be seen as an analogue of certain periods in the ring $\\mathcal{A}=\\prod_p \\mathbb{Z}/p\\mathbb{Z} /\\bigoplus_p \\mathbb{Z}/p\\mathbb{Z}$, $p$ running through all prime numbers. In this article, we introduce its positive characteristic analogue $\\mathcal{P}^0_{\\mathcal{A}_K}$ over the rational function field $K=\\mathbb{F}_q(θ)$, $q$ being a prime power, and study foundational properties.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21197v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Dimitar Grantcharov",
      "Khoa Nguyen",
      "Kaiming Zhao"
    ],
    "title": "A family of simple $U(\\mathfrak{h})$-free modules of rank 2 over $\\mathfrak{sl} (2)$",
    "abstract": "We study simple $\\mathfrak{sl}(2)$-modules over $\\mathbb C$ that are free of finite rank as $U(\\mathfrak h)$-modules, where $\\mathfrak h$ is a Cartan subalgebra of $\\mathfrak{sl}(2)$. Our main result is an explicit classification of the scalar-type simple modules of rank $2$. We also give a criterion for when two such modules are isomorphic. Both the classification and the isomorphism problem reduce to twisted conjugacy classes in $\\mbox{GL}_2({\\mathbb C}[h])$ and rely on Cohn's standard form.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21108v1",
    "categories": [
      "math.SP",
      "math.CA"
    ],
    "authors": [
      "Milivoje Lukic",
      "Brian Simanek"
    ],
    "title": "Upper bounds on eigenvalue spacing for decaying potentials",
    "abstract": "We study decaying half-line Schrödinger operators and the local eigenvalue spacing of their Dirichlet restrictions. While absolutely continuous spectrum is strongly associated with bulk universality and clock behavior, singular spectral measures can correspond to varied local behaviors. In this work, the rate of decay of the potential is shown to give upper bounds for the spacing of Dirichlet eigenvalues on finite intervals.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21054v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Rami Atar",
      "Leonid Mytnik",
      "Gershon Wolansky"
    ],
    "title": "Trimmed branching random walk and a free obstacle problem",
    "abstract": "Consider $N$ particles performing random walks on the $ε$-grid $(εZ)^d$, $ε>0$ with branching and density-dependent selection: When one of the particles branches, a particle is removed from the most populated site. The walks are assumed to be asymptotic, as $ε\\to0$, to diffusion processes of the form \\[ dX_i(t)=b(X_i(t))dt+\\sqrt{2}dW_i(t), \\] for $b$ a given vector field. Denoting $L^*=Δ-\\nabla\\cdot(b\\,\\cdot)$, the hydrodynamic limit, as $N\\to\\infty$ followed by $ε\\to0$, is characterized in terms of a parabolic free obstacle problem \\[ \\partial_t u=L^*u+u-β\\] where $β$ is a measure on $R^d\\times[0,\\infty)$ supported on $\\{(x,t):u(x,t)=|u(\\cdot,t)|_\\infty\\}$. Here, the unknowns are $u$, the mass density, and $β$, the removal measure, for which $t\\mapstoβ(R^d\\times[0,t])$ is prescribed. This is analogous to the well-understood relation between particle systems with spatial selection and free boundary problems, but the techniques require quite different ideas. The key ingredients of the proof include PDE uniqueness for continuous densities and a uniform-in-$ε$ estimate on modulus of continuity of prelimit densities. The work gives rise to open problems such as ``flat top'' versus ``sharp top'' solutions, which are discussed based on concrete examples.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21052v1",
    "categories": [
      "math.AG",
      "math.CT",
      "math.NT"
    ],
    "authors": [
      "Yves André"
    ],
    "title": "Non-abelian Rees construction and pure motives",
    "abstract": "The classical Rees construction (of common use in commutative algebra and Hodge theory) interpolates between filtrations, viewed as ${\\mathbb G}_m$-equivariant vector bundles on the affine line, and their associated gradings. Various non-abelian versions have been proposed, where the multiplicative group ${\\mathbb G}_m$ is replaced by an arbitrary reductive group. Building on a construction due to P. O'Sullivan, we present a Galois correspondence between quasi-homogeneous spaces and certain monoidal categories, and apply it to monoidal categories of motives with concrete applications to algebraic cycles. In particular, we give a new proof and generalization of the Clozel-Deligne theorem about numerical equivalence on abelian varieties over finite fields.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21019v1",
    "categories": [
      "math.ST",
      "cs.LG",
      "math.NA"
    ],
    "authors": [
      "Markus Holzleitner",
      "Sergiy Pereverzyev",
      "Sergei V. Pereverzyev",
      "Vaibhav Silmana",
      "S. Sivananthan"
    ],
    "title": "Towards regularized learning from functional data with covariate shift",
    "abstract": "This paper investigates a general regularization framework for unsupervised domain adaptation in vector-valued regression under the covariate shift assumption, utilizing vector-valued reproducing kernel Hilbert spaces (vRKHS). Covariate shift occurs when the input distributions of the training and test data differ, introducing significant challenges for reliable learning. By restricting the hypothesis space, we develop a practical operator learning algorithm capable of handling functional outputs. We establish optimal convergence rates for the proposed framework under a general source condition, providing a theoretical foundation for regularized learning in this setting. We also propose an aggregation-based approach that forms a linear combination of estimators corresponding to different regularization parameters and different kernels. The proposed approach addresses the challenge of selecting appropriate tuning parameters, which is crucial for constructing a good estimator, and we provide a theoretical justification for its effectiveness. Furthermore, we illustrate the proposed method on a real-world face image dataset, demonstrating robustness and effectiveness in mitigating distributional discrepancies under covariate shift.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21497v1",
    "categories": [
      "math.FA",
      "math.AP",
      "math.CA"
    ],
    "authors": [
      "Gustavo Dorrego"
    ],
    "title": "Weighted Sobolev Spaces and Distributional Spectral Theory for Generalized Aging Operators via Transmutation Methods",
    "abstract": "The spectral analysis of operators in heterogeneous and aging media typically requires a functional framework that extends beyond the standard Hilbertian setting. In this paper, we establish a rigorous distributional theory for a class of non-local operators, termed Weighted Weyl-Sonine operators, by employing a structure-preserving transmutation method. We construct the Weighted Schwartz Space $\\mathcal{S}_{ψ,ω}$ and its topological dual, the space of Weighted Tempered Distributions $\\mathcal{S}'_{ψ,ω}$, ensuring that the underlying Fréchet topology is consistent with the infinitesimal generator of the aging dynamics. This topological foundation allows us to: (i) extend the Weighted Fourier Transform to generalized functions as a unitary isomorphism; (ii) provide an explicit spectral characterization of the weighted Dirac delta $δ_{ψ,ω}$ and its scaling laws under geometric dilations; and (iii) introduce a scale of Weighted Sobolev Spaces $H^{s}_{ψ,ω}$ defined via spectral multipliers. A central result is the derivation of a sharp embedding theorem, $|u(t)| \\le C ω(t)^{-1} \\|u\\|_{H^s_{ψ,ω}}$, which rigorously connects abstract spectral energy to the pointwise decay induced by the weight $ω$. This framework provides a unified geometric characterization of several fractional regimes, including the Hadamard and Riemann-Liouville cases, within a single operator-theoretic architecture.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21456v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Saptarshi Dandapat"
    ],
    "title": "Classification of low degree del Pezzo orbifolds",
    "abstract": "In this paper we classify low degree del Pezzo orbifolds with irreducible boundaries. In order to achieve desired boundaries, we classify low degree curves on low degree del Pezzo surfaces. The notion of Campana orbifolds was introduced by Campana in 2004. A del Pezzo orbifold is a Campana orbifold whose underlying surface is a del Pezzo surface. The classification is elementary applications of adjunction formula, Riemann-Roch theorem, Hodge Index theorem and Kawamata-Viehweg vanishing theorem.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21445v1",
    "categories": [
      "math.CO",
      "math.NT"
    ],
    "authors": [
      "Oleg Karpenkov",
      "Ian Short",
      "Matty van Son",
      "Andrei Zabolotskii"
    ],
    "title": "Classifying integer hypertilings",
    "abstract": "There are two objectives to this work: to classify all tame integer tilings and to classify all tame integer hypertilings. Motivation for the first objective comes from Conway and Coxeter's modelling of positive integer friezes using triangulated polygons, which has received significant attention since the discovery of cluster algebras by Fomin and Zelevinsky in 2002. Assem, Reutenauer, and Smith introduced $\\text{SL}_2$-tilings as generalisations of friezes, and Bessenrodt, Holm, and Jørgensen classified positive integer $\\text{SL}_2$-tilings using infinite triangulated polygons. Here we consider $N$-tilings, of which $\\text{SL}_2$-tilings are the case $N=1$. We provide a geometric model for all tame integer $N$-tilings using a generalisation of the Farey graph in the hyperbolic plane. Highlights of this model include classifications of all positive integer $N$-tilings and of all quiddity sequences of positive rational friezes using triangulated polygons.\n  The second objective is motivated by Bhargava's celebrated study of binary quadratic forms using integer cubes and by an observation of Demonet et al.\\ that there is essentially only one three-dimensional positive integer tiling with $\\text{SL}_2$ cross sections. We consider a richer class of three-dimensional tilings, which we call hypertilings, using the Cayley hyperdeterminant. We classify all tame integer hypertilings using generalised Farey graphs; remarkably, those with Cayley hyperdeterminant 1 prove to have a simple description in terms of triple Hadamard products of integer pairs.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21304v1",
    "categories": [
      "math.AG",
      "math.CO",
      "math.PR"
    ],
    "authors": [
      "Haoming Wang"
    ],
    "title": "Real gamma distribution on analytic bundles of flag varieties",
    "abstract": "This paper introduces four matrix normal distributions extending the separable covariance $ \\varPhi \\otimes \\varPsi$ with potentially variable-level ($ \\varPsi$) and/or sample-level ($ \\varPhi$) correlations. The joint distribution of sample variances and covariances, leading to the product-moment distribution, is considered when precision matrices admit a specific tensor form. Several well-known results, including the non-central Wishart distribution and normal quadratic forms, now appear as corollaries. Moreover, we propose a conjecture concerning the analytic continuation of the real gamma distribution. By applying these results to the flag varieties, we classify the double flag and the single flag.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21302v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Surya Giri"
    ],
    "title": "Zalcman Conjecture for Starlike Mappings in Higher Dimensions",
    "abstract": "Counterexamples show that many results in the geometric function theory of one complex variable are not applicable for several complex variables. In this paper, we obtain sharp bounds for the Zalcman functional for $n=3$ associated with the starlike mappings defined on the unit ball in a complex Banach space and on the unit polydisk in $\\mathbb{C}^n$. These results confirm the validity of the Zalcman conjecture in higher dimensions for $n=3$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21640v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Naeem Desai",
      "Oliver Graham",
      "William R. B. Lionheart"
    ],
    "title": "Multistatic anisotropic travel-time as a tensor tomography problem",
    "abstract": "Travel-time imaging problems seek to reconstruct an image of reflectivity of a scene by measuring travel time (and amplitude, phase) of electromagnetic or acoustic signals, such as radar and sonar. Multistatic, in this context, means that the transmitters and receivers need not be co-located. The reflectivity is anisotropic if it depends on direction, and in the multistatic case this means incoming and outgoing direction. Travel-time problems can be formulated as generalized Radon transforms of integrals over isochrones, in the planar case ellipses with transmitter and receivers at foci. In a simplified case where transmitters and receivers are distant from the scene, isochrones can be approximated by straight lines. We relate this to tensor ray transforms, specifically the longitudinal ray transform of Sharafutdinov, and discuss the implication of its known null-space. In the volumetric case isochrones are spheroids and we relate the problem to the normal Radon transform of tensor fields.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21575v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Kirti Sahu",
      "Ranjit Mehatari"
    ],
    "title": "On minimal graphs for hamiltonian groups and their fixing set",
    "abstract": "A finite non-abelian group $H$ is hamiltonian if all of its subgroups are normal. We compute the minimal orders of graphs having a hamiltonian group as their automorphism group. The fixing number of a graph $Γ$ is the minimum cardinality of a subset $S$ of $V(Γ)$ such that the stabilizer of $S$ is trivial. For a given finite group $G$, the fixing set is defined as the set comprising all possible fixing numbers of graphs having group $G$ as their automorphism groups. We determine the fixing sets corresponding to finite hamiltonian groups.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21559v1",
    "categories": [
      "math.AG",
      "math.CT",
      "math.RT"
    ],
    "authors": [
      "Alberto Canonaco",
      "Mattia Ornaghi"
    ],
    "title": "New examples of non-Fourier-Mukai exact functors via non-isomorphic octahedra",
    "abstract": "We study a triangulated category $\\mathscr S$ that admits a full and strong exceptional sequence of three objects with one-dimensional Hom spaces. We show that the isomorphism classes of exact functors from $\\mathscr S$ to another triangulated category $\\mathscr T$ are in bijection with the isomorphism classes of octahedra in $\\mathscr T$ satisfying a natural condition. As an application, we construct an exact functor from $\\mathscr S$ to $\\mathbf D^b(\\Bbbk[x]\\text{-}\\mathrm{mod})$ that does not admit a dg lift. This provides an explicit example of a non-Fourier-Mukai exact functor between $\\mathbf D^b(\\mathbb P^2)$ and $\\mathbf D^b(\\mathbb P^1)$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21659v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Alexander S. Bratus",
      "Olga S. Rozanova"
    ],
    "title": "The Kolmogorov forward equation for a distributed model of regime-switching diffusions",
    "abstract": "For the regime-switching diffusion process with and without advection term we propose an integro-differential equation describing the densities of states continuously distributed over a segment. We demonstrate that there exists a constructive algorithm for solving the Cauchy problem. We then show that for some initial distributions of states, the solution can be found explicitly. We also discuss how a model with a discrete number of hidden states can be approximated by a model with continuously distributed states.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21635v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Giovanni Taraschi",
      "Maicon Ribeiro Correa"
    ],
    "title": "Numerical analysis of a locking-free primal hybrid method for linear elasticity with $H(\\mathrm{div})$-conforming stress recovery",
    "abstract": "In this work, we study a primal hybrid finite element method for the approximation of linear elasticity problems, posed in terms of displacement, an auxiliary pressure field, and a Lagrange multiplier related to the traction. We develop a general analysis for the existence and uniqueness of the solution for the discrete problem, which is applied to the construction of stable approximation spaces on triangular and quadrilateral meshes. The use of these spaces lead to optimal convergence orders, resulting in a locking-free method capable of providing robust approximations for nearly incompressible problems. Finally, we propose a strategy for recovering the stress field from the hybrid solution by solving element-wise sub-problems. The resulting stress approximation is $H(\\mathrm{div})$-conforming, locally equilibrated, weakly symmetric, and robust to locking.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21596v1",
    "categories": [
      "math.DG",
      "math.MG"
    ],
    "authors": [
      "Felix Rott",
      "Zhe-Feng Xu",
      "Matteo Zanardini"
    ],
    "title": "Lorentz meets Ptolemy",
    "abstract": "We consider a Lorentzian analogue of the Ptolemy inequality and we prove that in the setting of globally hyperbolic spacetimes it is equivalent to a global timelike sectional curvature bound from above by zero. We investigate the link between the Ptolemy inequality and the hyperbolic inversion and establish some applications and rigidity properties.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21594v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Asadollah Aghajani",
      "Juha Kinnunen"
    ],
    "title": "New inequalities related to sums of $L^p$ functions in connection with Carbery's problems",
    "abstract": "Carbery (2006) proposed novel estimates for the $L^p$ norm of a sum of two nonnegative measurable functions. Subsequently, Carlen, Frank, Ivanisvili and Lieb (2018) provided stronger bounds, which Ivanisvili and Mooney (2020) further refined to achieve estimates that are, in a certain sense, optimal. Continuing this line of research, the present work establishes new upper and lower bounds for the range \\(p\\in(1,\\infty)\\). Carbery also asked under what conditions on a sequence \\((f_j)\\) of nonnegative measurable functions the inequality \\(\\sum \\|f_j\\|_p^p < \\infty\\) implies that \\(\\sum f_j \\in L^p\\). Ivanisvili and Mooney (2020) resolved this question for \\(p\\in[1,2]\\), and the present work proposes an answer for \\(p\\in[2,\\infty)\\).",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21578v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Hexuan Liu",
      "Bing-Ze Lu",
      "Taoyang Wu",
      "Guan-Ru Yu"
    ],
    "title": "Asymptotic Enumeration of Subclasses of Level-$2$ Phylogenetic Networks",
    "abstract": "This paper studies the enumeration of seven subclasses of level-$2$ phylogenetic networks under various planarity and structural constraints, including terminal planar, tree-child, and galled networks. We derive their exponential generating functions, recurrence relations, and asymptotic formulas. Specifically, we show that the number of networks of size $n$ in each class follows: \\[ N_n \\sim c \\cdot n^{n-1} \\cdot γ^n, \\] where $c$ is a class-specific constant and $γ$ is the corresponding growth rate. Our results reveal that being terminal planar can significantly reduce the growth rate of general level-2 networks, but has only a minor effect on the growth rates of tree-child and galled level-2 networks. Notably, the growth rate of 3.83 for level-$2$ terminal planar galled tree-child networks is remarkably close to the rate of 2.94 for level-$1$ networks.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21519v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Barinder S. Banwait",
      "Jerson Caro",
      "Shiva Chidambaram"
    ],
    "title": "On the Visibility category of the Shafarevich--Tate group",
    "abstract": "Given an elliptic curve over $\\mathbb{Q}$ and a nontrivial element $σ$ of its Shafarevich--Tate group, we introduce the Visualization category $\\mathcal{V}(E; σ)$ of abelian varieties that ``visualize'' $σ$ in the sense of Mazur, and we study minimal objects in this category. In particular, we show that there can be several minimal visualizing abelian varieties of different dimensions, answering a question of Mazur. In the case that $σ$ has order $2$ or $3$, we revisit two constructions of visualizing abelian varieties, due to Agashe and Stein, and Cremona and Mazur. We show that the Agashe--Stein construction always yields minimal visualizations for these orders. We also build upon the Cremona--Mazur construction and show how it can be made totally explicit. While the Cremona--Mazur construction can produce non-minimal objects, an appropriate choice in the construction for order $2$ elements $σ$ yields an explicit genus $2$ curve whose Jacobian is a minimal visualization. For order $3$ elements we apply our algorithmic construction to Fisher's database of such elements, and obtain computational evidence that, in the majority of cases, the Cremona--Mazur construction yields a minimal visualization.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21514v1",
    "categories": [
      "cs.IT",
      "quant-ph"
    ],
    "authors": [
      "Eduardo Camps-Moreno",
      "Hiram H. López",
      "Gretchen L. Matthews",
      "Narayanan Rengaswamy",
      "Rodrigo San-José"
    ],
    "title": "Transversal gates for quantum CSS codes",
    "abstract": "In this paper, we focus on the problem of computing the set of diagonal transversal gates fixing a CSS code. We determine the logical actions of the gates as well as the groups of transversal gates that induce non-trivial logical gates and logical identities. We explicitly declare the set of equations defining the groups, a key advantage and differentiator of our approach. We compute the complete set of transversal stabilizers and transversal gates for any CSS code arising from monomial codes, a family that includes decreasing monomial codes and polar codes. As a consequence, we recover and extend some results in the literature on CSS-T codes, triorthogonal codes, and divisible codes.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21245v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yeping Li",
      "Gaofeng Wang",
      "Tianfang Wu"
    ],
    "title": "Hydrodynamic limit of the Vlasov-Poisson-Boltzmann system for gas mixture",
    "abstract": "In this paper, we study the hydrodynamic limit of the Vlasov-Poisson-Boltzmann system for a gas mixture in the whole space $(x \\in \\mathbb{R}^3)$ with the potential range of $γ\\in\\left(-3, 1\\right]$. Using the method of Hilbert expansion, we first derive a bi-Maxwellian determined by the Euler-Poisson system of two fluids. To justify the convergence of the solution rigorously as the Knudsen number tends to zero, we sequentially calculate the first $2k-1$ terms of the expansion series $(k \\geq 6)$, and then truncate it, and express the solution as the sum of these first $2k-1$ terms and a remainder term. Within the framework of the $L_{x,v}^2-W_{x,v}^{1,\\infty}$ interplay established by Guo and Jang \\cite{[ininp]Guo2010CMP}, we construct a new weight function to estimate the remainder term in four different cases regarding the potential $γ$. Here, the particle masses $m^A, m^B > 0$ and their charges $e^A, e^B$ can be given arbitrarily. This causes the collision operator to exhibit asymmetric effects ($m^A \\neq m^B$), rendering the system of equations impossible to decouple. So, it adds difficulties to both $L^2$, $L^{\\infty}$ estimates for the remainder. Therefore, we adopt the framework of vector-valued functions and analyze the velocity decay rate of the operator $K_{M,2,w}^{α,c}$ to eliminate the singularity induced by small parameters in characteristic line iterations. Our results show that the validity time of the solution is $O(\\varepsilon^{-y})$, where $y$ is $-\\frac{2k-3}{2(2k-1)}$ when $-1 \\leq γ\\leq 1$, and it becomes $-\\frac{2k-3}{(1-γ)(2k-1)}$, when $-3 < γ< -1$. These results possess strong physical realism and can be applied to analyze gas flow dynamics in the daytime ionosphere at high altitudes above the Earth.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21201v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Peter Cameron",
      "Maciej Dunajski",
      "Paul Tod"
    ],
    "title": "Conformal Geodesics Cannot Spiral -- Erratum",
    "abstract": "Wojciech Kamiński has provided a non real--analytic counterexample to our claim in [1] that conformal geodesics cannot spiral. This erratum illustrates how the proof of Lemma 4.6 [1] (on which our claim was based) fails.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21133v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Tom Ilmanen"
    ],
    "title": "Singularities of Mean Curvature Flow of Surfaces",
    "abstract": "This paper proves that, at the first singular time for a smoothly immersed surface moving by mean curvature flow in a n-manifold, each tangent flow is given by a smooth, branched shrinker, possibly with multiplicity. If n=3 and if the initial surface is embedded, then the shrinker is smoothly embedded without branch points, but possibly with multiplicity. A key ingredient of the proof is a new, local version of the Gauss-Bonnet formula.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21121v1",
    "categories": [
      "math.CO",
      "cs.IT"
    ],
    "authors": [
      "Koji Imamura",
      "Norihiro Nakashima",
      "Takuya Saito"
    ],
    "title": "Periodicity of weight enumerators for codes generated by an integral matrix",
    "abstract": "In the theory of error-correcting codes, the minimum weight and the weight enumerator play a crucial role in evaluating the error-correcting capacity. In this paper, by viewing the weight enumerator as a quasi-polynomial, we reduce the calculation of the minimum weight to that of a code over a smaller integer residue ring. We also give a transformation formula between the Tutte quasi-polynomial and the weight enumerator. Furthermore, we compute the number of maximum weight codewords for the codes related to the matroids $N_k$ and $Z_k$. This is equivalent to computing the characteristic quasi-polynomial of the hyperplane arrangements related to $N_k$ and $Z_k$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21079v1",
    "categories": [
      "math.PR",
      "q-bio.PE"
    ],
    "authors": [
      "Maximillian Newman"
    ],
    "title": "The quenched structured coalescent for diploid population models on finite graphs with large migrations and uneven offspring distributions",
    "abstract": "In this work we describe a new model for the evolution of a diploid structured population backwards in time that allows for large migrations and uneven offspring distributions. The model generalizes both the mean-field model of Birkner et al. [\\textit{Electron. J. Probab.} 23: 1-44 (2018)] and the haploid structured model of Möhle [\\textit{Theor. Popul. Biol.} 2024 Apr:156:103-116]. We show convergence, with mild conditions on the joint distribution of offspring frequencies and migrations, of gene genealogies conditional on the pedigree to a time-inhomogeneous coalescent process driven by a Poisson point process $Ψ$ that records the timing and scale of large migrations and uneven offspring distributions. This quenched scaling limit demonstrates a significant difference in the predictions of the classical annealed theory of structured coalescent processes. In particular, the annealed and quenched scaling limits coincide if and only if these large migrations and uneven offspring distributions are absent. The proof proceeds by the method of moments and utilizes coupling techniques from the theory of random walks in random environments. Several examples are given and their quenched scaling limits established.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21038v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Barbara Kaltenbacher"
    ],
    "title": "Decay rates to equilibrium in a nonlinear subdiffusion equation with two counteracting terms",
    "abstract": "In this paper we prove convergence to a steady state as $t\\to\\infty$ for solutions to the subdiffusion equation \\[ \\partial_t^αu - \\mathbb{L} u = q(x)u - p(x)f(u) + r \\] with the exponential ($α=1$) or power law ($α\\in[0,1)$) rates under mild conditions on the coefficients $p$, $q$, the nonlinearity $f$, the source $r$, and the elliptic operator $\\mathbb{L}$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21496v1",
    "categories": [
      "math.RT",
      "math.CO",
      "math.RA"
    ],
    "authors": [
      "Zhichao Chen"
    ],
    "title": "Log-concavity and unimodality of cluster monomials of type $A_3$",
    "abstract": "The log-concavity of cluster variables of type $A_n$ and cluster monomials of type $A_2$ was established by Chen-Huang-Sun. It is still a conjecture for the cluster monomials of higher rank. In this paper, we prove the log-concavity and unimodality of the cluster monomials of type $A_3$, a substantially more intricate case. Moreover, we refine and extend this conjecture by considering the unimodality and the strongly isomorphism of cluster algebras.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21487v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Kaiwei Yang",
      "Lexiao Lai"
    ],
    "title": "Manifold constrained steepest descent",
    "abstract": "Norm-constrained linear minimization oracle (LMO)-based optimizers such as spectral gradient descent and Muon are attractive in large-scale learning, but extending them to manifold-constrained problems is nontrivial and often leads to nested-loop schemes that solve tangent-space subproblems iteratively. We propose \\emph{Manifold Constrained Steepest Descent} (MCSD), a single-loop framework for optimization over manifolds that selects a norm-induced steepest-descent direction via an LMO applied to the Riemannian gradient, and then returns to the manifold via projection. Under standard smoothness assumptions, we establish convergence guarantees for MCSD and a stochastic momentum variant. We further introduce \\emph{SPEL}, the spectral-norm specialization of MCSD on the Stiefel manifold, which admits scalable implementations via fast matrix sign computations. Experiments on PCA, orthogonality-constrained CNNs, and manifold-constrained LLM adapter tuning demonstrate improved stability and competitive performance relative to standard Riemannian baselines and existing manifold-aware LMO methods.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21482v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Nho-Duc Tran",
      "Aamir Mahmood",
      "Mikael Gidlund"
    ],
    "title": "Learning-Based Sensor Scheduling for Delay-Aware and Stable Remote State Estimation",
    "abstract": "Unpredictable sensor-to-estimator delays fundamentally distort what matters for wireless remote state estimation: not just freshness, but how delay interacts with sensor informativeness and energy efficiency. In this paper, we present a unified, delay-aware framework that models this coupling explicitly and quantifies a delay-dependent information gain, motivating an information-per-joule scheduling objective beyond age of information proxies (AoI). To this end, we first introduce an efficient posterior-fusion update that incorporates delayed measurements without state augmentation, providing a consistent approximation to optimal delayed Kalman updates, and then derive tractable stability conditions ensuring that bounded estimation error is achievable under stochastic, delayed scheduling. This conditions highlight the need for unstable modes to be observable across sensors. Building on this foundation, we cast scheduling as a Markov decision process and develop a proximal policy optimization (PPO) scheduler that learns directly from interaction, requires no prior delay model, and explicitly trades off estimation accuracy, freshness, sensor heterogeneity, and transmission energy through normalized rewards. In simulations with heterogeneous sensors, realistic link-energy models, and random delays, the proposed method learns stably and consistently achieves lower estimation error at comparable energy than random scheduling and strong RL baselines (DQN, A2C), while remaining robust to variations in measurement availability and process/measurement noise.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21428v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Yoshihito Kazashi",
      "Fabio Nobile",
      "Fabio Zoccolan"
    ],
    "title": "Numerical Methods for Dynamical Low-Rank Approximations of Stochastic Differential Equations -- Part I: Time discretization",
    "abstract": "In this work (Part I), we study three time-discretization procedures of the Dynamical Low-Rank Approximation (DLRA) of high-dimensional stochastic differential equations (SDEs). Specifically, we consider the Dynamically Orthogonal (DO) method for DLRA proposed and analyzed in arXiv:2308.11581v4, which consists of a linear combination of products between deterministic orthonormal modes and stochastic modes, both time-dependent. The first strategy we consider for numerical time-integration is very standard, consisting in a forward discretization in time of both deterministic and stochastic components. Its convergence is proven subject to a time-step restriction dependent on the smallest singular value of the Gram matrix associated to the stochastic modes. Under the same condition on the time-step, this smallest singular value is shown to be always positive, provided that the SDE under study is driven by a non-degenerate noise. The second and the third algorithms, on the other hand, are staggered ones, in which we alternately update the deterministic and the stochastic modes in half steps. These approaches are shown to be more stable than the first one and allow us to obtain convergence results without the aforementioned restriction on the time-step. Computational experiments support theoretical results. In this work we do not consider the discretization in probability, which will be the topic of Part II.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21290v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Surya Giri"
    ],
    "title": "Second-Order Toeplitz Determinant for Quasi-Convex Mappings",
    "abstract": "This paper presents sharp estimates for the second-order Toeplitz determinant whose entries are the coefficients of convex functions defined on the unit disk in $\\mathbb{C}$. These estimates are further extended to a subclass of holomorphic mappings defined on the unit ball in a complex Banach space and on the unit polydisk in $\\mathbb{C}^n$, which, as special cases, yield bounds for the classes of quasi-convex mappings of type $B$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21267v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Yeong-Wook Kwon",
      "Youngmin Lee"
    ],
    "title": "On the structure of prime-detecting quasimodular forms in higher levels",
    "abstract": "Craig, van Ittersum, and Ono conjectured that every prime-detecting quasimodular form of level $1$ is a quasimodular Eisenstein series. This conjecture was proved by Kane--Krishnamoorthy--Lau and by van Ittersum--Mauth--Ono--Singh independently. However, in higher levels, prime-detecting quasimodular forms need not be Eisenstein. Recently, Kane, Krishnamoorthy, and Lau formulated a natural higher level analogue of the above conjecture and proved it by analytic methods. In a similar direction, but via an alternative approach based on the independence of characters of $\\ell$-adic Galois representations, we prove that any prime-detecting quasimodular form on $Γ_{0}(N)$ belongs to the direct sum of the spaces of quasimodular Eisenstein series and quasimodular oldforms. Moreover, for a quasimodular form $f$ that is not prime-detecting, we give an upper bound for the number of primes $p$ less than $X$ for which the $p$-th Fourier coefficient of a quasimodular form vanishes.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21223v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Henry H. Kim",
      "Yi Shan"
    ],
    "title": "Rationality of quaternionic Eisenstein series on $\\mathrm{U}(2,n)$",
    "abstract": "Let $\\mathbf{G}=\\mathrm{U}(2,n)$ be the unitary group associated to a Hermitian space over a quadratic imaginary number field $E$. We assume that 2 is unramified in $E$, and the Hermitian space splits at all finite places and has signature $(2,n)$, where $n\\equiv 2 \\operatorname{mod} 4$. A theory of Fourier expansions of quaternionic modular forms on $\\mathbf{G}$ is developed by Hilado, McGlade, and Yan. In this paper, we define a family of degenerate Heisenberg Eisenstein series $E_{\\ell}$ for $\\ell>n$ on $\\mathbf{G}$, which is a weight $\\ell$ quaternionic modular form, and we explicitly compute their Fourier expansions. We prove that the Fourier coefficients of $E_{\\ell}$ are rational in a certain sense, and that their denominators are uniformly bounded by an integer depending only on $\\ell,n$, and $E$. This provides the first family of quaternionic Eisenstein series whose Fourier coefficients are known to be rational or algebraic.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21166v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Taha El Bakkali",
      "Rayane Bouftini",
      "Qiuyi Zhang",
      "Omar Saadi"
    ],
    "title": "Noisy Pairwise-Comparison Random Search for Smooth Nonconvex Optimization",
    "abstract": "We consider minimizing high-dimensional smooth nonconvex objectives using only noisy pairwise comparisons. Unlike classical zeroth-order methods limited by the ambient dimension $d$, we propose Noisy-Comparison Random Search (NCRS), a direct-search method that exploits random line search to adapt to the intrinsic dimension $k \\le d$. We establish novel non-convex convergence guarantees for approximate stationarity: under a uniform-margin oracle, NCRS attains $ε$-stationarity with complexity $\\mathcal{O}(k/(p^{2}ε^{2}))$, explicitly replacing ambient dependence with the intrinsic dimension. Furthermore, we introduce a general tie-aware noise model where comparison quality degrades near ties; for this setting, we prove that a majority-vote variant of NCRS achieves $ε$-stationarity with complexity $\\mathcal{O}(k^{2}/ε^{4})$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21137v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Márcio Lemes de Sousa",
      "Tibério Bittencourt de Oliveira Martins",
      "Carlos Rodrigues da Silva"
    ],
    "title": "Einstein Warped Products with Einstein Base and Fiber",
    "abstract": "We study Einstein riemannian manifolds endowed with a warped product structure. We focus on the case in which both the base and the fiber are Einstein manifolds and establish necessary and sufficient conditions for the warped product itself to be an Einstein manifold. Moreover, we explicitly determine the warping function when the base is the hyperbolic space.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21131v1",
    "categories": [
      "math.ST",
      "cs.IT",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Qiyang Han"
    ],
    "title": "Thompson sampling: Precise arm-pull dynamics and adaptive inference",
    "abstract": "Adaptive sampling schemes are well known to create complex dependence that may invalidate conventional inference methods. A recent line of work shows that this need not be the case for UCB-type algorithms in multi-armed bandits. A central emerging theme is a `stability' property with asymptotically deterministic arm-pull counts in these algorithms, making inference as easy as in the i.i.d. setting.\n  In this paper, we study the precise arm-pull dynamics in another canonical class of Thompson-sampling type algorithms. We show that the phenomenology is qualitatively different: the arm-pull count is asymptotically deterministic if and only if the arm is suboptimal or is the unique optimal arm; otherwise it converges in distribution to the unique invariant law of an SDE. This dichotomy uncovers a unifying principle behind many existing (in)stability results: an arm is stable if and only if its interaction with statistical noise is asymptotically negligible.\n  As an application, we show that normalized arm means obey the same dichotomy, with Gaussian limits for stable arms and a semi-universal, non-Gaussian limit for unstable arms. This not only enables the construction of confidence intervals for the unknown mean rewards despite non-normality, but also reveals the potential of developing tractable inference procedures beyond the stable regime.\n  The proofs rely on two new approaches. For suboptimal arms, we develop an `inverse process' approach that characterizes the inverse of the arm-pull count process via a Stieltjes integral. For optimal arms, we adopt a reparametrization of the arm-pull and noise processes that reduces the singularity in the natural SDE to proving the uniqueness of the invariant law of another SDE. We prove the latter by a set of analytic tools, including the parabolic Hörmander condition and the Stroock-Varadhan support theorem.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21127v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "James Propp"
    ],
    "title": "Intersection statistics for antichains in minuscule posets",
    "abstract": "For a finite poset $P$, we study the expected size of the intersection of two independent uniformly random antichains. Equivalently, we evaluate the sum of $|A\\cap A'|$ over all ordered pairs of antichains. For general posets this statistic appears to have little structure, but for the classical minuscule posets with uniform combinatorial models it admits closed-form expressions. Though the proofs are elementary and combinatorial, the resulting formulas admit a natural interpretation in terms of weight diagrams of minuscule representations.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21071v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Finn McGlade"
    ],
    "title": "On the Vanishing and Cuspidality of $D_4$ Modular Forms",
    "abstract": "We develop vanishing and cuspidality criteria for quaternionic modular forms on $G=\\mathrm{Spin}(4,4)$ using a theory of scalar Fourier coefficients. By analyzing a Fourier-Jacobi expansion for these forms, we prove that a level one quaternionic modular form on $G$ vanishes if and only if its primitive Fourier coefficients are zero. Using this criterion, we characterize Pollack's quaternionic Saito-Kurokawa subspace by imposing a system of linear relation among certain primitive Fourier coefficients. This characterization strengthens earlier work of the author with Johnson-Leung, Negrini, Pollack, and Roy. We also study quaternionic modular forms in the more general setting of a group $G_J$ associated to a cubic norm structure $J$. Here we establish a new relationship between the degenerate Fourier coefficients of quaternionic modular forms, and the Fourier coefficients of the holomorphic modular forms associated to their constant terms. As a consequence, we prove that in weights $\\ell\\geq 5$, a level one quaternionic modular form on $G$ is cuspidal if and only if its non-degenerate Fourier coefficients satisfy a polynomial growth condition.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21023v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Fei Cao",
      "Roberto Cortez"
    ],
    "title": "The fractal geometry of opinion formation",
    "abstract": "In this manuscript, we introduce and study a variant of the agent-based opinion dynamics proposed in a recent work [8], within the framework of an interacting multi-agent system, where agents are assumed to interact with each other and update their opinions after each pairwise encounter. Specifically, our opinion model involves a large crowd of $N$ indistinguishable agents, each characterized by an opinion value ranging within the interval $[-1,1]$. At each update time, two agents are picked uniformly at random and the opinion of one agent will either shift by a proportion $μ_+ \\in (0,1]$ towards $+1$, or by a proportion $μ_- \\in (0,1]$ towards $-1$, with probabilities depending on the other agent's opinion. We rigorously derive the mean-field limit PDE that governs the large-population limit of the agent-based model and present several quantitative results demonstrating convergence to the unique equilibrium distribution. Remarkably, for a suitable choice of model parameters, the long-term equilibrium opinion profile displays a striking self-similar structure that generalizes the celebrated Bernoulli convolution, a topic extensively studied in the context of fractal geometry [23,44]. These findings also enhance our understanding of the opinion fragmentation phenomenon and may provide valuable insights for the development of more sophisticated models in future research.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21017v1",
    "categories": [
      "math.AP",
      "math.DG"
    ],
    "authors": [
      "Yannick Sire",
      "Juncheng Wei",
      "Youquan Zheng",
      "Yifu Zhou"
    ],
    "title": "Global oscillatory solutions for the Yang-Mills heat flow",
    "abstract": "We investigate the long-time dynamics for the global solution of the $SO(4)$-equivariant Yang-Mills heat flow (YMHF) with structure group $SU(2)$ in space dimension $4$. For a class of initial data with specific decay at spatial infinity, we prove that the long-time dynamics of YMHF can be described by the initial data in a unified manner. As a consequence, the global solutions can exhibit blow-up, blow-down, and more exotically, {\\it oscillatory} asymptotic behavior at time infinity. This seems to be the first example of Yang-Mills heat flows with oscillatory behavior as $t\\to \\infty$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21489v1",
    "categories": [
      "math.PR",
      "cs.IT"
    ],
    "authors": [
      "Ali Khalesi",
      "Rawad Bitar"
    ],
    "title": "Fundamental Limits of Decentralized Self-Regulating Random Walks",
    "abstract": "Self-regulating random walks (SRRWs) are decentralized token-passing processes on a graph allowing nodes to locally \\emph{fork}, \\emph{terminate}, or \\emph{pass} tokens based only on a return-time \\emph{age} statistic. We study SRRWs on a finite connected graph under a lazy reversible walk, with exogenous \\emph{trap} deletions summarized by the absorption pressure $Λ_{\\mathrm{del}}=\\sum_{u\\in\\mathcal P_{\\mathrm{trap}}}ζ(u)π(u)$ and a global per-visit fork cap $q$. Using exponential envelopes for return-time tails, we build graph-dependent Laplace envelopes that universally bound the stationary fork intensity of any age-based policy, leading to an effective triggering age $A_{\\mathrm{eff}}$. A mixing-based block drift analysis then yields controller-agnostic stability limits: any policy that avoids extinction and explosion must satisfy a \\emph{viability} inequality (births can overcome $Λ_{\\mathrm{del}}$ at low population) and a \\emph{safety} inequality (trap deletions plus deliberate terminations dominate births at high population). Under corridor-wise versions of these conditions, we obtain positive recurrence of the population to a finite corridor.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21486v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Samir Hamad"
    ],
    "title": "The Daugavet property for Sobolev spaces over the plane",
    "abstract": "We show that $W^{1,1}(\\mathbb{R}^2)$ has the Daugavet property when endowed with the norm induced by the $L^1$-norm of the gradient, but fails to have the slice diameter two property when equipped with the usual Sobolev norm.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21441v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Yuxin Ge",
      "Sun-Yung Alice Chang"
    ],
    "title": "A Rigidity theorem on conformally compact Einstein manifolds in high dimensions",
    "abstract": "In this paper, we establish a Liouville type rigidity result for a class of asymptotically hyperbolic non-compact Einstein metrics defined on manifolds of dimension $d\\ge 5$ extending the earlier result in dimension $d=4$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21434v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Leonid Gorbunov"
    ],
    "title": "A version of Marstrand's theorem on a discrete metric space",
    "abstract": "We present and prove the version of Marstrand's theorem for discrete metric space. We provide explicit estimates of the quotient of upper and lower densities of measures on this space.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21422v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Pu Yuan",
      "Paul A. Zegeling"
    ],
    "title": "Wellposedness and dynamics of two types of reaction--nonlocal diffusion systems under the inhomogeneous spectral fractional Laplacian",
    "abstract": "Reactio-nonlocal diffusion equations model nonlocal transport and anomalous diffusion by replacing the Laplacian with a fractional power, capturing diffusion mechanisms beyond Brownian motion. We primarily study the semilinear problem \\[ \\partial_t u + ε^2(-Δ)_g^αu = \\mathcal{N}(u) \\] allowing constant inhomogeneous Dirichlet boundary condition $u|_{\\partialΩ}=g$. To handle the boundary constraint, we use a harmonic lifting to reformulate the problem as an equivalent homogeneous system with a shifted nonlinearity. Working in \\(C_0(Ω)\\), analytic contraction semigroup theory yields the Duhamel formula and quantitative smoothing, implying local wellposedness for locally Lipschitz reactions and a blow-up alternative. The semigroup viewpoint also provides $L^\\infty$-contractivity and positivity preservation, which drive pointwise maximum principles and stability bounds. Furthermore, we analyze two prototypes. For the bistable RNDE, we derive an energy dissipation identity and, using a fractional weak maximum principle, obtain an invariant-range property that confines solutions between the two stable steady states. For the nonlocal Gray-Scott system with possibly different fractional diffusion orders, we prove that solutions preserve positivity. Moreover, we identify an explicit \\(L^\\infty\\) invariant set ensuring global boundedness, and derive an eigenfunction-weighted interior \\(L^2\\) bound. Finally, we perform numerical simulations using a sine pseudospectral discretization and ETDRK4 time-stepping, which the impact of fractional orders on pattern formation, consistent with our analytical results.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21417v1",
    "categories": [
      "math-ph",
      "cond-mat.mes-hall"
    ],
    "authors": [
      "Gabriele Mazzini",
      "Domenico Monaco"
    ],
    "title": "Vanishing of power-law corrections to Kubo's formula for the Hall current at incommensurate magnetic fields",
    "abstract": "We consider a non-interacting electron gas confined to a two-dimensional crystal by the action of a perpendicular magnetic field; in the one-particle approximation, the dynamics of the system is modelled by a spectrally gapped Bloch-Landau Hamiltonian. No commensurability condition is assumed between the magnetic flux per unit cell and the quantum of magnetic flux. We construct a non-equilibrium almost-stationary state (NEASS) which \"dresses\" the equilibrium Fermi projection on states below the spectral gap, and models the state of the system after the addition of a weak external electric field of strength $\\varepsilon \\ll 1$. Having in mind applications to the integer quantum Hall effect, we probe the response of a current operator in the direction transverse to that of the applied electric field, and show that the resulting current density in the NEASS is linear in $\\varepsilon$, with no power-law corrections. The linear response coefficient, namely the Hall conductivity, is computed in terms of the equilibrium Fermi projection via the double-commutator formula, in accordance with the prediction from Kubo's linear response theory.\n  Our results generalize the methods and findings of [Lett. Math. Phys. 112 (2022), 91] to the setting of uniform magnetic fields with incommensurate magnetic flux per unit cell, and to lattice-periodic perturbation of such magnetic fields.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21388v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Mingyi Wang",
      "Dongling Wang"
    ],
    "title": "Higher-Order Finite Difference Methods for the Tempered Fractional Laplacian",
    "abstract": "This paper presents a general framework of high-order finite difference (HFD) schemes for the tempered fractional Laplacian (TFL) based on new generating functions obtained from the discrete symbols. Specifically, for sufficiently smooth functions, the resulting discretizations achieve high-order convergence with orders $p=4, 6, 8$. The discrete operators lead to Toeplitz stiffness matrices, allowing efficient matrix-vector multiplications via fast algorithms. Building on these approximations, HFD methods are formulated for solving TFL equations, and their stability and convergence are rigorously analyzed. Numerical simulations confirm the effectiveness of the proposed methods, showing excellent agreement with the theoretical predictions.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21326v1",
    "categories": [
      "math.DS",
      "math.CV"
    ],
    "authors": [
      "Genadi Levin"
    ],
    "title": "A simple proof of Sullivan's complex bounds",
    "abstract": "About 35 years ago Dennis Sullivan proved a precompactness property (\"complex bounds\") for infinitely renormalizable real quadratic polynomials with bounded combinatorics. We present a simple \"soft\" proof of this remarkable result.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21642v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Filippo Berta",
      "Svenja zur Verth"
    ],
    "title": "Non-vanishing of central values of L-functions with angular restrictions",
    "abstract": "We study the angular restrictions for the second moment of toroidal families of $L$-functions using the general theory of trace functions. With the mollification technique we deduce non-vanishing of a positive proportion. Our two main ingredients are classification results of Katz to determine the sheaves at play and a recent result of Fouvry, Kowalski, Michel and Sawin to bound bilinear sums of their trace functions.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21614v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Malihe Yousofzadeh"
    ],
    "title": "Admissible modules over affine Lie superalgebras: The final step in the characterization",
    "abstract": "Over the past three decades, there have been several attempts to characterize modules over affine Lie superalgebras. One of the main issues in this regard is dealing with zero-level modules. In this paper, we study these modules and {complete the characterization} of simple admissible modules over affine Lie superalgebras.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21607v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Danhua Song",
      "Mengyao Wu"
    ],
    "title": "Generalized forms of types N = 1, 2 and higher gauge theory",
    "abstract": "We present a unified formulation for higher gauge theory using generalized forms, encompassing higher connections, curvatures, and gauge transformations. We begin by developing the calculus of generalized forms valued in higher algebras and groups, including the associated higher Maurer--Cartan forms and equations. Using generalized forms of types N = 1, 2, we then provide a complete description of higher gauge structures. Finally, we derive the action functionals for higher Chern--Simons and Yang--Mills theories as applications of the formalism.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21606v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Amine Othmane",
      "Philipp Schmitz",
      "Karl Worthmann",
      "Kathrin Flaßkamp"
    ],
    "title": "A data-based image representation for continuous-time LTI systems",
    "abstract": "We derive a numerically stable method to obtain an image representation of an unknown linear system only from data, leveraging a continuous-time version of Willems et al.'s fundamental lemma. We propose a data-based representation that, unlike previous approaches, avoids solving differential-algebraic equations and uses derivatives approximated by algebraic differentiators. Our image-based formulation significantly reduces the complexity of the data-driven representation by eliminating redundant degrees of freedom and thus reducing the number of unknown quantities to be identified. Simulation results confirm the effectiveness of the proposed approach, even in the presence of severe measurement disturbances.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21588v1",
    "categories": [
      "math.NT",
      "math.RT"
    ],
    "authors": [
      "Daichi Tanaka"
    ],
    "title": "Explicit Construction of Maass Wave Forms and Their Petersson Inner Products",
    "abstract": "In this paper, we explicitly construct Maass wave cusp forms associated to Hecke characters on arbitrary real quadratic fields. This result is a generalization of Maass (1949), who constructed Maass wave cusp forms under the assumption that narrow class number is one. We also compute its Petersson inner product explicitly and give a few examples involving dihedral Artin representation.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21535v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Giacomo Greco",
      "Domenico Marinucci"
    ],
    "title": "Sparsity for isotropic spherical random fields",
    "abstract": "We introduce a simple representation for isotropic spherical random fields and we discuss how it allows to discuss different notions of sparsity under isotropy. We also show how a suitable construction of sparse fields can mimic well the angular power spectrum and the polyspectra of some popular non-Gaussian fields, at the same time allowing for computationally efficient simulation algorithms. Using related ideas we also show how it is possible to obtain sparse approximations of spherical random fields which preserve isotropy, thus addressing an issue which has been raised in the Cosmological literature.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21010v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Xiaomin Cao",
      "Mohammadali Mohammadi",
      "Hien Quoc Ngo",
      "Michail Matthaiou"
    ],
    "title": "Power consumption Reduction in ELAA-Assisted ISAC Systems",
    "abstract": "In this paper, we consider power consumption reduction in extremely large antenna arrays (ELAAs) for integrated sensing and communication (ISAC) applications. Although ELAAs are critical for achieving high-resolution near-field sensing, fully activating all antenna elements in conventional digital architectures leads to prohibitive power demands. To address this, we propose an energy-efficient subarray activation framework that selects an optimal subset of subarrays to minimize the total power consumption, subject to quality-of-service (QoS) constraints for both sensing and communication. We formulate a novel optimization problem and solve it using a successive convex approximation (SCA)-based iterative algorithm. The simulation results confirm that the proposed method significantly reduces power consumption while maintaining dual-function performance.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21905v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Jeremy Kahn",
      "Misha Lyubich"
    ],
    "title": "A priori bounds for some infinitely renormalizable quadratic: IV. Elephant Eyes",
    "abstract": "In this paper we prove a priori bounds for an ``elephant eye'' combinatorics. Little $M$-copies specifying these combinatorics are allowed to converge to the cusp of the Mandelbrot set. To handle it, we develope a new geometric tool: uniform thin-thick decompositions for bordered Riemann surfaces.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21871v1",
    "categories": [
      "math.AG",
      "math.SG"
    ],
    "authors": [
      "Philip Engel"
    ],
    "title": "Polync varieties and multiparameter Kulikov models",
    "abstract": "We study \"polync varieties\", whose singularities are locally products of normal crossing (nc) singularities. We introduce the notion of d-semistability of such varieties, and generalize work of Friedman and Kawamata-Namikawa to address the smoothability of d-semistable, K-trivial, polync varieties. These results are applications of recent breakthroughs on the logarithmic Bogomolov-Tian-Todorov theorem, due to Chan-Leung-Ma and Felten-Filip-Ruddat. We generalize the combinatorial description of Kulikov models for K3 surfaces to the setting of a multiparameter base and describe some interesting examples.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21867v1",
    "categories": [
      "math.PR",
      "math.OC"
    ],
    "authors": [
      "David Treeby",
      "Edward Wang"
    ],
    "title": "Escaping the unit ball",
    "abstract": "We prove that among all unit-speed paths, a straight line minimises the expected escape time from a ball in $\\mathbf{R}^n$, solving the min-mean variant of Bellman's Lost in a Forest problem for ball-shaped forests. The proof uses the Kneser--Poulsen conjecture in the plane, together with results on polygonal chain straightening in higher dimensions. Moreover, we calculate this minimal escape time by deriving the expected linear distance to the boundary of a ball in $n$ dimensions.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21828v1",
    "categories": [
      "math.CO",
      "math.NT"
    ],
    "authors": [
      "Phillip Antis",
      "Holden Britt",
      "Caleigh Chapman",
      "Elizabeth Hawkins",
      "Alex Rice",
      "Elyse Warren"
    ],
    "title": "The sum-product problem for small sets II",
    "abstract": "We establish that every set of $k=10$ natural numbers determines at least $30$ distinct pairwise sums or at least $30$ distinct pairwise products, as well as the analogous result for $k=11$ and at least $34$ sums/products, with sharpness uniquely (up to scaling) exhibited by $\\{1, 2, 3, 4, 6, 8, 9, 12, 16, 18\\}$ and $\\{1, 2, 3, 4, 6, 8, 9, 12, 16, 18, 24\\}$, respectively. This extends previous work of the fifth author with Clevenger, Havard, Heard, Lott, and Wilson, which established the corresponding thresholds for $k\\leq 9$. Included is a classification result for sets of $10$ real numbers (resp. positive real numbers) determining at most $29$ pairwise sums (resp. pairwise products) that do not contain $8$ elements of any single arithmetic progression (resp. geometric progression), as well as some observations controlling additive quadruples in small subsets of two-dimensional generalized geometric progressions.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22085v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Matthew Satriano",
      "Evan Sundbo"
    ],
    "title": "$K$-Equivalence and Integral Cohomology",
    "abstract": "We introduce an integral version of the Hodge polynomial, which encodes the integral cohomology of smooth projective varieties. We prove it extends to a function which is well-defined on the Grothendieck ring of varieties and we obtain as a consequence that $K$-equivalent smooth projective varieties have isomorphic integral cohomology groups.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21952v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Tom Ilmanen"
    ],
    "title": "Lectures on Mean Curvature Flow and Related Equations",
    "abstract": "The aim in these lectures is to study singularity formation, nonuniqueness, and topological change in motion by mean curvature.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21934v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Harry Spencer"
    ],
    "title": "Motivic pieces of curves: $L$-functions and periods",
    "abstract": "Given a curve $C$ over a number field $K$ equipped with the action of a finite group $G$ by $K$-automorphisms, one obtains a factorisation of $L(C,s)$ into a product of $L$-functions of `motivic pieces of curves' associated to irreducible $G$-representations. We describe an algorithm for explicitly computing values of these $L$-functions, demonstrating implementations in the cases of certain curves with actions by $C_3$, $C_4$ and $D_{10}$. We explain how this algorithm can be used to factor $L$-functions of curves with endomorphisms of Hecke type.\n  Towards applications, we explicitly formulate and numerically verify a version of Deligne's Period Conjecture for hitherto-uninvestigated $L$-functions arising from motivic pieces of superelliptic curves.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21763v1",
    "categories": [
      "math.PR",
      "stat.CO"
    ],
    "authors": [
      "Shuigen Liu",
      "Xin T. Tong"
    ],
    "title": "Spectral Gap of Metropolis Algorithms for Non-smooth Distributions under Isoperimetry",
    "abstract": "Metropolis algorithms are classical tools for sampling from target distributions, with broad applications in statistics and scientific computing. Their convergence speed is governed by the spectral gap of the associated Markov operator. Recently, Andrieu et al. (2024) derived the first explicit bounds for the spectral gap of Random-Walk Metropolis when the target distribution is smooth and strongly log-concave. However, existing literature rarely discuss non-smooth targets. In this work, we derive explicit spectral gap bounds for the Random-Walk Metropolis and Metropolis-adjusted Langevin algorithms over a broad class of non-smooth distributions. Moreover, combining our analysis with a recent result in Goyal et al. (2025), we extend these bounds to targets satisfying a Poincare or log-Sobolev inequality, beyond the strongly log-concave setting. Our theoretical results are further supported by numerical experiments.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21762v1",
    "categories": [
      "math.PR",
      "math.AP"
    ],
    "authors": [
      "Xue-Mei Li",
      "Szymon Sobczak"
    ],
    "title": "Navier-Stokes with a fractional transport noise as a limit of multi-scale dynamics",
    "abstract": "We define a bona fide rough path solution for the Navier-Stokes equation with an additional rough transport term, and show that the SPDE on the three-dimensional torus driven by a fractional Brownian motion on $H^σ$ has solutions characterised as the effective limits of a slow/fast system. We further show that this rough path solution is equivalent to the widely used incremental notion of solution (the unbounded rough driver formulation), demonstrating broader applicability to other nonlinear SPDEs.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21748v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Lin Li",
      "Jiongmin Yong"
    ],
    "title": "Stochastic Optimal Linear Quadratic Controls with A Recursive Cost Functional",
    "abstract": "This paper is concerned with a stochastic linear quadratic (LQ, for short) control problem with a recursive cost functional. It involves BSDEs in $L^1$ whose well-posedness is a subtle issue. A suitable framework has been adopted so that the corresponding LQ problem is correctly formulated. Open-loop and closed-loop solvability of such an LQ problem have been investigated and characterized by the solvability of an FBSDE and that of Riccati differential equation.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21734v1",
    "categories": [
      "math.NT",
      "math.FA"
    ],
    "authors": [
      "Yijun Yuan"
    ],
    "title": "Formalization of non-Archimedean functional analysis 1: spherically complete spaces",
    "abstract": "In this article, we present a formalization of spherically complete spaces, which is a fundamental notion in non-archimedean functional analysis. This work includes the equivalent definitions of spherically complete spaces, their basic properties, examples and non-examples such as the field $\\mathbf{C}_p$ of $p$-adic complex numbers. As applications, we formalize the Birkhoff-James orthogonality, Hahn-Banach extension theorem and the spherical completion for non-archimedean Banach spaces.\n  Code available at https://github.com/YijunYuan/SphericalCompleteness",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21730v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Jiacheng Sun"
    ],
    "title": "Sweedler Duality for BiHom-associative Algebras",
    "abstract": "Motivated by the fact that ordinary linear duality does not in general produce a coalgebra structure from an infinite-dimensional algebra, we develop a Sweedler-type finite dual construction for BiHom-associative algebras. For a BiHom-algebra $(G,μ,α,β)$ over a field, we define its Sweedler dual $G^{\\circ}\\subseteq G^{*}$ as the subspace of linear functionals annihilating a finite-codimensional BiHom-ideal of $G$. We prove that $G^{\\circ}$ carries a natural BiHom-coalgebra structure whose comultiplication is the restriction of $μ^{*}$, and that BiHom-algebra morphisms induce BiHom-coalgebra morphisms on Sweedler duals. We further extend this construction to right BiHom-modules, obtaining right BiHom-comodules over $G^{\\circ}$ under a surjectivity assumption on the twisting map $β$. The Hom and classical cases are recovered by the specializations $α=β$ and $α=β=\\mathrm{Id}$, respectively.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21674v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Ivan Biočić",
      "Vanja Wagner"
    ],
    "title": "Nonhomogeneous boundary condition for spectral non-local operators",
    "abstract": "We study semilinear non-local elliptic problems driven by spectral-type operators of the form $ψ(-L_{|D})$ in a bounded $C^{1,1}$ domain $D\\subset \\mathbb{R}^d$ with a nonhomogeneous boundary condition. Here $ψ$ is a Bernstein function satisfying a weak scaling condition at infinity, and $L_{|D}$ is the generator of a killed Lévy process. This general framework covers and extends the theory of the interpolated fractional Laplacian. A key novelty in this setting is the analysis of the nonhomogeneous boundary condition formulated in terms of the Poisson potential with respect to the $d-1$ Hausdorff measure on $\\partial D$. We establish sharp boundary estimates for Green and Poisson potentials, introduce a weak $L^1$ trace-like boundary operator, and provide existence results for solutions under quite general nonlinearities, including sign-changing and non-monotone cases. The methodology combines stochastic process techniques, potential theory, and spectral analysis, and expresses the boundary behavior of the solution in terms of the renewal function and the distance to the boundary, suggesting a possible unified treatment of semilinear boundary problems in non-local settings.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22098v1",
    "categories": [
      "cs.IT",
      "eess.SY"
    ],
    "authors": [
      "Sahan Liyanaarachchi",
      "Sennur Ulukus",
      "Nail Akar"
    ],
    "title": "Beyond Martingale Estimators: Structured Estimators for Maximizing Information Freshness in Query-Based Update Systems",
    "abstract": "This paper investigates information freshness in a remote estimation system in which the remote information source is a continuous-time Markov chain (CTMC). For such systems, estimators have been mainly restricted to the class of martingale estimators in which the remote estimate at any time is equal to the value of the most recently received update. This is mainly due to the simplicity and ease of analysis of martingale estimators, which however are far from optimal, especially in query-based (i.e., pull-based) update systems. In such systems, maximum a-posteriori probability (MAP) estimators are optimal. However, MAP estimators can be challenging to analyze in continuous-time settings. In this paper, we introduce a new class of estimators, called structured estimators, which can seamlessly shift from a martingale estimator to a MAP estimator, enabling them to retain useful characteristics of the MAP estimate, while still being analytically tractable. Particularly, we introduce a new estimator termed as the $p$-MAP estimator which is a piecewise-constant approximation of the MAP estimator with finitely many discontinuities, bringing us closer to a full characterization of MAP estimators when modeling information freshness. In fact, we show that for time-reversible CTMCs, the MAP estimator reduces to a $p$-MAP estimator. Using the binary freshness (BF) process for the characterization of information freshness, we derive the freshness expressions and provide optimal state-dependent sampling policies (i.e., querying policies) for maximizing the mean BF (MBF) for pull-based remote estimation of a single CTMC information source, when structured estimators are used. Moreover, we provide optimal query rate allocation policies when a monitor pulls information from multiple heterogeneous CTMCs with a constraint on the overall query rate.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22088v1",
    "categories": [
      "math.AP",
      "math.DS",
      "math.SG"
    ],
    "authors": [
      "Levin Maier"
    ],
    "title": "On Global Weak Solutions for the Magnetic Two-Component Hunter-Saxton System",
    "abstract": "We study the magnetic two-component Hunter-Saxton system (M2HS), which was recently derived in \\cite{M24} as a magnetic geodesic equation on an infinite-dimensional configuration space. While the geometric framework and the global weak flow were outlined there, the present paper provides the analytical foundations of this construction from the PDE perspective.\n  First, we derive an explicit solution formula in Lagrangian variables via a Riccati reduction, yielding an alternative proof of the blow-up criterion together with an explicit expression for the blow-up time. Second, we rigorously construct global conservative weak solutions by developing the analytic theory of the relaxed configuration space and the associated weak magnetic geodesic flow, thereby realizing the geometric program proposed in \\cite{M24}.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22073v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Benjamin Gess",
      "Robert Lasarzik"
    ],
    "title": "Probabilistically Strong Solutions to Stochastic Euler Equations",
    "abstract": "In this paper, we establish the existence of probabilistically strong, measure-valued solutions for the stochastic incompressible Navier--Stokes equations and prove their convergence, in the vanishing viscosity limit, to probabilistically strong solutions for the stochastic incompressible Euler equations. In particular, this solves the open problem of constructing probabilistically strong solutions for the stochastic Euler equations that satisfy the energy inequality for general $L^2$ initial data. We introduce the concept of energy-variational solutions in the stochastic context in order to treat the nonlinearities without changing the probability space. Furthermore, we extend these results to fluids driven by transport noise.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22066v1",
    "categories": [
      "math.AT",
      "math.DS"
    ],
    "authors": [
      "Clemens Bannwart",
      "Claudia Landi"
    ],
    "title": "Canonical chain complexes for Morse-Smale vector fields",
    "abstract": "In 1960, Smale defined a filtration of a closed smooth manifold by the unstable manifolds of fixed points and closed orbits of a Morse-Smale vector field defined on it, and derived generalized Morse inequalities. This suggests that, similarly to the Morse chain complex of a gradient-like vector field, even in the presence of closed orbits, Morse-Smale vector fields admit canonical chain complexes, invariant under topological equivalence, from which one can algebraically derive Morse inequalities. In this paper we show that this is actually the case, improving the state of the art that only offers non-canonical chain complexes. Technically, we achieve this result considering the Čech homology spectral sequence of the unstable manifolds filtration. In particular, we turn bounded exact couples into chain complexes such that the limit page of the spectral sequence associated with an exact couple gives the homology of the chain complex. We showcase our construction with examples.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21888v1",
    "categories": [
      "math.DS",
      "math-ph",
      "math.AT",
      "math.GR",
      "math.RT"
    ],
    "authors": [
      "Alexander Fel'shtyn",
      "Mateusz Slomiany"
    ],
    "title": "Synchronization points: growth, asymptotics, congruences, and the synchronization zeta function",
    "abstract": "In this paper, we introduce the synchronization zeta function associated with a pair of self-maps of a topological space and investigate its properties. We also define the growth rate of synchronization points and derive an explicit formula in the setting of endomorphisms of compact, connected Abelian groups. In addition, we establish Gauss congruences and describe the asymptotic behavior for the sequence of numbers of synchronization points, under the assumption that the synchronization zeta function is rational. Further, we discuss connections with topological entropy and Reidemeister torsion.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21818v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Cecilie Olesen Recke",
      "Sarah Lumpp",
      "Nataliia Kushnerchuk",
      "Janike Oldekop",
      "Jiayi Li",
      "Jane Ivy Coons",
      "Elina Robeva"
    ],
    "title": "Identifiability in Graphical Discrete Lyapunov Models",
    "abstract": "In this paper, we study discrete Lyapunov models, which consist of steady-state distributions of first-order vector autoregressive models. The parameter matrix of such a model encodes a directed graph whose vertices correspond to the components of the random vector. This combinatorial framework naturally allows for cycles in the graph structure. We focus on the fundamental problem of identifying the entries of the parameter matrix. In contrast to the classical setting, we assume non-Gaussian error terms, which allows us to use the higher-order cumulants of the model. In this setup, we show generic identifiability for directed acyclic graphs with self-loops at each vertex and show how to express the parameters as a rational function of the cumulants. Furthermore, we establish local identifiability for all directed graphs containing self loops at each vertex and no isolated vertices. Finally, we provide first results on the defining equations of the models, showing model equivalence for certain graphs and paving the way towards structure learning.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21811v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Gregor Cigler",
      "Marko Kandić"
    ],
    "title": "On positive automorphisms of algebras of operators on atomic Archimedean vector lattices",
    "abstract": "Let $X$ be an Archimedean vector lattice. We investigate subalgebras of $\\mathscr{L}(X)$ consisting of regular operators that contain all rank-one operators of the form $a \\otimes \\varphi_b$, where $a$ and $b$ are atoms of $X$ and $\\varphi_b$ denotes the coordinate functional associated with $b$. Our main result shows that every positive automorphism of such a subalgebra contained in $\\mathscr{L}(c_{00}(Λ))$, is necessarily spatial, meaning that it is implemented by a transformation of the form $$ T \\mapsto P D\\, T\\, D^{-1} P^{-1}, $$ where $P$ is a permutation operator and $D$ is a positive diagonal operator. An important tool for this analysis-one that is also of independent interest-is the Kakutani representation theorem, which we use to establish that every finite-dimensional vector subspace of $X$ is order closed.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21807v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Yuma Nakamura",
      "Tomoyuki Kubota",
      "Yusuke Imai",
      "Sumito Tsunegi",
      "Hirofumi Notsu",
      "Kohei Nakajima"
    ],
    "title": "Ensemble Reservoir Computing for Physical Systems",
    "abstract": "Physical computing exploits unconventional physical substrates to overcome limitations such as the high energy consumption inherent in digital computation. However, intrinsic noise and temporal fluctuations (e.g., oscillations) generally deteriorate computational performance. Here, we propose ensemble reservoir computing (ERC), a novel framework that employs ensemble averaging of spatially multiplexed systems to achieve robust information processing despite noise and temporal fluctuations. First, we prove that ensemble averaging in ERC eliminates temporal fluctuations and noise from dynamical states under certain conditions, thereby restoring computational performance to its noise-free level. Next, we show that ERC not only removes the noise and fluctuations but also actively exploits the computational capabilities that conventional reservoir computing (RC) leaves unutilized. This computational enhancement is demonstrated across diverse dynamical systems (e.g., periodic, chaotic, and strange-nonchaotic systems), in which ERC outperforms conventional RC. Finally, using energy-efficient spin-torque oscillators (STOs), we demonstrate that ERC maintains high performance even under realistic conditions, in which noise and temporal fluctuations coexist: STOs with ERC achieved 99\\% accuracy on an error detection test, where conventional STO reservoir with linear regression only shows a chance level performance, highlighting ERC's robustness and performance gains for physical systems.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21784v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Oussama Hamza"
    ],
    "title": "Filtrations and cohomology on graph products",
    "abstract": "Let $p$ be a prime. We resolve a question posed by Mináč-Rogelstad-Tân. We relate the Zassenhaus and the lower central series of pro-$p$ groups under a torsion-freeness condition.\n  We also study graph products of (pro-$p$) groups under natural assumptions. In particular, we compute their graded Lie algebras associated with the previous filtrations, as well as their cohomology over $\\mathbb{F}_p$. Our approach relies on various filtrations of amalgamated products, as studied in Leoni's PhD thesis. Explicit examples are provided using the Koszul property.\n  As a concrete application, we compute the cohomology over $\\mathbb{F}_p$ and the graded Lie algebras associated with the filtrations of graph products of fundamental groups of surfaces. These groups furnish new examples satisfying the torsion-freeness condition, which arises in the question of Mináč-Rogelstad-Tân.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21736v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Michael Hinze",
      "Christian Kahle",
      "Michael Stahl"
    ],
    "title": "A reduced basis method for parabolic PDEs based on a space-time least squares formulation",
    "abstract": "In this work, we present a POD-greedy reduced basis method for parabolic partial differential equations (PDEs), based on the least squares space-time formulation proposed in [Hinze, Kahle, Stahl, A least-squares space-time approach for parabolic equations, 2023, arXiv:2305.03402] that assumes only minimal regularity. We extend this approach to the parameter-dependent case. The corresponding variational formulation then is based on a parameter-dependent, symmetric, uniformly coercive, and continuous bilinear form. We apply the reduced basis method to this formulation, following the well-developed techniques for parameterized coercive problems, as seen e.g. in reduced basis methods for parameterized elliptic PDEs. We present an offline-online decomposition and provide certification with absolute and relative error bounds. The performance of the method is demonstrated using selected numerical examples.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21707v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Tamás Dózsa",
      "Andrea Angino",
      "Zoltán Szabó",
      "József Bokor",
      "Matthias Voigt"
    ],
    "title": "Adaptive Kernel Methods",
    "abstract": "Kernel methods approximate nonlinear maps in a data-driven manner by projecting the target map onto a finite-dimensional Hilbert space called the solution space. Traditionally, this space is a subspace of a fixed ambient reproducing kernel Hilbert space (RKHS), determined solely by the chosen kernel and the dataset, whose elements identify the basis elements. Consequently, the projection operator underlying the kernel method depends on the loss function, the dataset, and the choice of ambient RKHS. In this study, we consider kernel methods whose solution spaces also depend on learnable parameters that are independent of the dataset. The resulting methods can be viewed as variable projection operators that depend on the loss function, the dataset, and the new learnable parameters instead of a fixed RKHS. This work has two main contributions. First, we propose an efficient approximation of kernels associated with infinite-dimensional RKHSs, commonly used to reduce the solution-space dimension for large datasets. Second, we construct fixed-dimensional, parameter-dependent solution spaces that enable highly efficient kernel models suitable for large-scale problems without the need to approximate kernels of infinite-dimensional RKHSs. Our novel family of adaptive kernel methods generalizes earlier approaches, including Random Fourier Features, and we demonstrate their effectiveness through several numerical experiments.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21677v1",
    "categories": [
      "math.AP",
      "gr-qc",
      "math-ph"
    ],
    "authors": [
      "Weihang Zheng"
    ],
    "title": "Localized Big Bang Stability of Spacetime Dimensions $n\\geq4$",
    "abstract": "We prove the past nonlinear stability of the sub-critical Kasner-scalar field solutions to the Einstein-scalar field equations on a truncated cone domain in spacetime dimensions $n\\geq4$. Our analysis demonstrates that the perturbed solutions are asymptotically pointwise Kasner, geodesically incomplete in the contracting direction and terminate at quiescent and crushing singularities characterized by the blow-up of curvature invariants. This work generalizes the result of Beyer-Oliynyk-Zheng in [arXiv:2502.09210v2] to all higher dimensional spacetimes.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22152v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Simeon Hellsten"
    ],
    "title": "Cobordism and Concordance of Surfaces in 4-Manifolds",
    "abstract": "We show that two properly embedded compact surfaces in an orientable 4-manifold are cobordant if and only if they are $\\mathbb{Z}/2$-homologous and either the 4-manifold has boundary or the surfaces have the same normal Euler number. If the 4-manifold is simply-connected and the surfaces are closed, non-orientable, and cobordant, we show that they are in fact concordant. This completes the classification of closed surfaces in simply-connected 4-manifolds up to concordance. Our methods give new constructions of cobordisms with prescribed boundaries, and completely determine when a given cobordism between the boundaries extends to a cobordism or concordance between the surfaces. We obtain our concordance results by extending Sunukjian's method of ambient surgery to the unoriented case using Pin$^-$-structures. We also discuss conditions for an arbitrary codimension 2 properly embedded submanifold to admit an unoriented spanning manifold with prescribed boundary. All results hold in both the smooth and topological categories.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22092v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "A. L. Martínez-Triviño",
      "J. P. dos Santos",
      "G. Tinaglia"
    ],
    "title": "Half-space type theorems for a class of weighted minimal surfaces in $\\mathbb{R}^{3}$",
    "abstract": "We establish half-space type results for a class of height-dependent weighted minimal surfaces in $\\mathbb{R}^3$, namely critical points of a weighted area functional whose weight depends on the height. When the weight has at most quadratic growth, we prove that there are no proper surfaces contained either in two transverse vertical half-spaces of $\\mathbb{R}^3$ or in a half-space determined by a non-vertical plane. We show that this second result holds in a more general context, namely, for a class of stochastically complete weighted minimal surfaces. In this setup, we also prove a result for surfaces contained in regions bounded by cones. Furthermore, for stochastically complete weighted minimal surfaces satisfying restrictions on their principal curvatures, we establish a version of the classic strong half-space result due to Hoffman-Meeks.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22089v1",
    "categories": [
      "math.RA",
      "math.QA"
    ],
    "authors": [
      "Ilaria Colazzo",
      "Geoffrey Janssens"
    ],
    "title": "On set-theoretic solutions of pentagon equation and positive basis Hopf algebras",
    "abstract": "We investigate the connection between bijective, not necessarily finite, set-theoretic solutions of the pentagon equation and Hopf algebras. Firstly, we prove that finite solutions correspond to Hopf algebras with the positive basis property. As a corollary we generalise Lu-Yan-Zhu classification to arbitrary characteristic $0$ fields $k$. Secondly, we study the general problem of when a Hopf algebra has a basis yielding a set-theoretic solution. Finally, we classify all (co)commutative bijective solutions. This result requires to obtain a description of all bases of a group algebra $k[G]$ yielding a set-theoretic solution. We namely show that such bases correspond, through a Fourier transform, to splittings $A \\rtimes N$ of $G$ with $A$ a finite abelian group.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22080v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Shuaicheng Tong",
      "Michael A. Boateng",
      "Mathieu Tanneau",
      "Pascal Van Hentenryck"
    ],
    "title": "Volt/VAR Optimization in Transmission Networks with Discrete-Control Devices",
    "abstract": "Voltage (Volt) and reactive-power (VAR) control in transmission networks is critical for reliability and increasingly needs fast, implementable decisions. This paper presents a transmission Volt/VAR Optimization (VVO) framework that co-optimizes discrete control of on-load tap-changing transformers (OLTCs) and capacitor banks (CBs) with AC power flow (ACPF) physics to improve voltage stability and minimize VAR generation. The framework follows a relax-round-resolve pipeline: a continuous relaxation proposes targets, a rounding step selects feasible discrete settings, and a final solve enforces AC power flow physics. Extensive experiments on IEEE, PEGASE, and RTE systems show consistent improvements in voltage and VAR quality metrics with modest generator redispatch while preserving economic operation and achieving compatible runtimes with real-time transmission operations.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22072v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Daniel Bath",
      "Mircea Mustaţă"
    ],
    "title": "On singularities of determinantal hypersurfaces",
    "abstract": "Given a closed subscheme $Z$ in a smooth variety $X$, defined by the maximal minors of an $s\\times r$ matrix of regular functions, with $s\\geq r$, we consider the corresponding incidence correspondence $W$ in $Y=X\\times {\\mathbf P}^{r-1}$, and relate the log canonical thresholds of $(X,Z)$ and $(Y,W)$. In particular, when $r=s$, we show that ${\\rm lct}(X,Z)=1$ if and only if ${\\rm lct}(Y,W)=r$. Moreover, in this case, we show that $Z$ has rational singularities if and only if $W$ has pure codimension $r$ in $Y$ and has rational singularities. As a consequence, we deduce that for a configuration hypersurface with a connected configuration matroid, the corresponding configuration incidence variety has rational singularities.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22056v1",
    "categories": [
      "math.PR",
      "math.AP",
      "math.DS"
    ],
    "authors": [
      "Benjamin Gess",
      "Rishabh S. Gvalani",
      "Adrian Martini"
    ],
    "title": "Ergodicity for SPDEs driven by divergence-free transport noise",
    "abstract": "We study the ergodic behaviour of the McKean-Vlasov equations driven by common, divergence-free transport noise. In particular, we show that in dimension $d\\geq 2$, if the noise is mixing and sufficiently strong it can enforce the uniqueness of invariant probability measures, even if the deterministic part of equation has multiple steady states.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22038v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Vitalii Aksenov",
      "Martin Eigel",
      "Mathias Oster"
    ],
    "title": "Anderson Mixing in Bures Wasserstein Space of Gaussian Measures",
    "abstract": "Various statistical tasks, including sampling or computing Wasserstein barycenters, can be reformulated as fixed-point problems for operators on probability distributions.\n  Accelerating standard fixed-point iteration schemes provides a promising novel approach to the design of efficient numerical methods for these problems.\n  The Wasserstein geometry on the space of probability measures, although not precisely Riemannian, allows us to define various useful Riemannian notions, such as tangent spaces, exponential maps and parallel transport, motivating the adaptation of Riemannian numerical methods.\n  We demonstrate this by developing and implementing the Riemannian Anderson Mixing (RAM) method for Gaussian distributions.\n  The method reuses the history of the residuals and improves the iteration complexity, and we argue that the additional costs, compared to Picard method, are negligible.\n  We show that certain open balls in the Bures-Wasserstein manifold satisfy the requirements for convergence of RAM.\n  The numerical experiments show a significant acceleration compared to a Picard iteration, and performance on par with Riemannian Gradient Descent and Conjugate Gradient methods.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22004v1",
    "categories": [
      "math.AG",
      "math.RT"
    ],
    "authors": [
      "Agnieszka Bodzenta",
      "Alexey Bondal"
    ],
    "title": "Highest weight categories via pairs of dual exceptional sequences",
    "abstract": "In this paper we present criteria in terms of dual pairs of exceptional sequences for an abelian category to be highest weight. The criteria are applied in three situations of geometric origin. We give new proofs for the facts that the category of perverse sheaves of middle perversity on complex-analytic manifolds with suitable conditions on the stratification is highest weight and that the derived coherent category of any Grassmannian has a $t$-structure with highest weight heart. Also we show that the abelian null category of any proper birational morphism of regular surfaces is highest weight. For this null category, we give a geometric description of some special objects related to the highest weight structure, such as standard, costandard and characteristic tilting objects.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21990v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Nicolas Blin",
      "Stefano Gualandi",
      "Christopher Maes",
      "Andrea Lodi",
      "Bartolomeo Stellato"
    ],
    "title": "Batched First-Order Methods for Parallel LP Solving in MIP",
    "abstract": "We present a batched first-order method for solving multiple linear programs in parallel on GPUs. Our approach extends the primal-dual hybrid gradient algorithm to efficiently solve batches of related linear programming problems that arise in mixed-integer programming techniques such as strong branching and bound tightening. By leveraging matrix-matrix operations instead of repeated matrix-vector operations, we obtain significant computational advantages on GPU architectures. We demonstrate the effectiveness of our approach on various case studies and identify the problem sizes where first-order methods outperform traditional simplex-based solvers depending on the computational environment one can use. This is a significant step for the design and development of integer programming algorithms tightly exploiting GPU capabilities where we argue that some specific operations should be allocated to GPUs and performed in full instead of using light-weight heuristic approaches on CPUs.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21982v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Daniel Cizma",
      "Nati Linial"
    ],
    "title": "Metric Approximations of Consistent Path Systems",
    "abstract": "A path system $\\mathscr{P}$ in a graph $G=(V,E)$ is a collection of paths, with exactly one path between any two vertices in $V$. A path system is said to be consistent if it is closed under subpaths. We say that a path system $\\mathscr{P}$ is $α$-metric if there exists a metric $ρ$ on $V$ such that $\\sum_{i=1}^{k}ρ(x_{i-1},x_{i}) \\le αρ(x_0,x_k)$ for every path $(x_0,x_1,\\dots,x_k)\\in \\mathscr{P}$. Also, we denote by $Δ(\\mathscr{P})$ the infimum of $α$ for which $\\mathscr{P}$ is $α$-metric. We construct here infinitely many $n$-point consistent path systems $\\mathscr{P}_n$ with $Δ(\\mathscr{P}_n) \\ge n^{\\frac{1}{2}-o(1)}$. We also show how to efficiently compute $Δ(\\mathscr{P})$ for a given path system.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21931v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Karel Devriendt",
      "Ignacio Echave-Sustaeta Rodríguez",
      "Frank Röttger"
    ],
    "title": "Extremal conditional independence for Hüsler-Reiss distributions via modular functions",
    "abstract": "We study extremal conditional independence for Hüsler-Reiss distributions, which is a parametric subclass of multivariate Pareto distributions. As the main contribution, we introduce two set functions, i.e.~functions which assign a value to the distribution and each of its marginals, and show that extremal conditional independence statements can be characterized by modularity relations for these functions. For the first function, we make use of the close connection between Hüsler-Reiss and Gaussian models to introduce a multiinformation-inspired measure $m^{\\text{HR}}$ for Hüsler-Reiss distributions. For the second function, we consider an invariant $σ^2$ that is naturally associated to the Hüsler-Reiss parameterization and establish the second modularity criterion under additional positivity constraints. Together, these results provide new tools for describing extremal dependence structures in high-dimensional extreme value statistics. In addition, we study the geometry of a bounded subset of Hüsler-Reiss parameters and its relation with the Gaussian elliptope.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21906v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Marc Schmidlin"
    ],
    "title": "On Gautschi & Stirling Identities, Asymptotics and Inequalities for the Pi (or Gamma) Function",
    "abstract": "We derive two-sided bounds for a class of Stirling-type asymptotic formulas for piecewise logarithmic interpolations of the pi function, and hence also for the factorials and the gamma functions. The bounds are derived by first proving some integral identity versions of Gautschi's inequality and a class of Stirling-type asymptotic formulas, and then bounding these integrals by asymptotically optimal bounds. Additionally, all the proofs given rely only on common elementary arguments and connect, generalise and possibly improve various results that have been published previously. Lastly, we provide numerical comparisons concerning the effectiveness and behaviour of the bounds and approximations in a graphical manner, which clearly indicate that the bounds are asymptotically optimal.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21858v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Jie Liu",
      "Hailun Zhang",
      "Jiheng Zhang"
    ],
    "title": "When to Match: A Cost-Balancing Principle for Dynamic Markets",
    "abstract": "Matching platforms, from ridesharing to food delivery to competitive gaming, face a fundamental operational dilemma: match agents immediately to minimize waiting costs, or delay to exploit the efficiency gains of thicker markets. Yet computing optimal policies is generally intractable, sophisticated algorithms often rely on restrictive distributional assumptions, and common heuristics lack worst-case performance guarantees. We formulate a versatile framework for multi-sided matching with general state-dependent cost structures and non-stationary arrival dynamics. Central to our approach is a cost-balancing principle: match when accumulated waiting cost reaches a calibrated proportion of instantaneous matching cost. This equilibrium condition emerges from fluid-limit analysis and motivates a simple, adaptive Cost-Balancing (CB) algorithm requiring no distributional assumptions. We prove that CB achieves a competitive ratio of $(1+\\sqrtΓ)$ under adversarial arrivals, where $Γ$ quantifies economies of scale, guaranteeing cost within a constant factor of the offline optimum. In contrast, standard greedy and threshold policies can incur unbounded costs in adversarial scenarios. We further establish a universal lower bound of $(\\sqrt{5}+1)/2$ (the golden ratio), quantifying the fundamental price of uncertainty in online matching. Experiments on game matchmaking and real-world food delivery data demonstrate practical effectiveness, with CB consistently outperforming industry-standard heuristics.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21954v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Zhiyuan Deng",
      "Yutian Sun"
    ],
    "title": "Asymptotic Expansion for Expanding Spherical Averages in Real Rank One",
    "abstract": "This paper develops precise asymptotic formulas for expanding non-spherical averages on compact quotients of real rank-one Lie groups, focusing on $SO(n,1)$ as a model case. Using tools from harmonic analysis and representation theory, the study reduces the analysis of orbit averages to an ordinary (ODE) derived from the action of the Casimir operator.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21757v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Hamidreza Abin",
      "Amin Gohari",
      "Andrew W. Eckford"
    ],
    "title": "Subjective Distortion: Achievability and Outer Bounds for Distortion Functions with Memory",
    "abstract": "In some rate-distortion-type problems, the required fidelity of information is affected by past actions. As a result, the distortion function depends not only on the instantaneous distortion between a source symbol and its representation symbol, but also on past representations. In this paper, we give a formal definition of this problem and introduce both inner (achievable) and outer bounds on the rate-distortion tradeoff. We also discuss convexification of the problem, which makes it easier to find bounds. Problems of this type arise in biological information processing, as well as in recommendation engines; we provide an example applied to a simplified biological information processing problem.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21756v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Alexey Orlov"
    ],
    "title": "The Classification of Supersingular Elliptic Curves in Characteristic 3",
    "abstract": "We provide an explicit classification of supersingular elliptic curves in characteristic 3 into isomorphism classes, and give explicit formulae for their point counts.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21717v1",
    "categories": [
      "math.PR",
      "stat.ML"
    ],
    "authors": [
      "Shogo Nakakita"
    ],
    "title": "On sample complexity for covariance estimation via the unadjusted Langevin algorithm",
    "abstract": "We establish sample complexity guarantees for estimating the covariance matrix of strongly log-concave smooth distributions using the unadjusted Langevin algorithm (ULA). We quantitatively compare our complexity estimates on single-chain ULA with embarrassingly parallel ULA and derive that the sample complexity of the single-chain approach is smaller than that of embarrassingly parallel ULA by a logarithmic factor in the dimension and the reciprocal of the prescribed precision, with the difference arising from effective bias reduction through burn-in. The key technical contribution is a concentration bound for the sample covariance matrix around its expectation, derived via a log-Sobolev inequality for the joint distribution of ULA iterates.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21710v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Yuan Zhang",
      "Yutong Han",
      "Yuanqing Xia",
      "Aming Li"
    ],
    "title": "On Diagonalizable Systems with Random Structure",
    "abstract": "Diagonalizability plays an important role in the analysis and design of multivariable systems. A structured matrix is called structurally diagonalizable if almost all of its numerical realizations, obtained by assigning real values to its free entries, are diagonalizable. Structural diagonalizability is useful for the verification and optimization of various structural system properties. In this paper, we study the asymptotic probability distribution of structural diagonalizability for structured systems whose system matrices are represented by directed Erdős-Rényi random graphs. Leveraging a recently established graph-theoretic characterization of structural diagonalizability, we analyze the distribution of structurally diagonalizable graphs under different edge-density regimes. For dense graphs, we prove that the system is almost always structurally diagonalizable. For graphs of medium density, we derive tight upper and lower bounds on the asymptotic probability of structural diagonalizability. For extremely sparse graphs, we show that this probability approaches 0. The theoretical results are validated through extensive numerical simulations with varying numbers of vertices and connection probabilities.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22142v1",
    "categories": [
      "math.PR",
      "math-ph",
      "math.AP"
    ],
    "authors": [
      "Scott Armstrong",
      "Ahmed Bou-Rabee",
      "Tuomo Kuusi"
    ],
    "title": "Superdiffusion and anomalous regularization in self-similar random incompressible flows",
    "abstract": "We study the long-time behavior of a particle in $\\mathbb{R}^d$, $d \\geq 2$, subject to molecular diffusion and advection by a random incompressible flow. The velocity field is the divergence of a stationary random stream matrix $\\mathbf{k} $ with positive Hurst exponent $γ> 0$, so the resulting random environment is multiscale and self-similar. In the perturbative regime $γ\\ll 1$, we prove quenched power-law superdiffusion: for a typical realization of the environment, the displacement variance at time $t$ grows like $t^{2/(2-γ)}$, the scaling predicted by renormalization group heuristics. We also identify the leading prefactor up to a random (quenched) relative error of order $γ^{\\frac12}\\left| \\log γ\\right|^3$. The proof implements a Wilsonian renormalization group scheme at the level of the infinitesimal generator $\\nabla \\cdot (νI_d + \\mathbf{k} ) \\nabla$, based on a self-similar induction across scales. We demonstrate that the coarse-grained generator is well-approximated, at each scale $r$, by a constant-coefficient Laplacian with effective diffusivity growing like $r^γ$. This approximation is inherently scale-local: reflecting the multifractal nature of the environment, the relative error does not decay with the scale, but remains of order $γ^{\\frac12}\\left| \\log γ\\right|^2$. We also prove anomalous regularization under the quenched law: for almost every realization of the drift, solutions of the associated elliptic equation are Hölder continuous with exponent $1 - Cγ^{\\frac12}$ and satisfy estimates which are uniform in the molecular diffusivity $ν$ and the scale.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22122v1",
    "categories": [
      "math.AP",
      "math.OA"
    ],
    "authors": [
      "Omar Mohsen"
    ],
    "title": "Microlocal maximal hypoellipticity from the geometric viewpoint: I",
    "abstract": "Given some vector fields on a smooth manifold satisfying Hörmander's condition, we define a bi-graded pseudo-differential calculus which contains the classical pseudo-differential calculus and a pseudo-differential calculus adapted to the sub-Riemannian structure induced by the vector fields.\n  Our approach is based on geometric constructions (resolution of singularities) together with methods from operators algebras. We develop this calculus in full generality, including Sobolev spaces, the wavefront set, and the principal symbol, etc.\n  In particular, using this calculus, we prove that invertibility of the principal symbol implies microlocal maximal hypoellipticity. This allows us to resolve affirmatively the microlocal version of a conjecture of Helffer and Nourrigat.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22117v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Francesco Di Braccio",
      "Viresh Patel"
    ],
    "title": "Monochromatic cycle partitions of $r$-edge-coloured graphs with high minimum degree",
    "abstract": "A question posed independently by Letzter and Pokrovskiy asks: how many vertex-disjoint monochromatic cycles are needed to cover the vertex set of an $r$-edge-coloured graph, as a function of its minimum (uncoloured) degree? We resolve this problem up to a $(\\log r)$-factor. Specifically, we prove that, for any $r \\geq 2$ and $δ\\in (0,1/2)$, any $n$-vertex $r$-edge-coloured graph $G$ with $δ(G) \\geq (1- δ)n$ can be covered with $\\mathcal{O}(r \\log r \\cdot \\lceil r/\\log(1/δ)\\rceil)$ vertex-disjoint monochromatic cycles. We construct graphs that show this is tight up to the $(\\log r)$-factor for all values of $r$ and $δ$, and along the way disprove a conjecture of Bal and DeBiasio about monochromatic tree covering.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22110v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Hani Abdelwahab",
      "Ivan Kaygorodov",
      "Roman Lubkov"
    ],
    "title": "The algebraic and geometric classification of derived Jordan and bicommutative algebras",
    "abstract": "We developed a new proper method for classifying $n$-dimensional derived Jordan algebras, and apply it to the classification of $3$-dimensional derived Jordan algebras. As a byproduct, we have the algebraic classification of $3$-dimensional metabelian commutative algebras and $3$-dimensional derived commutative associative algebras. After that, we introduced a method of classifying $n$-dimensional bicommutative algebras, based on the classification of $n$-dimensional derived commutative associative algebras, and applied it to the classification of $3$-dimensional bicommutative algebras. The second part of the paper is dedicated to the geometric classification of $3$-dimensional metabelian commutative, derived commutative associative, derived Jordan and bicommutative algebras.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22067v1",
    "categories": [
      "math.GT",
      "math.GR"
    ],
    "authors": [
      "Balthazar Fléchelles",
      "Seunghoon Hwang"
    ],
    "title": "Projective reflection groups of finite covolume",
    "abstract": "We show that the Coxeter polytopes that have finite volume in their Vinberg domains are exactly the quasiperfect Coxeter polytopes of negative type, i.e. the Coxeter polytopes that are contained in their properly convex Vinberg domain, at the exception of some vertices that are C^1 points of the boundary. As a corollary, we show that for reflection groups à la Vinberg, the Vinberg domain is the only invariant properly convex domain if and only if the action is of finite covolume on the Vinberg domain and the dimension is at least 2.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22049v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Micael Said Garcia",
      "Cassia Ferreira Sampaio"
    ],
    "title": "On homogeneous involutions on matrix algebras",
    "abstract": "We study the homogeneous involutions on the full square matrices over an algebraically closed field endowed with a division grading with commutative support. We obtain the classification of the isomorphism and equivalence classes for the Pauli grading. We also investigate the homogeneous involutions on the full square matrices with entries in a finite-dimensional graded-division algebra over an algebraically closed field of characteristic not $2$ endowed with an arbitrary grading by an arbitrary group.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22023v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Juntao Wang",
      "Mei Wang",
      "William Zuluaga Botero"
    ],
    "title": "A categorical equivalence for monadic algebras of first-order substructural logics motivated by Kalman's construction",
    "abstract": "The category $\\mathbb{DRDL'}$, whose objects are c-differential residuated distributive lattices that satisfy the condition $\\mathbf{CK}$, is the image of the category $\\mathbb{RDL}$, whose objects are residuated distributive lattices, under the categorical equivalence (Kalman functor) $\\mathbf{K}$. The main goal of this paper is to lift this equivalence $\\mathbf{K}$ to the category $\\mathbb{MRDL}$, whose objects are monadic residuated distributive lattices, and the category $\\mathbb{MDRDL'}$, whose objects are pairs formed by an object of $\\mathbb{DRDL'}$ and a center universal quantifier. Firstly, based on the variety of monadic FL$_\\textrm{e}$-algebras, we introduce the concept of monadic residuated lattices and study some of their further algebraic properties, proving the classes of monadic residuated distributive lattices and monadic c-differential residuated distributive lattices are in one-to-one correspondence. Subsequently, based on this corresponding relation, we prove that there exists a categorical equivalence between the categories $\\mathbb{MRDL}$ and $\\mathbb{MDRDL'}$. The results of this paper not only generalizes the works of Sagastume and San Martín in [Mathematical Logic Quarterly, {\\bf 60}(2014), 375--388], but also addresses and overcomes the limitations identified in the works of [Studia Logica, {\\bf 111}(2023), 361--390]. Finally, this paper concludes with some applications regarding descriptions of a 2-contextual translation.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22017v1",
    "categories": [
      "math.QA",
      "math.CT",
      "math.RT"
    ],
    "authors": [
      "Azat M. Gainutdinov",
      "Robert Laugwitz"
    ],
    "title": "Fully exact and fully dualizable module categories",
    "abstract": "We define fully exact module categories, a subclass of exact module categories over a finite braided tensor category that is stable under the relative Deligne product. In contrast, we demonstrate with examples in both zero and non-zero characteristic of the base field that the class of exact module categories is not stable under this product. We also observe in examples that fully exact module categories form a dense subset in the class of exact ones.\n  The monoidal 2-category of fully exact module categories strictly contains those of invertible and separable module categories. In fact, we show that each internal algebra of a fully exact module category is projectively separable, a generalization of separable algebras involving projective objects. In the semisimple case, a module category is fully exact if and only if it is separable.\n  In general, fully exact module categories are not dualizable inside their class, but if they are, they are fully dualizable objects in the monoidal 2-category of finite module categories. We call such module categories perfect. We show that perfect module categories form a rigid monoidal 2-subcategory containing all fully dualizable objects. Therefore, we propose perfect module categories as a model for finite tensor 2-categories. If the braiding is symmetric, a module category is fully exact if and only if it is perfect.\n  As a detailed example, we classify fully exact, and hence perfect, module categories over the symmetric tensor category of modules over Sweedler's four-dimensional Hopf algebra and compute their relative Deligne products, and the categories of 1-morphisms. For a general quasi-triangular Hopf algebra, we analyze when the category of finite-dimensional vector spaces is fully exact. We show that this is not the case for both Sweedler's Hopf algebra and Lusztig's factorizable small quantum group of type $A_1$ at an odd root of unity.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21973v1",
    "categories": [
      "math.AG",
      "math.CO"
    ],
    "authors": [
      "Erin Dawson"
    ],
    "title": "Generalizations of tropical Tevelev degrees",
    "abstract": "We study tropical Tevelev degrees arising from maps between certain tropical moduli spaces of curves. Building on work of Dawson and Cavalieri, who defined and computed tropical Tevelev degrees in the case of degree $d = g+1$ and $n = g+3$ marked points, we extend the theory by introducing an additional integer parameter $\\ell$. In our framework the curve degree and number of marked points vary as $d = g + 1 + \\ell$ and $n = g + 3 + 2\\ell$, and we analyze the resulting tropical Tevelev degrees for both positive and negative values of $\\ell$. This tropicalizes results of Cela, Pandharipande, and Schmitt on algebraic Tevelev degrees. We then further broaden the framework by introducing generalized tropical Tevelev degrees, providing the tropical counterpart to the generalized Tevelev degrees studied by Cela and Lian. These results establish a wider set of computational and structural patterns for intersection calculations on tropical moduli spaces and reveal new behavior beyond the classical setting.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21962v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Lizzie Buchanan",
      "Tanushree Shah"
    ],
    "title": "A note on alternating knots in handlebodies",
    "abstract": "We establish a Kauffman-Murasugi-Thistlethwaite-type theorem for alternating knots in a solid torus. Specifically, we show that any dotted-reduced alternating diagram of a knot in a handlebody realizes the minimal crossing number, and that any two such diagrams of the same knot have identical writhe. The proof relies on a generalization of the Jones polynomial to the setting of handlebodies. A stronger version of this result was already proved by Boden, Karimi, and Sikora using a different generalized Jones polynomial; therefore, this text largely expands on one of the main proof tools.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21865v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Luana Ascoli",
      "Douglas D. Novaes"
    ],
    "title": "Growth estimate for the number of crossing limit cycles in planar piecewise polynomial vector fields",
    "abstract": "Motivated by the classical Hilbert's Sixteenth Problem, we extend some main developments obtained for Hilbert's number in the polynomial setting to the piecewise polynomial context. Specifically, we study the growth of the maximum number of crossing limit cycles in planar piecewise polynomial vector fields of degree $n$, denoted by $H_c(n)$. The best previously known general lower bound is $H_c(n)\\geq 2n - 1$. In this work, we show that $H_c(n)$ grows at least as fast as $n^2/4.$ Furthermore, we prove that $H_c(n)$ is strictly increasing whenever it is finite, and that in such cases this maximum can be realized by piecewise polynomial systems whose crossing limit cycles are all hyperbolic. Finally, for the more restrictive class of piecewise polynomial Hamiltonian vector fields, we adapt the recursive construction of Christopher and Lloyd to demonstrate that the corresponding maximal number of crossing limit cycles, denoted by $\\widehat{H}_c(n)$, grows at least as fast as $n\\log n/(2\\log 2)$, thereby improving previously established linear growth estimate.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21860v1",
    "categories": [
      "math.OC",
      "stat.ML"
    ],
    "authors": [
      "Nicole Tianjiao Yang"
    ],
    "title": "Pathwise Learning of Stochastic Dynamical Systems with Partial Observations",
    "abstract": "The reconstruction and inference of stochastic dynamical systems from data is a fundamental task in inverse problems and statistical learning. While surrogate modeling advances computational methods to approximate these dynamics, standard approaches typically require high-fidelity training data. In many practical settings, the data are indirectly observed through noisy and nonlinear measurement. The challenge lies not only in approximating the coefficients of the SDEs, but in simultaneously inferring the posterior updates given the observations. In this work, we present a neural path estimation approach to solve stochastic dynamical systems based on variational inference. We first derive a stochastic control problem that solve filtering posterior path measure corresponding to a pathwise Zakai equation. We then construct a generative model that maps the prior path measure to posterior measure through the controlled diffusion and the associated Randon-Nykodym derivative. Through an amortization of sample paths of the observation process, the control is learned by an embedding of the noisy observation paths. Thus, we learn the unknown prior SDE and the control can recover the conditional path measure given the observation sample paths and we learn an associated SDE which induces the same path measure. In the end, we perform experiments on nonlinear dynamical systems, demonstrating the model's ability to learn multimodal, chaotic, or high dimensional systems.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21849v1",
    "categories": [
      "math.DG",
      "math.CV"
    ],
    "authors": [
      "Anna Fino",
      "Gueo Grantcharov",
      "Asia Mainenti"
    ],
    "title": "$p$-Kähler structures on fibrations and reductive Lie groups",
    "abstract": "We investigate the existence of $p$-Kähler structures on two classes of complex manifolds: on quasi-regular fibrations, with particular emphasis on complex homogeneous spaces, and on reductive Lie groups endowed with invariant complex structures. In the latter setting, we construct non-regular complex structures on the Lie algebras $\\mathfrak{sl}(2m-1,\\mathbb{R})$ for $m \\ge 2$ and show that these structures admit compatible balanced metrics, providing new explicit examples of balanced manifolds.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21813v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Navnath Daundkar",
      "Abhishek Sarkar",
      "Ankur Sarkar"
    ],
    "title": "On sequential versions of various parametrized invariants",
    "abstract": "In this paper, we introduce and study sequential versions of several fibrewise homotopy invariants, including parametrized topological complexity, parametrized (subspace) homotopic distance. We investigate their basic properties, establish relationships among them, and compare them with the corresponding classical homotopical invariants.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21705v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Andi Bodnariu",
      "Nils Engler",
      "Neofytos Rodosthenous"
    ],
    "title": "Outrunning the Omega Clock: A Singular Control Problem for Dividend Optimisation with Ruin and Time-in-Distress Default",
    "abstract": "This paper extends the classical dividend problem by incorporating a novel, path-dependent mechanism of firm default. In the traditional framework, ruin occurs when the surplus process first reaches zero. In contrast, default in our model may also arise when the surplus spends an excessive amount of time below a distress threshold, even without ever hitting zero. This occupation-time-based default criterion captures financial distress more realistically, as prolonged periods of low liquidity or capitalisation may trigger regulatory intervention or operational failure. The resulting optimisation problem is formulated as a new singular stochastic control problem with discontinuous state-dependent discounting and killing. We provide a complete analytical solution via a bespoke sequential guess-and-verify method and identify three distinct classes of optimal dividend strategies corresponding to different parameter regimes of the dual-ruin structure. Notably, for certain distress thresholds, the optimal policy features disconnected action and inaction regions. We further show that, unlike in the classical dividend problem, higher effective discounting induced by occupation time below a distress level can lead to delayed, rather than earlier, dividend payments.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22148v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Daniel R Hawtin",
      "Padraig Ó Catháin"
    ],
    "title": "Symmetries of regular $q$-graphs",
    "abstract": "Given a finite vector space $V=\\mathbb{F}_q^n$, the $q$-analogue of a graph, called a $q$-graph, is a pair $Γ=(\\mathcal{V},\\mathcal{E})$, where $\\mathcal{V}$ is the set of $1$-dimensional subspaces of $V$ and $\\mathcal{E}$ is a subset of the $2$-dimensional subspaces of $V$. Elements of $\\mathcal{V}$ and $\\mathcal{E}$ are called vertices and edges, respectively. If the edges through a vertex $X$ consist of all $2$-spaces of a $(k+1)$-dimensional space which contain $X$, regardless of the choice of vertex, then $Γ$ is $k$-regular. Moreover, $Γ$ is flag-transitive if there is a subgroup of $Γ{\\rm L}_n(q)$ preserving $\\mathcal{E}$ and acting transitively on the set of all incident vertex-edge pairs; and symmetric if there is a subgroup of $Γ{\\rm L}_n(q)$ preserving $\\mathcal{E}$ and acting transitively on the set of all ordered pairs of adjacent vertices.\n  This paper classifies all $k$-regular $q$-graphs that are either flag-transitive or symmetric. The $q$-graphs in the classification are constructed from familiar objects in finite geometry, including spreads, symplectic polar spaces, and generalised hexagons. The classification depends essentially on the classification of transitive linear groups, and thus ultimately on the classification of finite simple groups.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22126v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "David Huckleberry Gutman",
      "George Lobo"
    ],
    "title": "An Invitation to Higher-Order Riemannian Optimization: Optimal and Implementable Methods",
    "abstract": "This paper presents the first optimal-rate $p$-th order methods with $p\\geq 1$ for finding first and second-order stationary points of non-convex smooth objective functions over Riemannian manifolds. In contrast to the geodesically convex setting, we definitively establish that the optimal oracle complexity of non-convex optimization over manifolds matches that over Euclidean space. In parallel with the complexity analysis, we introduce a general framework for systematically studying higher-order regularity on Riemannian manifolds that characterizes its joint dependence on the objective function and the chosen retraction. To the best of our knowledge, this framework constitutes the first known application in optimization of pullback connections and the Sasaki metric to the study of retraction-based pullbacks of the objective function. We provide clean derivative bounds based on a new covariant Faà di Bruno formula derived within our framework. For $p=3$, our methods are fully implementable via a new Krylov-based framework for minimizing quartically regularized cubic polynomials. This is the first Krylov method for this class of polynomials and may be of independent interest beyond Riemannian optimization.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22102v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Ernesto M. Greco",
      "Daniela Morale"
    ],
    "title": "Integrability properties and stochastic McKean-Vlasov dynamics with singular Lennard-Jones drift: a mesoscale regularization",
    "abstract": "We study the convergence of the empirical measure of moderately interacting particle systems subject to singular forces derived by Lennard-Jones potential. Although the classical Lennard-Jones force is widely used in molecular dynamics, analytical results are not available. We consider a Lennard-Jones potential with free parameters in the McKean-Vlasov framework and proceed with a regularization at the mesoscale letting the particles interact moderately. We prove the well-posedness of the McKean-Vlasov SDE involving such singular kernels and the convergence of the empirical measure towards the solution of the McKean-Vlasov Fokker-Planck PDE, by means of a semigroup approach. We derive both the range of parameters characterizing the aggregation and repulsive force and the mesoscale order for which the convergence is achieved, by obtaining the right integrability regularity of the drift.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.22042v1",
    "categories": [
      "math.HO",
      "math.MG"
    ],
    "authors": [
      "Saro Harutyunyan"
    ],
    "title": "Isogonal conjugation in isosceles tetrahedron",
    "abstract": "In this article we investigate the properties of isogonal conjugation in isosceles tetrahedron. Particularly we reveal three hyperbolic paraboloids each of which is formed by pairs of isogonal conjugate points symmetric in the respective bimedian, as well as we prove that the circumsphere of an isosceles tetrahedron is invariant under isogonal conjugation in that tetrahedron.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21958v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Cyril J. Jacob",
      "Ronnie Sebastian"
    ],
    "title": "Linear systems on rational surfaces",
    "abstract": "Motivated by various equivalent versions of the SHGH conjecture for $\\mathbb{P}^2$ blown up at very general points, we propose a similar conjecture for Hirzebruch surfaces. We prove that this conjecture is true for the Hirzebruch surface $\\mathbb{F}_e$ blown up at $r\\leqslant e+4$ very general points.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21917v1",
    "categories": [
      "math.OC",
      "cs.CC",
      "cs.LG",
      "math.NA",
      "stat.ML"
    ],
    "authors": [
      "Amir Ali Ahmadi",
      "Georgina Hall"
    ],
    "title": "On Approximate Computation of Critical Points",
    "abstract": "We show that computing even very coarse approximations of critical points is intractable for simple classes of nonconvex functions. More concretely, we prove that if there exists a polynomial-time algorithm that takes as input a polynomial in $n$ variables of constant degree (as low as three) and outputs a point whose gradient has Euclidean norm at most $2^n$ whenever the polynomial has a critical point, then P=NP. The algorithm is permitted to return an arbitrary point when no critical point exists. We also prove hardness results for approximate computation of critical points under additional structural assumptions, including settings in which existence and uniqueness of a critical point are guaranteed, the function is lower bounded, and approximation is measured in terms of distance to a critical point. Overall, our results stand in contrast to the commonly-held belief that, in nonconvex optimization, approximate computation of critical points is a tractable task.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21901v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Andrew R. Booker",
      "Omri Simon"
    ],
    "title": "A generalisation of the Euclid-Mullin sequences",
    "abstract": "We extend Mullin's prime-generating procedures to produce sequences of primes lying in given residue classes. In particular we study the sequences generated by cyclotomic polynomials $Φ_m(cx)$ for suitable $c\\in\\mathbb{Z}$. Under the Extended Riemann Hypothesis in general and unconditionally for some moduli, we show that the analogue of the second Euclid--Mullin sequence omits infinitely many primes $\\equiv1\\pmod{m}$. We further show unconditionally that at least one prime is omitted for infinitely many $m$. This generalises work of the first author for $m=1$ and the second author for $m=2^k$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21874v1",
    "categories": [
      "math.NA",
      "math.OC",
      "quant-ph"
    ],
    "authors": [
      "Bin Gao",
      "Renfeng Peng",
      "Ya-xiang Yuan"
    ],
    "title": "Quotient geometry of tensor ring decomposition",
    "abstract": "Differential geometries derived from tensor decompositions have been extensively studied and provided the foundations for a variety of efficient numerical methods. Despite the practical success of the tensor ring (TR) decomposition, its intrinsic geometry remains less understood, primarily due to the underlying ring structure and the resulting nontrivial gauge invariance. We establish the quotient geometry of TR decomposition by imposing full-rank conditions on all unfolding matrices of the core tensors and capturing the gauge invariance. Additionally, the results can be extended to the uniform TR decomposition, where all core tensors are identical. Numerical experiments validate the developed geometries via tensor ring completion tasks.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21859v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Sophie Taylor",
      "Praneeth Kumar Vippathalla",
      "Justin Coon"
    ],
    "title": "Adaptive Privacy of Sequential Data Releases Under Collusion",
    "abstract": "The fundamental trade-off between privacy and utility remains an active area of research. Our contribution is motivated by two observations. First, privacy mechanisms developed for one-time data release cannot straightforwardly be extended to sequential releases. Second, practical databases are likely to be useful to multiple distinct parties. Furthermore, we can not rule out the possibility of data sharing between parties. With utility in mind, we formulate a privacy-utility trade-off problem to adaptively tackle sequential data requests made by different, potentially colluding entities. We consider both expected distortion and mutual information as measures to quantify utility, and use mutual information to measure privacy. We assume an attack model whereby illicit data sharing, which we call collusion, can occur between data receivers. We develop an adaptive algorithm for data releases that makes use of a modified Blahut-Arimoto algorithm. We show that the resulting data releases are optimal when expected distortion quantifies utility, and locally optimal when mutual information quantifies utility. Finally, we discuss how our findings may extend to applications in machine learning.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21854v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Qi Lü",
      "Zhonghua Liao"
    ],
    "title": "Unique Continuation Property for Stochastic Wave Equations",
    "abstract": "This paper establishes a fundamental and surprising phenomenon in the theory of stochastic wave equations: the restoration of the unique continuation property (UCP) across characteristic hypersurfaces, a property that is known to fail generically in the deterministic setting. We prove that if a solution to a linear stochastic wave equation vanishes on one side of a characteristic surface $Γ$, then it must vanish in a full neighborhood of any point on $Γ$, provided the stochastic diffusion coefficient is non-degenerate. This result stands in sharp contrast to the classical Hörmander-type counterexamples for deterministic waves.\n  Furthermore, we extend the UCP to equations with non-homogeneous stochastic sources and establish a global unique continuation result from the interior of an arbitrarily narrow characteristic cone. Our proofs rely on a novel stochastic Carleman estimate, where the Itô diffusion term introduces a crucial positive energy contribution that is absent in deterministic models.\n  These findings demonstrate a qualitative difference between deterministic and stochastic hyperbolic dynamics and open new avenues for control theory and inverse problems in stochastic setting.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21850v1",
    "categories": [
      "math.RT",
      "math-ph",
      "math.QA"
    ],
    "authors": [
      "Dražen Adamović",
      "Boris Feigin",
      "Shigenori Nakatsuka"
    ],
    "title": "Center of the affine $\\mathfrak{gl}_{n|1}$ at the critical level and pseudo-differential operators",
    "abstract": "We prove that the center of the affine Lie algebra $\\widehat{\\mathfrak{gl}}_{n|1}$ at the critical level is generated by the coefficients in the expansion of the pseudo-differential operator $(\\partial_z-u_1(z))\\cdots (\\partial_z-u_n(z))(\\partial_z+u_{n+1}(z))^{-1}$ taking values in the Cartan subalgebra. This is an affine analogue of the Harish-Chandra isomorphism in the finite case.\n  The key ingredient of the proof is the identification of the center with the Heisenberg coset of the regular W-superalgebra of $\\mathfrak{gl}_{n|1}$ at the critical level, whose associated graded algebra is realized as the affine supersymmetric polynomials. Based on this, we derive a character formula for the center, which coincides with the generating function of plane partitions with a pit condition. We also prove that the Heisenberg coset at generic levels has a similar interpretation in terms of pseudo-differential operators that deform the one at the critical level.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21843v1",
    "categories": [
      "math.CT",
      "cs.LO",
      "math.LO"
    ],
    "authors": [
      "Tom de Jong",
      "Nicolai Kraus",
      "Axel Ljungström"
    ],
    "title": "The Leibniz adjunction in homotopy type theory, with an application to simplicial type theory",
    "abstract": "Simplicial type theory extends homotopy type theory and equips types with a notion of directed morphisms. A Segal type is defined to be a type in which these directed morphisms can be composed. We show that all higher coherences can be stated and derived if simplicial type theory is taken to be homotopy type theory with a postulated interval type. In technical terms, this means that if a type has unique fillers for $(2,1)$-horns, it has unique fillers for all inner $(n,k)$-horns. This generalizes a result of Riehl and Shulman for the case $n = 3, k \\in \\{1, 2\\}$. Our main technical tool is the Leibniz adjunction: the pushout-product is left adjoint to the pullback-hom in the wild category of types. While this adjunction is well known for ordinary categories, it is much more involved for higher categories, and the fact that it can be proved for the wild category of types (a higher category without stated higher coherences) is non-trivial. We make profitable use of the equivalence between the wild category of maps and that of families. We have formalized the results in Cubical Agda.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21836v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Marco Rando",
      "Samuel Vaiter"
    ],
    "title": "ZOBA: An Efficient Single-loop Zeroth-order Bilevel Optimization Algorithm",
    "abstract": "Bilevel optimization problems consist of minimizing a value function whose evaluation depends on the solution of an inner optimization problem. These problems are typically tackled using first-order methods that require computing the gradient of the value function ({\\it the hypergradient}). In several practical settings, however, first-order information is unavailable ({\\it zeroth-order setting}), rendering these methods inapplicable. Finite-difference methods provide an alternative by approximating hypergradients using function evaluations along a set of directions. Nevertheless, such surrogates are notoriously expensive, and existing finite-difference bilevel methods rely on two-loop algorithms that are poorly parallelizable. In this work, we propose ZOBA, the first finite-difference single-loop algorithm for bilevel optimization. Our method leverages finite-difference hypergradient approximations based on delayed information to eliminate the need for nested loops. We analyze the proposed algorithm and establish convergence rates in the non-convex setting, achieving a complexity of $\\mathcal{O}(p(d + p)^2\\varepsilon^{-2})$, where $p$ and $d$ denote the dimension of inner and outer spaces respectively, which is better than prior approaches based on Hessian approximation. We further introduce and analyze HF-ZOBA, a Hessian-free variant that yields additional complexity improvements. Finally, we corroborate our findings with numerical experiments on synthetic functions and a real-world black-box task in adversarial machine learning. Our results show that our methods achieve accuracy comparable to state-of-the-art techniques while requiring less computation time.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21834v1",
    "categories": [
      "math.RT",
      "math.GR"
    ],
    "authors": [
      "Tiberiu Coconet",
      "Constantin-Cosmin Todea"
    ],
    "title": "Reduction theorems for a conjecture on basis in source algebras of blocks of finite groups",
    "abstract": "The aim of this short research note is to present some results about a conjecture of Barker and Gelvin claiming that any source algebra of a block of a finite group has the unit group containing a basis stabilised by the left and right actions of the defect group. We obtain some reduction theorems for the existence of stable unital basis in source algebras of block algebras. Along the way we investigate this problem for the blocks of some finite simple groups.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21819v1",
    "categories": [
      "math.GR",
      "math.AC",
      "math.NT"
    ],
    "authors": [
      "Do Van Kien",
      "Pham Hung Quy"
    ],
    "title": "Frobenius numbers and the first Hilbert coefficients of certain numerical semigroup rings",
    "abstract": "Let $a,b$ be positive integers. In this note, we study the numerical semigroup $H=\\left<a,a+1,b\\right>$ and and the associated numerical semigroup ring $R=k[[H]]$. Under the certain conditions, we provide explicit formulas for the Frobenius number of $H$ and for the first Hilbert coefficient of $R$.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21799v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Daniel Kressner",
      "Peter Oehme"
    ],
    "title": "A novel Krylov subspace method for approximating Fréchet derivatives of large-scale matrix functions",
    "abstract": "We present a novel Krylov subspace method for approximating $L_f(A, E) \\vc{b}$, the matrix-vector product of the Fréchet derivative $L_f(A, E)$ of a large-scale matrix function $f(A)$ in direction $E$, a task that arises naturally in the sensitivity analysis of quantities involving matrix functions, such as centrality measures for networks. It also arises in the context of gradient-based methods for optimization problems that feature matrix functions, e.g., when fitting an evolution equation to an observed solution trajectory. In principle, the well-known identity \\[\n  f\\left( \\begin{bmatrix}\n  A & E \\\\ 0 & A\n  \\end{bmatrix} \\right) \\begin{bmatrix}\n  0 \\\\ \\vc{b}\n  \\end{bmatrix} = \\begin{bmatrix}\n  L_f(A, E) \\vc{b} \\\\ f(A) \\vc{b}\n  \\end{bmatrix}, \\] allows one to directly apply any standard Krylov subspace method, such as the Arnoldi algorithm, to address this task. However, this comes with the major disadvantage that the involved block triangular matrix has unfavorable spectral properties, which impede the convergence analysis and, to a certain extent, also the observed convergence. To avoid these difficulties, we propose a novel modification of the Arnoldi algorithm that aims at better preserving the block triangular structure. In turn, this allows one to bound the convergence of the modified method by the best polynomial approximation of the derivative $f^\\prime$ on the numerical range of $A$. Several numerical experiments illustrate our findings.",
    "date": "01-30"
  },
  {
    "link": "https://arxiv.org/pdf/2601.21764v1",
    "categories": [
      "math.NA",
      "math.OC"
    ],
    "authors": [
      "Olivier Bokanowski",
      "Carlos Esteve-Yagüe",
      "Richard Tsai"
    ],
    "title": "Solving Hamilton-Jacobi equations by minimizing residuals of monotone discretizations",
    "abstract": "We derive sufficient conditions under which residual minimization yields well-posed discrete solutions for nonlinear equations defined by monotone finite--difference discretizations. Our analysis is motivated by the challenge of solving fully nonlinear Hamilton--Jacobi (HJ) equations in high dimensions by means of a Neural Network, which is trained by minimizing residuals arising from monotone discretizations of the Hamiltonian. While classical theory ensures that consistency and monotonicity imply convergence to the viscosity solution, treating these discrete systems as optimization problems introduces new analytical hurdles: solvability and the uniqueness of local minima do not follow from monotonicity alone.\n  By establishing the well--posedness of these optimization--based solvers, our framework enables the adaptation of Level Set Methods to high--dimensional settings, unlocking new capabilities in applications such as high--dimensional segmentation and interface tracking. Finally, we observe that these arguments extend almost directly to degenerate elliptic or parabolic PDEs on graphs equipped with monotone graph Laplacians.",
    "date": "01-30"
  }
]