[
  {
    "link": "https://arxiv.org/pdf/2601.14908v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Haibin Chen",
      "Yixuan Chen",
      "Liqun Qi"
    ],
    "title": "Biquadratic Cauchy Tensors and Spherical Biquadratic Polynomial Programming",
    "abstract": "This paper addresses biquadratic polynomial programming (BPP), an NP-hard optimization problem closely related to biquadratic tensors. We first establish several necessary and sufficient conditions for the positive semi-definiteness and positive definiteness of biquadratic Cauchy tensors. Leveraging the structured properties of these tensors, we then prove that the BPP and its equivalent multilinear formulation share the same set of optimal solutions. This result allows us to establish the global sequence convergence of the proximal alternating minimization (PAM) algorithm via the Kurdyka- Lojasiewicz (KL) property, extending the analysis in [8]. Furthermore, by reformulating the equivalent multilinear problem as an unconstrained optimization model, we enable the analysis of its KL exponent and derive an explicit expression for the convergence rate of PAM. Finally, numerical experiments are conducted on both biquadratic Cauchy tensors and general biquadratic tensor instances to evaluate the efficiency, stability, and practical performance of the proposed algorithm.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14900v1",
    "categories": [
      "math.HO",
      "math.NT"
    ],
    "authors": [
      "Martin Klazar"
    ],
    "title": "Catalan's conjecture is Mihăilescu's theorem",
    "abstract": "This text evolves from the lecture notes for my course on Catalan's conjecture in winter term 2025/26. The ultimate goal is to give full details of Mihăilescu's proof. Current chapters: 1. Euler's theorem: $x^2-y^3=1$; 2. V. Lebesgue's theorem: $x^m-y^2=1$; 3. Chao Ko's theorem: $x^2-y^q=1$ with $q\\ge5$; 4. Two relations of Cassels: $p\\,|\\,y$ and $q\\,|\\,x$; 5. Mihăilescu's theorem: $x^p-y^q=1$ with $p>q>2$; 6. An obstruction group; 7. Super-Cassels relations: $p^2\\,|\\,y$ and $q^2\\,|\\,x$; 8. Theorem M4: $p=3,5$ or $q=3,5$; A Results from mathematical anlysis; and B Results from algebra.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14890v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Ahmed Saoudi"
    ],
    "title": "Quadratic-Phase Fourier--Bessel Transform: definitions, properties and uncertainty principles",
    "abstract": "In this manuscript, we introduce the quadratic--phase Fourier--Bessel transform and develop its foundational properties, including continuity, the Riemann--Lebesgue lemma, reversibility, and Parseval's identity. We define the associated translation operator and convolution product, establishing their main properties within this framework. As an application, we prove a Donoho-Stark-type uncertainty principle for the quadratic-phase Fourier--Bessel transform, extending classical uncertainty results to this generalized setting.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14872v1",
    "categories": [
      "math.ST",
      "cs.LG",
      "stat.ME",
      "stat.ML"
    ],
    "authors": [
      "Hirofumi Ota",
      "Masaaki Imaizumi"
    ],
    "title": "Finite-Sample Inference for Sparsely Permuted Linear Regression",
    "abstract": "We study a noisy linear observation model with an unknown permutation called permuted/shuffled linear regression, where responses and covariates are mismatched and the permutation forms a discrete, factorial-size parameter. This unknown permutation is a key component of the data-generating process, yet its statistical investigation remains challenging due to its discrete nature. In this study, we develop a general statistical inference framework on the permutation and regression coefficients. First, we introduce a localization step that reduces the permutation space to a small candidate set building on recent advances in the repro samples method, whose miscoverage decays polynomially with the number of Monte Carlo samples. Then, based on this localized set, we provide statistical inference procedures: a conditional Monte Carlo test of permutation structures with valid finite-sample Type-I error control. We also develop coefficient inference that remains valid under alignment uncertainty of permutations. For computational purposes, we develop a linear assignment problem computable in polynomial time complexity and demonstrate that its solution asymptotically converges to that of the conventional least squares problem with large computational cost. Extensions to partially permuted designs and ridge regularization are also discussed. Extensive simulations and an application to Beijing air-quality data corroborate finite-sample validity, strong power to detect mismatches, and practical scalability.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14858v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Rohit Sunil Kanchi",
      "Sicheng He"
    ],
    "title": "Modal-Centric Field Inversion via Differentiable Proper Orthogonal Decomposition",
    "abstract": "Inverse problems in computational physics often require matching high-dimensional spatio-temporal fields, leading to prohibitive computational costs and ill-conditioned optimizations. We introduce modal-centric field inversion (MCFI), a paradigm that reformulates inverse problems in the reduced space of proper orthogonal decomposition (POD) modes rather than the full physical state space. By targeting dominant flow structures instead of point-wise field values, MCFI provides a compact, physically meaningful objective that naturally regularizes the inversion and dramatically reduces computational burden. Central to this framework is the differentiable POD: an adjoint-based method that efficiently computes sensitivities of POD modes with respect to model parameters, enabling gradient-based optimization in the modal space. We demonstrate MCFI on a one and two-dimensional modified viscous Burger's equation, optimizing spatially varying coefficients to match target dynamics through mode-matching. The adjoint formulation achieves computational cost independent of parameter dimension, in contrast to finite-difference approaches that scale linearly. MCFI establishes a foundation for scalable inverse design and model calibration in unsteady, high-dimensional systems.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14835v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Andrew Beveridge",
      "Ian Calaway"
    ],
    "title": "Approval Ballot Triangles and Strict-Sense Ballots",
    "abstract": "We consider a family of binary triangular arrays, called approval ballot triangles (ABTs), that are in bijection with totally symmetric self-complementary plane partitions (TSSCPPs). These triangles correspond to a ballot process in which voters select their collection of approved candidates rather than voting for a single person. We situate ABTs within the ballot problem literature and then show that a strict-sense ballot can be decomposed into a list of sequentially compatible ABTs.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14521v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Jean-Christophe Pain"
    ],
    "title": "Generalized relations between arithmetic functions",
    "abstract": "The aim of this article is to present in a self-contained way identities arising in elementary number theory, among which the following one: $$ \\sum_{d\\mid n}\\frac{μ^2(d)}{\\varphi(d)\\,d^s}=\\prod_{p\\mid n}\\left(1+\\frac{1}{(p-1)p^s}\\right). $$ This formula expresses a non-trivial divisor sum involving the Möbius function $μ$ and Euler's totient function $\\varphi$ as a simple and explicit multiplicative expression. This is a generalization of the remarkable Dineva formula, which corresponds to $s=0$ and gives $n/\\varphi(n)$ on the right-hand side. We explain why only squarefree divisors are involved, show how multiplicativity naturally comes into play, and interpret the identity as a finite Euler product. Beyond this one-parameter family of generalizations, we describe a general method for constructing similar formulas and present several examples. Finally, we reformulate these identities in terms of partial zeta functions, thus emphasizing their close relationship with the classical theory of Euler products and the Riemann zeta function. The connection with the Selberg sieve is briefly outlined.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14494v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Mohamed Omar"
    ],
    "title": "New Perspectives On The Unimodality Of Domination Polynomials",
    "abstract": "The domination polynomial of a graph $G$ is given by $D(G,x)=\\sum_{k=0}^{n} d_k(G)x^k$ where $d_k(G)$ records the number of $k$-element dominating sets in $G$. A conjecture of Alikhani and Peng asserts that these polynomials have unimodal coefficient sequences. We develop three complementary perspectives that strengthen existing tools for resolving the conjecture. First, we view dominating sets as transversals of the closed neighborhood hypergraph. Motivated by the relationship between the unimodality of a polynomial and its roots, we use this perspective to expand on known root phenomena for domination polynomials. In particular, we obtain a bound on the modulus of domination roots that is linear in the maximum degree of a graph, improving related exponential bounds of Bencs, Csikvári and Regts. The hypergraph viewpoint also yields explicit combinatorial formulas for top coefficients of $D(G,x)$, extending formulas in the literature and offering fruitful ground for combinatorial approaches to the unimodality conjecture. Second, we strengthen the coefficient-ratio method of Beaton and Brown. This includes tightening their inequalities, and combining a union bound for non-dominating $k$-element sets with an overlap correction based on spanning trees. This produces a new parameter $τ_k(G)$ measuring maximal pairwise neighborhood overlap and yields an overlap-corrected sufficient criterion for unimodality. Third, we prove that the domination polynomial of threshold graphs are log-concave, and hence unimodal, by a planar network argument from total positivity. This offers a new tactic for resolving the unimodality of hereditary graph classes.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14486v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Yizhe Zhu"
    ],
    "title": "Homeomorphic Extensions in Bi-Orlicz-Sobolev Spaces",
    "abstract": "We provide a complete characterization of those self-homeomorphisms of the unit circle that admit homeomorphic extensions to the unit disk belonging to bi--Orlicz--Sobolev spaces. Our results generalize classical criteria from the Sobolev setting to the more flexible Orlicz framework.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14482v1",
    "categories": [
      "math.CO",
      "math.AT"
    ],
    "authors": [
      "Daniela Egas Santander",
      "Matteo Santoro",
      "Jason P. Smith"
    ],
    "title": "Linear extensions and directed clique counts via modular partitions",
    "abstract": "Counting linear extensions is a fundamental problem in poset theory. It is known to be #P-complete, with polynomial-time formulas available in special cases. In this work, we develop new recursive formulas for counting linear extensions of posets whose modular partitions have particular structure. Specifically, we focus on posets whose incomparability graph has a modular partition with a skeleton that is a tree, a necklace of cliques, or a combination of both. The proofs are constructive and allow for the explicit generation of all linear extensions. We also discuss equivalent formulations of the problem in terms of permutations and directed graphs. The directed graph perspective is related to counting directed simplices in the directed flag complex of a digraph, with applications to understanding higher-order structure in neural circuits.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14461v1",
    "categories": [
      "math.NA",
      "physics.comp-ph"
    ],
    "authors": [
      "Lukas Netterdon",
      "Veronica Montanaro",
      "Manuel Torrilhon",
      "Hossein Gorji"
    ],
    "title": "Variance Reduction in the Fokker-Planck Particle Method for Rarefied Gases using Quasi-Random Numbers",
    "abstract": "The Fokker-Planck (FP) particle method accelerates rarefied-gas simulations by replacing the binary collisions of the commonly used Direct Simulation Monte Carlo (DSMC) method with a drift=diffusion process. Like all particle methods, the FP method is inherently stochastic, which leads to statistical fluctuations in macroscopic quantities and necessitates large particle numbers for accurate results. In this work, we investigate the use of quasi-random numbers, which sample distributions more evenly and thereby reduce the variance. To preserve the low-discrepancy structure across time steps, we employ the Array Randomized Quasi-Monte Carlo (Array-RQMC) technique. We combine the FP method with Array-RQMC and compare it in homogeneous and inhomogeneous problems with other commonly used variance-reduction techniques. The proposed FP-Array-RQMC approach achieves improved convergence rates compared with pseudo-random sampling and yields smaller estimator errors for sufficiently large particle numbers.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14428v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Andrea Di Primio",
      "Christoph Hurm"
    ],
    "title": "The stochastic nonlocal Cahn-Hilliard equation with regular potential and multiplicative noise",
    "abstract": "In this work, we deal with the stochastic counterpart of the nonlocal Cahn-Hilliard equation with regular potential in a smooth bounded two- or three-dimensional domain. The problem is endowed with homogeneous Neumann boundary conditions and random initial data. Furthermore, the system is driven by cylindrical noise of multiplicative type. For the resulting system, we are able to show the existence of probabilistically-weak (or martingale) solutions in two and three dimensions, that are unique and probabilistically-strong under suitable assumptions on the stochastic diffusion. Moreover, we investigate the nonlocal-to-local asymptotics toward solutions of the local stochastic Cahn-Hilliard equations, establishing, under regularity conditions, a precise rate of convergence as well.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14411v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Larry Guth",
      "Hong Wang",
      "Joshua Zahl"
    ],
    "title": "A streamlined proof of the Kakeya set conjecture in $\\mathbb{R}^3$",
    "abstract": "We present a streamlined and simplified proof of the Kakeya set conjecture in $\\mathbb{R}^3$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14320v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Stefan Schoder"
    ],
    "title": "Convergence of finite element right-hand-side computation from finite difference data",
    "abstract": "This work presents two integration methods for field transfer in computational aeroacoustics and in coupled field problems, using the finite element method to solve the acoustic field. Firstly, a high-order Gaussian quadrature computes the finite element right-hand side. In contrast, the (flow) field provided by the finite difference mesh is mapped by higher-order B-Splines or a Lagrangian function. Secondly, the cut-cell or supermesh integration with geometric clipping. For each method, the accuracy, performance characteristics, and computational complexity are analyzed. As a reference, the trapezoidal integration rule was computed from the finite difference results. The high-order quadrature converges as the B-Spline interpolation order increases, and the finite difference results and mesh resolutions are consistent. The supermesh approach eliminates interpolation and approximation errors at the grid-to-mesh level and improves accuracy. This behaviour is universal for smooth or strongly oscillating field quantities, which will be shown in a comparative study between the Lighthill-like source term and the source term of the perturbed convective wave equation for subsonic flows.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14755v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Lei Xie",
      "Peilan Wang",
      "Guanxiong Shen",
      "Guyue Li",
      "Weidong Mei",
      "Liquan Chen"
    ],
    "title": "Secure Communication in MIMOME Movable-Antenna Systems with Statistical Eavesdropper CSI",
    "abstract": "This paper investigates the potential of movable antennas (MAs) to enhance physical layer security within a multiple-input multiple-output multiple-antenna eavesdropper (MIMOME) system. We consider a practical scenario where the transmitter operates with imperfect eavesdropper channel state information (ECSI), knowing only the instantaneous line-of-sight (LoS) component and the statistical properties of non-line-of-sight (NLoS) component. To rigorously quantify secrecy performance under the ECSI uncertainty, we adopt the ergodic secrecy rate (ESR) as the metric. Since deriving an exact analytical expression for the ESR is intractable, we leverage random matrix theory to derive a deterministic equivalent. This avoids heavy Monte Carlo simulations and also provides explicit insights into the effects of channel spatial statistics on secrecy performance. Building upon the deterministic equivalent, we formulate a joint maximization problem for the transmit precoding matrix and the antenna positions at the legitimate transmitter. To tackle the non-convexity of this optimization problem, we develop a comprehensive alternating optimization framework. Specifically, the precoding matrix is optimized via a majorization-minimization (MM) algorithm, where the gradient is computed by solving an implicit fixed-point equation. For the antenna position optimization, the complexity of the objective function prevents the construction of standard MM surrogate. To this end, we further propose a novel AMSGrad-based surrogate function that relies solely on gradient information. We provide a rigorous theoretical proof that guarantees the convergence of this proposed algorithm despite relaxing the strict majorization conditions.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14659v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Guanghan Li",
      "Chenyang Liu"
    ],
    "title": "Capillary Orlicz-Minkowski flow in the upper half-space",
    "abstract": "In this paper, we study the long-time existence and asymptotic behavior of an anisotropic capillary Gauss curvature flow. By studying this flow and proving its convergence to a stationary solution, we establish a new existence result for the capillary Orlicz-Minkowski problem without the evenness assumption, and provide a flow approach to the existence of smooth solutions.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14623v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Canran Wang",
      "Minghui Liwang",
      "Netanel Raviv"
    ],
    "title": "Break-Resilient Codes with Loss Tolerance",
    "abstract": "Emerging applications in manufacturing, wireless communication, and molecular data storage require robust coding schemes that remain effective under physical distortions where codewords may be arbitrarily fragmented and partially missing. To address such challenges, we propose a new family of error-correcting codes, termed $(t,s)$-break-resilient codes ($(t,s)$-BRCs). A $(t,s)$-BRC guarantees correct decoding of the original message even after up to~$t$ arbitrary breaks of the codeword and the complete loss of some fragments whose total length is at most~$s$. This model unifies and generalizes previous approaches, extending break-resilient codes (which handle arbitrary fragmentation without fragment loss) and deletion codes (which correct bit losses in unknown positions without fragmentation) into a single information-theoretic framework. We develop a theoretical foundation for $(t,s)$-BRCs, including a formal adversarial channel model, lower bounds on the necessary redundancy, and explicit code constructions that approach these bounds.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14592v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Nicholas Gismondi"
    ],
    "title": "Nontrivial integrable weak stationary solutions to active scalar equations with non-odd drift",
    "abstract": "In this paper we construct nontrivial weak solutions to a class of stationary active scalar equations with a non-odd nonlocal operator in the drift term using a convex integration scheme. We show our solutions lie in $$ \\bigcap_{0 < ε< 1} \\dot{B}^{-ε}_{\\infty,\\infty}(\\mathbb{T}^d) \\cap L^{2-ε}(\\mathbb{T}^d) $$ for $d \\geq 2$. The key ingredient of the construction is the use of highly oscillatory corrections with a variable degree of intermittency, which is arranged to decrease to zero at higher stages of the iteration procedure.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14581v1",
    "categories": [
      "math.AP",
      "math.CA",
      "math.DS"
    ],
    "authors": [
      "Philip Korman"
    ],
    "title": "Global solution curves in harmonic parameters, and multiplicity of solutions",
    "abstract": "\\[ Δu+g(u)=f(x) \\s \\mbox{for $x \\in Ω$}, \\s u=0 \\s \\mbox{on $\\partial Ω$} \\] decompose $f(x)=μ_1 \\p _1+e(x)$, where $\\p _1$ is the principal eigenfunction of the Laplacian with zero boundary conditions, and $e(x) \\perp \\p _1$ in $L^2(Ω)$, and similarly write $u(x)= ξ_1 \\p _i+U (x)$, with $ U \\perp \\p _1$ in $L^2(Ω)$. We study properties of the solution curve $(u(x),μ_1)(ξ_1)$, and in particular its section $μ_1=μ_1(ξ_1)$, which governs the multiplicity of solutions. We consider both general nonlinearities, and some important classes of equations, and obtain detailed description of solution curves under the assumption $g'(u)<\\la _2$. We obtain particularly detailed results in case of one dimension. This approach is well suited for numerical computations, which we perform to illustrate our results.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14575v1",
    "categories": [
      "math.DG",
      "math.SP"
    ],
    "authors": [
      "Mohammadjavad Habibivostakolaei"
    ],
    "title": "Quantitative Spectral Stability for an Embedded Annulus under Coupled Curve Shortening and $2$D Ricci Flows",
    "abstract": "We study the spectral stability of Dirichlet eigenvalues on an embedded annulus whose boundary evolves by curve shortening flow while the ambient surface evolves under the two dimensional Ricci flow using variational formulas, Rellich--type identities, and harmonic capacity methods, we relate eigenvalue variations to geometric deficit and modulus. We establish quantitative bounds comparing the spectrum of the evolving annulus with that of a flat cylinder of equal modulus. As a consequence, we obtain geometric stability and a spectral gap estimate controlled by the deficit functional.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14909v1",
    "categories": [
      "math.PR",
      "math.CO",
      "math.CV",
      "math.DG",
      "math.GT"
    ],
    "authors": [
      "Huabin Ge",
      "Yangxiang Lu",
      "Chuwen Wang",
      "Tian Zhou"
    ],
    "title": "Random infinite ideal angled graphs and ideal hyperbolic polyhedra",
    "abstract": "This article aims to develop the uniformization and boundary theory of random infinite ideal hyperbolic polyhedra (abbr. IHP) and their dual 1-skeleton, i.e., ideal angled graphs (abbr. IAG) from multiple perspectives, including combinatorics, geometry, analysis and random walks. For unimodular random IAG, we establish an ICP analog of the dichotomy theorem of Angel-Hutchcroft-Nachmias-Ray [4,5]. Specifically, the character $T(ρ):=\\sum_{e\\niρ}Θ_e$ of an IAG, introduced in [40], determines its ICP type: the graph is a.s. ICP-parabolic if and only if $\\mathbb{E}[T(ρ)]=2π$. In the ICP-hyperbolic case, the simple random walk converges a.s. to $\\partial\\mathbb{D}$ with positive hyperbolic speed. Moreover, the geometric, Poisson, Martin, and Gromov boundaries coincide, extending the boundary theory of Angel-Barlow-Gurevich-Nachmias [3] and Hutchcroft-Peres [37] beyond triangulations to cellular decompositions. As a corollary of the aforementioned IHP/IAG duality, we obtain the systematic characterizations of the random IHP. To develop our theory, we strengthen and refine the Ring Lemma of Ge-Yu-Zhou [27] for ICP, which provides quantitative local control of the packing geometry. This key estimate makes it possible to extend the boundary theory beyond triangulations.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14873v1",
    "categories": [
      "math.OA",
      "math.FA"
    ],
    "authors": [
      "Youssef El Khatiri"
    ],
    "title": "Order isomorphisms in $C^*$-algebras",
    "abstract": "We provide a complete description of the order isomorphisms between the self-adjoint parts of $C^*$-algebras. Furthermore, we characterize such isomorphisms between general operator intervals in $AW^*$-algebras. For the description, we use Jordan $^*$-isomorphisms and closed operators in the regular rings of $AW^{*}$-algebras. This work generalizes previous results on von Neumann algebras.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14853v1",
    "categories": [
      "math.HO"
    ],
    "authors": [
      "Alexis Gautreau"
    ],
    "title": "Que révèle l'activité de validation de démonstration circulaire sur la compréhension de démonstration",
    "abstract": "This communication contributes to research on proof validation as a lens for uncovering didactical phenomena related to proof and proving. We revisit the puzzling case of lower secondary students in France who validate circular proofs. That is proofs in which the conclusion is used within a step of the proof itself. While these 12--13-year-old students accurately identify the final statement of such proofs as a reformulation of the conclusion of the claim, they encounter difficulties in interpreting how the condition of the claim is taken up within the proof. Our analysis challenges Miyazaki and al.'s interpretation of this phenomenon, which attributes students' acceptation of the validity of circular reasoning to a misunderstanding of modus ponens when there are two in a row. Instead, we propose an alternative explanation grounded in the distinction between the operative and theoretical statuses of mathematical propositions. This distinction provides both a theoretical rationale for the invalidity of circular proofs and a didactical tool for examining students' argumentative activity when they attempt to reject such proofs.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14843v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Endre Sørmo Rundsveen"
    ],
    "title": "A note on the $m$-extended module categories of Nakayama algebras",
    "abstract": "We study the extended module category $m\\operatorname{-mod}Λ$ of an algebra $Λ$, recently introduced by Gupta and Zhou. The existence of a postprojective component of $m\\operatorname{-mod}Λ$ is shown for certain algebras $Λ$, and a knitting algorithm through cohomological dimension vectors is provided.\n  In particular, the extended module category of Nakayama algebras with homogeneous relations are investigated, and it is classified when they are of finite type. The paper give fully calculated AR-quivers for several Nakayama algebras.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14838v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "M. Alwohaibi",
      "D. Alsaleh",
      "M. El-Beltagy",
      "M. Majdoub",
      "E. Mliki"
    ],
    "title": "Mild Solutions for Time--Fractional Stochastic Nonlocal Diffusion Equations",
    "abstract": "We study a time--space nonlocal diffusion equation driven by additive time--space white noise, where the time derivative is the Caputo derivative of order $α\\in(0,2)$. The model couples local diffusion with a nonlocal convolution operator generated by a radial probability density, thus incorporating memory effects and long-range spatial interactions.\n  For Dirac initial data, we derive an explicit solution formula in the space of tempered distributions, decomposing the solution into a deterministic part and a stochastic convolution kernel expressed through Mittag--Leffler functions. Our main contribution is a sharp characterization of the existence of mild solutions in terms of $α$, the spatial dimension $N$, and the coefficients of the local and nonlocal diffusion terms. In particular, when the Laplacian term is absent, no mild solution exists, whereas for $λ>0$ the admissible regimes depend critically on $(α,N)$, extending and sharpening the known results for purely local fractional stochastic heat equations. Numerical simulations illustrate the evolution of the mean and variance and emphasize subdiffusive spreading and memory effects.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14819v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "José Niño-Mora"
    ],
    "title": "A fast-pivoting algorithm for Whittle's restless bandit index",
    "abstract": "The Whittle index for restless bandits (two-action semi-Markov decision processes) provides an intuitively appealing optimal policy for controlling a single generic project that can be active (engaged) or passive (rested) at each decision epoch, and which can change state while passive. It further provides a practical heuristic priority-index policy for the computationally intractable multi-armed restless bandit problem, which has been widely applied over the last three decades in multifarious settings, yet mostly restricted to project models with a one-dimensional state. This is due in part to the difficulty of establishing indexability (existence of the index) and of computing the index for projects with large state spaces. This paper draws on the author's prior results on sufficient indexability conditions and an adaptive-greedy algorithmic scheme for restless bandits to obtain a new fast-pivoting algorithm that computes the $n$ Whittle index values of an $n$-state restless bandit by performing, after an initialization stage, $n$ steps that entail $(2/3) n^3 + O(n^2)$ arithmetic operations. This algorithm also draws on the parametric simplex method, and is based on elucidating the pattern of parametric simplex tableaux, which allows to exploit special structure to substantially simplify and reduce the complexity of simplex pivoting steps. A numerical study demonstrates substantial runtime speed-ups versus alternative algorithms.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14813v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Jule Schindler",
      "Emil Wiedemann"
    ],
    "title": "The Nonlocal-to-Local Limit for the Inviscid Leray-α Equations",
    "abstract": "We consider the inviscid Leray-$α$ equations - an inviscid nonlocal regularisation of the Euler equations. In the first part, we prove the convergence of strong solutions of the Leray-$α$ equations to strong solutions of the Euler equations in $H^s(\\mathbb{R}^d)$ for $s>d/2 +1 $, $d\\in \\{2,3\\}$, for a large class of regularising kernels. In the second part, we consider weak solutions on a bounded domain with a local scaling property far away from the boundary. The scaling relates to second-order structure functions from turbulence theory and does not imply regularity. Nonetheless, under these assumptions, the weak solutions converge to (possibly wild) weak solutions of Euler in $L^2$ for almost every $t$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14806v1",
    "categories": [
      "math.AP",
      "physics.flu-dyn"
    ],
    "authors": [
      "Dongfen Bian",
      "Emmanuel Grenier",
      "Gérard Iooss",
      "Zhuolun Yang"
    ],
    "title": "Couette Taylor instabilities in the small-gap regime",
    "abstract": "The Couette-Taylor instability occurs in a viscous fluid confined between two coaxial rotating cylinders. When the Taylor number surpasses a critical value, the stable Couette flow destabilizes, giving way to steady Taylor vortices. As the Taylor number increases further, these vortices themselves become unstable, transitioning into wavy Taylor vortices.\n  In this article, we focus on the small-gap limit, where the ratio of the cylinder radii approaches unity and the rotation rates of the cylinders are nearly identical. We provide a rigorous proof of the existence of a critical Taylor number $T_c$, at which the Couette flow loses stability.\n  For Taylor numbers just above $T_c$, under fixed axial periodicity, the solutions to the limiting Navier-Stokes system are governed by a Ginzburg-Landau-type partial differential equation. Beyond the classical Taylor vortex flow, we demonstrate that a two-parameter family of solutions emerges at criticality for $T>T_c$. This family includes not only wavy vortices but also a variety of other exotic flow patterns, all of which remain steady in the frame rotating at the average angular velocity of the cylinders.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14462v1",
    "categories": [
      "math.CV",
      "math.DS"
    ],
    "authors": [
      "Mario Bonk",
      "Mikhail Hlushchanka",
      "Daniel Meyer"
    ],
    "title": "Quasi-visual approximations",
    "abstract": "We develop the foundations of the theory of quasi-visual approximations of bounded metric spaces. Roughly speaking, these are sequences of covers of a given space for which the diameters of the sets in the covers shrink to zero and for which relative metric quantities (such as ratios of diameters and distances) are uniformly controlled. This framework has applications to questions in quasiconformal geometry. In particular, quasi-visual approximations can be used to detect whether a given homeomorphism between two bounded metric spaces is a quasisymmetry.\n  We also explore the connection to the theory of Gromov hyperbolic spaces via the tile graph associated with a quasi-visual approximation. As an application, we relate these ideas to the dynamics of semi-hyperbolic rational maps. More specifically, we show that the Julia set of a rational map admits a dynamical quasi-visual approximation if and only if the map is semi-hyperbolic.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14447v1",
    "categories": [
      "math.CO",
      "math.MG"
    ],
    "authors": [
      "Amnon Rosenmann"
    ],
    "title": "Tropical balls, geodesics and honeycomb",
    "abstract": "We study the geometry of tropical balls in $\\mathbb{R}^n$ equipped with the tropical metric introduced by Cohen, Gaubert and Quadrat, an additive form of Hilbert's projective metric. After defining the tropical length of rectifiable curves, we formulate tropical geodesics in $\\mathbb{R}^n$ and then characterize compact tropically geodesic sets in $\\mathbb{R}^n$. Next, we present several equivalent descriptions of the tropical unit ball: as a zonotope (Minkowski sum of tropical unit segments), via its tropical generating set, as a union of $n+1$ tropical unit hypercubes, and as the tropical geodesic hull of the tropical unit vectors. Finally, we give an explicit proof that translates of the tropical unit ball whose centers lie in a sublattice of $\\mathbb{Z}^n$ form a facet-to-facet honeycomb tiling of $\\mathbb{R}^n$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14419v1",
    "categories": [
      "math.RT",
      "math.GR"
    ],
    "authors": [
      "Egor Voronetsky"
    ],
    "title": "Weyl elements in isotropic reductive groups",
    "abstract": "We study Weyl elements in isotropic reductive groups over commutative rings. Our main result in an explicit formula for squares of such elements.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14418v1",
    "categories": [
      "math.DS",
      "math.CO"
    ],
    "authors": [
      "Zhuowen Guo",
      "Kangbo Ouyang",
      "Jiahao Qiu",
      "Shuhao Zhang"
    ],
    "title": "Fractal transference principles for subsets of $\\mathbb{N}^d$ of positive density",
    "abstract": "We establish a multidimensional fractal transference principle for digit-restricted sets associated with subsets of $\\mathbb{N}^d$, extending the one-dimensional framework of Nakajima--Takahasi, Adv. Math. (2025). We develop general Hausdorff-dimension tools via the singular value potential $φ^s(\\mathbf a)$ and the multivariate Dirichlet series $ζ_S(\\boldsymbolσ) =\\sum_{\\mathbf a\\in S}\\prod_{j=1}^d a_j^{-σ_j}$. Let $s_\\ast:=\\inf\\{s>0:\\sum_{\\mathbf a\\in S}φ^s(\\mathbf a)<\\infty\\}$ and $Λ_S:=\\inf\\{σ_1+\\cdots+σ_d:ζ_S(\\boldsymbolσ)<\\infty\\}$. We obtain $\\dim_H(\\mathcal E_S)\\le s_\\ast$, where $\\mathcal E_S\\subset(0,1)^d$ denotes the set of points whose continued-fraction digit vectors lie in $S$ and whose coordinates escape (i.e.\\ $a_n(x_j)\\to\\infty$ for each $j$), and $s_\\ast=\\tfrac12Λ_S$ for uniformly $K$--balanced $S$. In particular, if $S\\subset\\mathbb{N}^d$ has positive upper (or upper Banach) density then $\\dim_H(\\mathcal E_S)=d/2$. On the combinatorial side, the transference principle ensures that translation-invariant configurations forced at positive density, including multidimensional Szemerédi patterns, persist inside the induced fractal digit sets.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14405v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Mathias Dauphin",
      "Daniele A. Di Pietro",
      "Jérôme Droniou",
      "Alexandros Skouras"
    ],
    "title": "A low-order hybrid method for the variable-density incompressible Navier-Stokes equations",
    "abstract": "In this work we introduce and analyse a new low-order method for the variable-density incompressible Navier-Stokes equations. The main novelty of the proposed method lies in the support of general meshes, possibly including polygonal or polyhedral elements as well as non-matching interfaces. We carry out a complete analysis, showing stability, existence and uniqueness of a discrete solution, and convergence of the latter to a suitably defined weak solution of the continuous problem. Numerical tests validate the theoretical results.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14317v1",
    "categories": [
      "math.MG"
    ],
    "authors": [
      "Horst Martini",
      "Pedro Martín",
      "Margarita Spirova"
    ],
    "title": "Chebyshev sets and ball operators",
    "abstract": "The Chebyshev set of a bounded set $K$ in a normed space is the set of centers of all minimal enclosing balls of $K$. We use the concept of ball intersection and ball hull operators to derive new properties of Chebyshev sets in normed spaces. These results give a better picture on how Chebyshev sets, ball intersections, ball hulls, and completions of bounded sets are related to each other. It is shown that the Chebyshev set of a bounded set $K$ always contains the Chebyshev set of some completion of $K$. Moreover, for a special class of sets we obtain a necessary and sufficient condition that the Chebyshev set of the respective set is a singleton. We obtain new results on critical sets of Chebyshev centers, and for that purpose, surprisingly, notions from the combinatorial geometry of convex bodies play an essential role. Also we give a complete geometric description of the ball hull of a finite planar set. This can be taken as starting point for algorithmical constructions of the ball hull of such sets.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14779v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Masaru Ikehata"
    ],
    "title": "Integrating the probe and singular sources methods: IV. IPS function for the Schrödinger equation",
    "abstract": "The integrated theory of the probe and singular sources methods (IPS) is developed for an inverse obstacle problem governed by the stationary Schrödinger equation in a bounded domain. The unknown obstacles are penetrable, and their surface is modeled by a part of the support of the potential in the governing equation. The main results concern an analytical detection method for these obstacles from the Dirichlet-to-Neumann map. They consist of three parts: a singular sources method via the probe method using a solution with higher-order singularity for the governing equation of the background medium; the discovery of an IPS function whose two ways of decomposition give us the indicator functions for both the probe and singular sources methods; a completely integrated version of both methods, which means their indicator functions coincide. Furthermore, a result on Side B of IPS is also given, concerning the blowing-up property of a sequence calculated from the Dirichlet-to-Neumann map.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14736v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Dan Comănescu"
    ],
    "title": "Existence and Stability of 3-Cycles in Quadratic Maps",
    "abstract": "For a discrete dynamical system on $\\R$ generated by a quadratic function, we show, using elementary computations, that the existence, number, and stability of 3-cycles are determined by a single parameter depending on the coefficients of the function.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14717v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Hunduma Legesse Geleta"
    ],
    "title": "The Effect of Planar Harmonic Mappings on the Lebesgue Measure of Sets",
    "abstract": "We investigate the effect of planar univalent harmonic mappings on the Lebesgue measure of measurable sets in the complex plane. Motivated by Problem 3.25 of Koh and Kovalev (HQM2010), we establish sharp quantitative area distortion inequalities for disks and for arbitrary measurable sets under sense-preserving harmonic self-maps of the unit disk. Using the area formula and the canonical decomposition of harmonic mappings, we derive bounds in terms of the Jacobian and the dilatation, and we identify rigidity phenomena characterizing equality. In particular, we prove global area contraction for disks, star-shaped sets, and sufficiently small sets, and we refine the results using Hardy space methods to obtain sharp bounds with equality only for conformal automorphisms. Extremal affine and non-affine examples illustrate the sharpness of our estimates. Our results provide a complete, rigorous, and strengthened solution to Problem 3.25 and highlight several natural conjectures on global area contraction, extremal distortion, and rigidity for harmonic mappings.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14709v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Irina Shatova"
    ],
    "title": "Brill--Noether Generality of Curves and K3 Surfaces",
    "abstract": "Lazarsfeld proved Brill--Noether generality of any smooth curve in the linear system $|H|$ where $(X,H)$ is a polarized K3 surface with $\\mathrm{Pic}(X) = \\mathbb{Z}\\cdot H$. Mukai introduced the notion of Brill--Noether generality for quasi-polarized K3 surfaces. We prove Brill--Noether generality of any smooth curve in the linear system $|H|$ where $(X,H)$ is a Brill--Noether general quasi-polarized K3 surface.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14668v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Mahiro Atsuta"
    ],
    "title": "On zeta elements and functional equations for Tate motives over totally real fields",
    "abstract": "In this paper, we study Iwasawa theory for Tate motives over totally real fields. More precisely, we construct a zeta element that interpolates the values of $L$-functions at positive integers over totally real fields under a certain unramified condition at $p$. As an application of this, we construct a canonical element in the exterior power bidual of the Galois cohomology group that is also related to the values of $L$-functions at positive integers.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14655v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Jiangrui Tan"
    ],
    "title": "Limit theorems for a supercritical multi-type branching process with immigration in a random environment",
    "abstract": "Let $\\{Z_n^i = (Z_n^i(r))_{1 \\le r \\le d}: n \\ge 0\\}$ be a supercritical $d$-type branching process in an i.i.d. environment $ξ= (ξ_0, ξ_1, \\dots)$, starting from a single particle of type $i$. The offspring distribution at generation $n$ depends on the environment $ξ_n$, and we denote by $M_n = (M_n(i,j))_{1 \\le i,j \\le d}$ the corresponding (random) mean matrix. Recently, Grama et al. (Ann. Appl. Probab. \\textbf{33}(2023) 1213-1251) extended the famous Kesten--Stigum theorem to the random environment case with $d>1$. They improved upon previous work by innovatively constructing a new normalized population process $(\\tilde{W}^i_n)$. Under several simple assumptions, they proved that $\\tilde{W}^i_n$ converges almost surely to a limit $\\tilde{W}^i$, and that $\\tilde{W}^i$ is non-degenerate if and only if a $\\mbb{E}X\\log^+ X<\\infty$ type condition holds.\n  In this paper, we study the situation where an immigrant vector $Y_n$ joins the population $Z_n^i$ at each generation $n \\ge 0$; the distribution of $Y_n$ also depends on the environment $ξ_n$. Following the approach of Grama et al., we construct a normalized process $(W^i_n)$ for the model with immigration, establishing a Kesten--Stigum type theorem that characterizes the non-degeneracy of its almost sure limit. Moreover, we provide complete $L^p$-convergence criteria for $(W^i_n)$, treating separately the cases $1 < p < \\infty$ and $0 < p < 1$. As an important byproduct, a sufficient condition for the boundedness of the maximal function $\\sup_n \\tilde{W}_n^i$ is also obtained. Our results show that, under a mild restriction on the number of immigrants, the inclusion of immigration does not affect the almost sure convergence property of the original normalized process, but it does have an impact on the criterion for $L^p$ convergence.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14621v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Keigo Takeuchi"
    ],
    "title": "Direct and Converse Theorems in Estimating Signals with Sublinear Sparsity",
    "abstract": "This paper addresses the estimation of signals with sublinear sparsity sent over the additive white Gaussian noise channel. This fundamental problem arises in designing denoisers used in message-passing algorithms for sublinear sparsity. The main results are direct and converse theorems in the sublinear sparsity limit, where the signal sparsity grows sublinearly in the signal dimension as the signal dimension tends to infinity. As a direct theorem, the maximum likelihood estimator is proved to achieve vanishing square error in the sublinear sparsity limit if the noise variance is smaller than a threshold. As a converse theorem, all estimators cannot achieve square errors smaller than the signal power under a mild condition if the noise variance is larger than another threshold. In particular, the two thresholds coincide with each other when non-zero signals have constant amplitude. These results imply the asymptotic optimality of an existing separable Bayesian estimator used in approximate message-passing for sublinear sparsity.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14504v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Francesc Castella",
      "Takamichi Sano"
    ],
    "title": "On refined nonvanishing conjectures by Kurihara and Kolyvagin",
    "abstract": "In this paper, we extend the results of \\cite{BCGS} on refined conjectures by Kurihara and Kolyvagin, allowing primes of any reduction type in the case of Kurihara's conjectures, and inert primes in the underlying imaginary quadratic field in the case of Kolyvagin's. The key innovation is a new approach to the computation of the $p$-divisibility index of certain special elements in Galois cohomology (the bottom class of a $Λ$-adic Euler system twisted by a character sufficiently close to the trivial character) based on a reformulation of the Iwasawa Main Conjectures in terms of determinants of Selmer complexes.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14451v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Pablo Barros",
      "Vincent Guigues",
      "Roger Behling",
      "Luiz-Rafael Santos"
    ],
    "title": "New operator designs for Halpern iterations with explicit rates under Hölder error bounds",
    "abstract": "We investigate the asymptotic behavior of Halpern-type iterations applied to quasi-nonexpansive operators arising in best approximation problems over the intersection of finitely many closed convex sets in $\\mathbb{R}^n$. Assuming a local decrease condition for the underlying operator and standard requirements on the stepsizes $(α_k) \\subset (0,1)$, we first prove strong convergence of the Halpern sequence $x_{k+1} = α_k x_0 + (1-α_k) T x_k$ to the best approximation point $x^\\star$ in the intersection set, that is, the metric projection of $x_0$ onto that set. Under the additional assumption that the intersection satisfies a Hölder-type error bound with exponent $γ\\in (0,1]$, we then derive explicit convergence rates for both feasibility and norm error: the distance from $x_k$ to the intersection set decays like $\\mathcal O(α_k^{γ/(2-γ)})$, while the norm error $\\|x_k - x^\\star\\|$ decays like $\\mathcal O(α_k^{γ/(4-2γ)})$. These results apply to most projection-type operators used in convex feasibility problems (including MAP, CRM/SCCRM, Cimmino and 3PM/A3PM) and extend classical convergence analyses of the Halpern-type iterations by providing explicit, geometry-dependent rates governed by Hölder-type error bounds. Our numerical experiments show that Halpern-type iterations combined with most of these projection-type operators are quicker than Dykstra's algorithm to find the projection of a point in an intersection of ellipsoids or in an intersection of polyhedrons.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14397v1",
    "categories": [
      "math.FA",
      "math.CV"
    ],
    "authors": [
      "Radomił Baran",
      "Hugo J. Woerdeman"
    ],
    "title": "Symmetric Schur-class functions on the bidisk and Schur-class functions on the symmetrized bidisk",
    "abstract": "We present some thoughts on the relation between symmetric Schur-class functions on the bidisk and Schur-class functions on the symmetrized bidisk. Among other things, use of this relation leads to a finite dimensional realization result for rational matrix functions in the Schur-class on the symmetrized bidisk and also to a determinantal representation result for polynomials without zeros on the symmetrized bidisk.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14332v1",
    "categories": [
      "math.OC",
      "math.AP"
    ],
    "authors": [
      "Fumiya Okazaki",
      "Takayuki Yamada"
    ],
    "title": "Topology optimization concerning the mass distribution via filtered gradient flows on the Wasserstein space",
    "abstract": "In this article, we formulate topology optimization problems concerning the mass distribution as minimization problems for functionals on the Wasserstein space. We relax optimization problems regarding non-convex objective functions on the Wasserstein space by using the Neumann heat semigroup and prove the existence of minimizers of relaxed problems. Furthermore, we introduce the filtered Wasserstein gradient flow and derive the error estimate between the original Wasserstein gradient flow and the filtered one in terms of the Wasserstein distance. We also construct a candidate for the optimal mass distribution for a given fixed total mass and simultaneously obtain the shape of the material by the numerical calculation of filtered Wasserstein gradient flows.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14312v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Koléhè Coulibaly-Pasquier",
      "Magalie Bénéfice"
    ],
    "title": "Cutoff in separation for compact harmonic manifold",
    "abstract": "We show that cutoff in separation occurs for Brownian motion in some families of compact harmonic manifolds. We compute the cutoff time and windows in four families of compact harmonic manifold namely S n , CP n , HP n and RP n (the first three families are the only families of compact simply connected harmonic manifolds, see [19]). The proof is based on sharp strong stationary times and sufficiently accurate asymptotic expansions of their means and variances.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14308v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Molla Basir Ahamed",
      "Vasudevarao Allu"
    ],
    "title": "Value Distribution and Picard-type Theorems for Total Differential Polynomials in $\\mathbb{C}^n$",
    "abstract": "This paper investigates the value distribution and growth properties of linear total differential polynomials $\\mathcal{L}_k[D]f$ for meromorphic functions in several complex variables $\\mathbb{C}^n$. By extending the classical Milloux inequality to the framework of total derivatives, we derive a series of fundamental growth estimates for the Nevanlinna characteristic function $T(r, \\mathcal{L}_k[D]f)$. We address the value-sharing problem for meromorphic functions $f$ and $g$ sharing values with their differential polynomials. Under the condition $2δ(0,f)+(k+4)Θ(\\infty,f)>k+5$, we establish that $\\frac{\\mathcal{L}_k[D]f-1}{\\mathcal{L}_k[D]g-1}$ is a non-zero constant for non-transcendental meromorphic functions. Furthermore, we provide an affirmative answer to several Picard-type inquiries, proving that if an entire function $f$ in $\\mathbb{C}^n$ omits a value $a$ while its linear total differential polynomial $\\mathcal{L}_k[D]f$ omits a non-zero value $b$, then $f$ must be constant. Our results generalize and extend several existing uniqueness and Picard-type theorems from the classical one-variable setting to the higher-dimensional complex space $\\mathbb{C}^n$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14306v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Lina Wu",
      "Wenming Zou"
    ],
    "title": "A simple proof of the Uniqueness of blow-up solutions of mean field equations",
    "abstract": "For a regular mean field equation defined on a compact Riemann surface, an important work of Bartolucci-Jevnikar-Lee-Yang \\cite{bart-4} proved a uniqueness theorem for blow-up solutions under non-degeneracy assumptions. However, the proof is highly nontrivial and challenging to read. In this article, we not only provide a simple proof for the regular equation but also extend our proof to the case of singular equations with negative singular poles. Our proof supplements what is not written in a recent outstanding work by Bartolucci-Yang-Zhang \\cite{byz-1}.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14740v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Xinjie Fang",
      "Jianhua Huang",
      "Fang Su",
      "Jun Ouyang"
    ],
    "title": "Finite-dimensional approximations of random attractor for stochastic discrete complex Ginzburg-Landau equations",
    "abstract": "In this paper, we apply an implicit Euler scheme to discretize the complex Ginzburg-Landau equation and prove the existence of a numerical attractor for the discrete Ginzburg-Landau system. We establish the upper semicontinuity of the numerical attractor with respect to the global attractor as the time step tends to zero. Furthermore, we provide finite-dimensional approximations for three types of attractors (global, numerical, and random), and demonstrate the existence of truncated attractors along with their convergence as the dimension of the state space tends to infinity. Finally, we prove the existence of a random attractor and establish the upper semi-continuity both of the global random attractor and the truncated random attractor.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14646v1",
    "categories": [
      "math.PR",
      "math.FA"
    ],
    "authors": [
      "James Tian"
    ],
    "title": "Boundary Disintegration for Weighted Residual Energy Trees",
    "abstract": "We study iterated weighted residual (WR) splittings generated by a positive operator $R_{0}\\in B\\left(H\\right)_{+}$ and a finite family of contractions $C_{1},\\dots,C_{m}$ in $B\\left(H\\right)$. The associated residual update $R\\mapsto R^{1/2}(I-C^{*}_{j}C_{j})R^{1/2}$ produces an $m$-ary energy tree of residuals $\\left\\{ R_{w}\\right\\} $ and dissipated pieces $\\left\\{ D_{w,j}\\right\\} $ indexed by finite words. From this tree we construct intrinsic path measures on the path space by biasing transitions either by a fixed quadratic form $x\\mapsto\\left\\langle x,D_{w,j}x\\right\\rangle $ (defining the measures $ν_{x}$) or, in the trace-class setting, by ${\\rm tr}\\left(D_{w,j}\\right)$ (yielding a reference measure $ν_{\\mathrm{tr}}$). When $R_{0}\\in S_{1}\\left(H\\right)_{+}$, we show that $ν_{\\mathrm{tr}}$ dominates the family $\\left\\{ ν_{x}\\right\\} $ and identify $dν_{x}/dν_{\\mathrm{tr}}$ as a canonical martingale limit of cylinder likelihood ratios. Along $ν_{\\mathrm{tr}}$-almost every branch the residuals decrease to a terminal trace-class random variable $R_{\\infty}$, which we interpret as the WR boundary variable. We then disintegrate $ν_{\\mathrm{tr}}$ over $σ\\left(R_{\\infty}\\right)$, obtaining a boundary law $μ_{\\mathrm{tr}}=\\left(R_{\\infty}\\right)_{\\#}ν_{\\mathrm{tr}}$ and conditional path measures $\\left\\{ ν^{T}_{\\mathrm{tr}}\\right\\} $. Finally, we show that each $ν_{x}$ admits a boundary representation as a mixture of $\\left\\{ ν^{T}_{\\mathrm{tr}}\\right\\} $ with an explicit boundary density $h_{x}=dμ_{x}/dμ_{\\mathrm{tr}}$, thereby organizing the family of intrinsic WR path measures by a single trace-biased boundary disintegration.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14591v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yavdat Il'yasov",
      "Juntao Sun",
      "Nur Valeev",
      "Shuai Yao"
    ],
    "title": "Uniqueness of Ground State Solutions for a Defocusing Hartree Equation via Inverse Optimal Problems",
    "abstract": "We study a generalized defocusing Hartree equation with nonlocal exchange potential and repulsive Hartree--Fock interaction. Using an inverse optimal problem (IOP) approach, we prove the existence and uniqueness of ground state solutions. Additionally, we establish the existence of principal solutions, their continuous dependence on parameters, and a dual variational formulation. The IOP method provides a systematic framework for addressing inverse problems in nonlocal Schrödinger operators and offers new insights into the structure of solutions for defocusing Hartree-type equations.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14586v1",
    "categories": [
      "math.ST",
      "math.PR"
    ],
    "authors": [
      "Dan Cheng",
      "John Ginos"
    ],
    "title": "Cluster size distributions of discrete random fields",
    "abstract": "We study discrete random fields $\\{X_t: t\\in \\mathbb{Z}^d\\}$ parameterized on the $d$-dimensional integer lattice $\\mathbb{Z}^d$. For a fixed threshold $u$, the excursion set $\\{t \\in \\mathbb{Z}^d : X_t > u\\}$ decomposes into connected components or clusters, whose size, defined as the number of lattice points they contain, are random. This paper investigates the probability distribution of these cluster sizes. For stationary random fields, we derive exact expressions for the cluster size distribution. To address nonstationary settings, we introduce a peak-based cluster size distribution, which characterizes the distribution of cluster sizes conditional on the presence of a local maximum above $u$. This formulation provides a tractable alternative when exact cluster size distributions are analytically inaccessible. The proposed framework applies broadly to Gaussian and non-Gaussian random fields, relying only on their joint dependence structure. Our results provide a theoretical foundation for quantifying spatial extent in discretely sampled data, with applications to medical imaging, geoscience, environmental monitoring, and other scientific areas where thresholded random fields naturally arise.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14545v1",
    "categories": [
      "math.GN"
    ],
    "authors": [
      "Luis A. Martínez-Sánchez",
      "Héctor Pinedo",
      "José L. Vilca-Rodríguez"
    ],
    "title": "On Γ-embeddings and partial actions of function spaces A",
    "abstract": "This paper deals with the extension of partial actions of topological groups on topological spaces. Within this framework, we introduce a class of topological embeddings defined via the inverse semigroup of homeomorphisms between open subsets of a topological space. We describe several embeddings of this type, referred to as $Γ$- embeddings, and we place particular emphasis on one of them. In particular, we prove that every topological space $Y$ admits a $Γ$-embedding into the space of continuous functions $C(X, Y )$, equipped with the compact-open topology, where $X$ is a compact space. Consequently, any partial action $θ$ of a topological group $G$ on $ Y$ naturally induces a partial action $\\hatθ$ on $C(X, Y ).$ Throughout the paper, we investigate various relationships between these actions, as well as between their corresponding globalizations and enveloping spaces.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14933v1",
    "categories": [
      "math.NA",
      "eess.SY"
    ],
    "authors": [
      "Yogesh Darmwal",
      "Ketan Rajawat"
    ],
    "title": "Rank-one Riemannian Subspace Descent for Nonlinear Matrix Equations",
    "abstract": "We propose a rank-one Riemannian subspace descent algorithm for computing symmetric positive definite (SPD) solutions to nonlinear matrix equations arising in control theory, dynamic programming, and stochastic filtering. For solution matrices of size $n\\times n$, standard approaches for dense matrix equations typically incur $\\mathcal{O}(n^3)$ cost per-iteration, while the efficient $\\mathcal{O}(n^2)$ methods either rely on sparsity or low-rank solutions, or have iteration counts that scale poorly. The proposed method entails updating along the dominant eigen-component of a transformed Riemannian gradient, identified using at most $\\mathcal{O}(\\log(n))$ power iterations. The update structure also enables exact step-size selection in many cases at minimal additional cost. For objectives defined as compositions of standard matrix operations, each iteration can be implemented using only matrix--vector products, yielding $\\mathcal{O}(n^2)$ arithmetic cost. We prove an $\\mathcal{O}(n)$ iteration bound under standard smoothness assumptions, with improved bounds under geodesic strong convexity. Numerical experiments on large-scale CARE, DARE, and other nonlinear matrix equations show that the proposed algorithm solves instances (up to $n=10{,}000$ in our tests) for which the compared solvers, including MATLAB's \\texttt{icare}, structure-preserving doubling, and subspace-descent baselines fail to return a solution. These results demonstrate that rank-one manifold updates provide a practical approach for high-dimensional and dense SPD-constrained matrix equations. MATLAB code implementation is publicly available on GitHub : \\href{https://github.com/yogeshd-iitk/nonlinear_matrix_equation_R1RSD}{\\textcolor{blue}{https://github.com/yogeshd-iitk/nonlinear\\_matrix \\_equation\\_R1RSD}}",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14911v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Paula Hilbert",
      "Ani Miraçi",
      "Dirk Praetorius"
    ],
    "title": "Generalized preconditioned conjugate gradients for adaptive FEM with optimal complexity",
    "abstract": "We consider adaptive finite element methods (AFEMs) with inexact algebraic solver for second-order symmetric linear elliptic diffusion problems. We formulate and analyze a non-linear and non-symmetric geometric multigrid preconditioner for the generalized preconditioned conjugate gradient method (GPCG) used to solve the arising finite element systems. Moreover, a linear and symmetric variant of the geometric multigrid preconditioner that is suitable for the (standard) preconditioned conjugate gradient method (PCG) is provided and analyzed. We show that both preconditioners are optimal in the sense that, first, the resulting algebraic solvers admit a contraction factor that is independent of the local mesh size h and the polynomial degree p, and, second, that they can be applied with linear computational complexity. Related to this, quasi-optimal computational cost of the overall adaptive finite element method is addressed. Numerical experiments underline the theoretical findings.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14882v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Mehdi Golestani",
      "Yongduan Song",
      "Weizhen Liu",
      "Guangren Duan",
      "He Kong"
    ],
    "title": "Practical prescribed-time prescribed performance control with asymptotic convergence - A vanishing sigma-modification approach",
    "abstract": "In this paper, we present a method capable of ensuring practical prescribed-time control with guaranteed performance for a class of nonlinear systems in the presence of time-varying parametric and dynamic uncertainties, and uncertain control coefficients. Our design consists of two key steps. First, we construct a performance-rate function that freezes at and after a user-specified time T, playing a crucial role in achieving desired precision within prescribed time T and dealing with unmodeled dynamics. Next, based on this function and a sigma-modification strategy in which the leakage term starts to vanish at t > T, we develop an adaptive dynamic surface control framework to reduce control complexity, deal with uncertainties, ensure prescribed performance, practical prescribed-time convergence to a specific region, and ultimately achieve asymptotic convergence. The effectiveness of the proposed control method is validated through numerical simulations.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14879v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Ivan Penkov",
      "Pablo Zadunaisky"
    ],
    "title": "The Pieri Rule at Infinity",
    "abstract": "We study the structure of tensor products of $\\mathfrak{gl}(\\infty) = \\varinjlim \\mathfrak{gl}(n)$-modules $\\mathbf L(\\mathbf λ) \\otimes \\mathbf F$ where $\\mathbf L(\\mathbf λ)$ is a simple integrable highest weight module and $\\mathbf F$ is a simple integrable weight multiplicity-free module. Both $\\mathbf L(\\mathbf λ)$ and $\\mathbf F$ are infinite dimensional, in particular $\\mathbf F$ can be a Fock module. Similar tensor products of $\\mathfrak{gl}(n)$-modules are semisimple and their simple constituents are described by the classical Pieri rule. We prove that a $\\mathfrak{gl}(\\infty)$-module $\\mathbf M:= \\mathbf L(\\mathbf λ) \\otimes \\mathbf F$ is semisimple only in relatively trivial cases, and is indecomposable otherwise. Our main results are a description of the simple constituents of $\\mathbf M$, and the construction of a linkage filtration on $\\mathbf M$ that provides information on when two simple constituents of $\\mathbf M$ are linked. Using the linkage filtration, we compute the socle and radical filtrations of $\\mathbf M$, and determine when $\\mathbf M$ is rigid.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14832v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Zhibin Geng",
      "Hang Xue"
    ],
    "title": "Casselman-Wallach property for homological theta lifting",
    "abstract": "In this paper, we establish the Casselman-Wallach property for homological theta lifting over archimedean local fields. As a consequence, the Euler-Poincaré characteristic is a well-defined element in the Grothendieck group of Casselman-Wallach representations. Our main tool is a corank-one parabolic stable filtration on the Weil representation.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14825v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Chong Li",
      "Shujie Li"
    ],
    "title": "A proof for the conjecture on superlinear problems with Ambrosetti-Rabinowitz condition",
    "abstract": "This paper is devoted to exploring a new minimax approach by introducing a characteristic mapping family which is invariant under the smooth descending flow for initial value. The minimax approach is self-contained, and its features are markedly different from standard ones, as it identifies the existence of critical points and intrinsically presents a lower-bound estimate for the generalized Morse index at the corresponding critical point. This quantity can be effectively viewed as an alternative to the group action. As applications, under the Ambrosetti-Rabinowitz condition we offer a positive answer to the long-standing open problem on the existence of infinitely many distinct solutions for superlinear elliptic equations without symmetric hypothesis.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14805v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ryuhei Mizutani"
    ],
    "title": "Minimizing Submodular Functions over Hierarchical Families",
    "abstract": "This paper considers submodular function minimization (SFM) restricted to a family of subsets. We show that SFM over complements of families with certain hierarchical structures can be solved in polynomial-time. This yields a polynomial-time algorithm for SFM over complements of various families, such as intersecting families, crossing families, and the unions of lattices. Moreover, this tractability result partially settles the open question posed by Nägele, Sudakov, and Zenklusen on polynomial-solvability of SFM over the intersection of parity families. Furthermore, our tractability result implies that for a constant positive integer k, the k-th smallest value of a submodular function can be obtained in polynomial-time.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14597v1",
    "categories": [
      "cs.IT",
      "cs.AI",
      "cs.CR",
      "stat.ML"
    ],
    "authors": [
      "James Melbourne",
      "Mario Diaz",
      "Shahab Asoodeh"
    ],
    "title": "Optimality of Staircase Mechanisms for Vector Queries under Differential Privacy",
    "abstract": "We study the optimal design of additive mechanisms for vector-valued queries under $ε$-differential privacy (DP). Given only the sensitivity of a query and a norm-monotone cost function measuring utility loss, we ask which noise distribution minimizes expected cost among all additive $ε$-DP mechanisms. Using convex rearrangement theory, we show that this infinite-dimensional optimization problem admits a reduction to a one-dimensional compact and convex family of radially symmetric distributions whose extreme points are the staircase distributions. As a consequence, we prove that for any dimension, any norm, and any norm-monotone cost function, there exists an $ε$-DP staircase mechanism that is optimal among all additive mechanisms. This result resolves a conjecture of Geng, Kairouz, Oh, and Viswanath, and provides a geometric explanation for the emergence of staircase mechanisms as extremal solutions in differential privacy.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14748v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Danijel Grahovac",
      "Péter Kevei",
      "Dominik Mihalčić"
    ],
    "title": "Marcinkiewicz--Zygmund-type SLLN for mixed moving average processes",
    "abstract": "The Marcinkiewicz--Zygmund theorem is a fundamental result in probability theory that establishes rates of convergence in the strong law of large numbers (SLLN). Although numerous extensions have been developed for dependent sequences, many classes of processes, particularly those exhibiting strong dependence, remain unexplored. In this paper, we present a Marcinkiewicz--Zygmund-type SLLN for a class of mixed moving average processes, which form a large and flexible class of stationary infinitely divisible processes. In contrast to the classical case, where moments determine the asymptotic behavior, the present setting additionally involves key objects that characterize both dependence and marginal distributions.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14682v1",
    "categories": [
      "math.KT"
    ],
    "authors": [
      "Liang Guo",
      "Hang Wang",
      "Xiufeng Yao"
    ],
    "title": "The K-theory of maximal and reduced Roe algebras for Hecke pairs with equivariant coarse embeddings",
    "abstract": "In this paper, we generalize the Dirac-dual-Dirac method to Hecke pairs with equivariant coarse embeddings and establish the K-theoretic isomorphisms between the maximal and reduced equivariant Roe algebras. We also extend these results to prove the Baum--Connes conjecture in this context.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14680v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Zhenwei Lin",
      "Zhe Zhang"
    ],
    "title": "Optimal Methods for Unknown Piecewise Smooth Problems I: Convex Optimization",
    "abstract": "We introduce an optimal and nearly parameter-free algorithm for minimizing piecewise smooth (PWS) convex functions under the quadratic growth (QG) condition, where the locations and structure of the smooth regions are entirely \\textit{unknown}. Our algorithm, \\apex{} (Accelerated Prox-Level method for Exploring Piecewise Smoothness), is an accelerated bundle-level method designed to adaptively exploit the underlying PWS structure. APEX enjoys optimal theoretical guarantees, achieving a tight oracle complexity bound that matches the lower bound established in this work for convex PWS optimization. Furthermore, APEX generates a verifiable and accurate termination certificate, enabling a robust, almost parameter-free implementation. To the best of our knowledge, APEX is the first algorithm to simultaneously achieve the optimal convergence rate for PWS optimization and provide certificate guarantees.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14647v1",
    "categories": [
      "math.OC",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Yuchen Fang",
      "Xinshou Zheng",
      "Javad Lavaei"
    ],
    "title": "TRSVR: An Adaptive Stochastic Trust-Region Method with Variance Reduction",
    "abstract": "We propose a stochastic trust-region method for unconstrained nonconvex optimization that incorporates stochastic variance-reduced gradients (SVRG) to accelerate convergence. Unlike classical trust-region methods, the proposed algorithm relies solely on stochastic gradient information and does not require function value evaluations. The trust-region radius is adaptively adjusted based on a radius-control parameter and the stochastic gradient estimate. Under mild assumptions, we establish that the algorithm converges in expectation to a first-order stationary point. Moreover, the method achieves iteration and sample complexity bounds that match those of SVRG-based first-order methods, while allowing stochastic and potentially gradient-dependent second-order information. Extensive numerical experiments demonstrate that incorporating SVRG accelerates convergence, and that the use of trust-region methods and Hessian information further improves performance. We also highlight the impact of batch size and inner-loop length on efficiency, and show that the proposed method outperforms SGD and Adam on several machine learning tasks.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14635v1",
    "categories": [
      "math.GR",
      "math.CO"
    ],
    "authors": [
      "Xiaogang Li",
      "Yao Tian"
    ],
    "title": "A classification of regular maps with Euler characteristic $-pq$",
    "abstract": "In this paper, we give a classification of regular maps with Euler characteristic $-pq$ for distinct primes $q>p\\geq 5$. This together with previous classification of regular maps with Euler characteristic $-2p,-3p$ and $-p^2$ completes the classification of regular maps with Euler characteristic $-pq$ for two primes $p$ and $q$. An interesting consequence is that, for every pair of twin primes $p$ and $q$ greater than $5$, there exist three regular maps with solvable automorphism groups and Euler characteristic $-pq$, up to duality and isomorphism.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14548v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Timo Sprekeler"
    ],
    "title": "A Cordes framework for stationary Fokker--Planck--Kolmogorov equations",
    "abstract": "We first review the Cordes condition for nondivergence-form differential operators through the lens of Campanato's theory of near operators. We then survey a recently proposed Cordes framework that guarantees the existence and uniqueness of $L^2$ solutions to stationary Fokker--Planck--Kolmogorov equations subject to periodic boundary conditions, and that allows for the construction of a simple finite element method for its numerical approximation. Finally, we propose a Cordes framework for stationary Fokker--Planck--Kolmogorov-type equations subject to a homogeneous Dirichlet boundary condition.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14535v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "N. Bradley Fox",
      "Joseph Spaeth"
    ],
    "title": "Total Prime Labelings of Various Graphs",
    "abstract": "A total prime labeling of a graph of order $n$ is an extension of a prime labeling in which we distinctly label the vertices and edges. The goal of the labeling is for adjacent vertex labels to be relatively prime, and for each vertex of degree at least two, the greatest common divisor of the labels on its incident edges is equal to 1. In this paper, we construct total prime labelings by extending known prime and minimum coprime labelings and by developing new constructions for various classes of graphs. In particular, we show that snakes, books, prisms, prime trees, certain families of windmills, and other families of graphs are total prime.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14502v1",
    "categories": [
      "math.GR",
      "math.GN"
    ],
    "authors": [
      "Oleg Gutik",
      "Marharyta Zolotar",
      "Oleksandra Lysetska"
    ],
    "title": "On topologization of the extended bicyclic semigroup",
    "abstract": "Non-discrete semigroup $T_1$-topologies on the extended bicyclic semigroup $\\mathscr{C}_\\mathbb{Z}$ are constructed. Also, we present topological conditions, when a semigroup (shift-continuous) $T_1$-topology on $\\mathscr{C}_\\mathbb{Z}$ is discrete.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14465v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Máté Jánosik",
      "Artúr Nádor",
      "Nagy Zoltán Lóránt",
      "László Bence Simon"
    ],
    "title": "Avoiding configurations of small size in the square grid",
    "abstract": "We study the maximum size of a subset of the $n \\times n$ integer grid that does not contain specific geometric configurations, a variation of the classical problems initiated by Erdős and Purdy. While extremal problems for 3-point patterns, such as collinear triples and right triangles are well-studied, the landscape for 4-point configurations in the grid remains less explored. In this paper, we survey the state-of-the-art regarding forbidden 3-point and 4-point configurations, including parallelograms, trapezoids, and concyclic sets. Furthermore, we prove new lower bounds for grid subsets avoiding rhombuses and kites. Specifically, by combining the probabilistic method with the arithmetic properties of Sidon sets, we show that the maximum size of a rhombus-free subset is $Ω(n^{4/3}(\\log n)^{-1/3})$. We also provide near-quadratic lower bounds for sets avoiding kites with axis-parallel diagonals using Behrend-type constructions and discuss implications for square-free sets. These results illustrate the strong interplay between discrete geometry and additive combinatorics.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14457v1",
    "categories": [
      "math.AP",
      "math.OC"
    ],
    "authors": [
      "Martin Burger",
      "Ariane Fazeny",
      "Gilles Mordant",
      "Jan-Frederik Pietschmann"
    ],
    "title": "p-Wasserstein distances on networks and 3D to 1D convergence",
    "abstract": "We study transport distances on metric graphs representing gas networks. Starting from the dynamic formulation of the Wasserstein distance, we review extensions to networks, with and without the possibility of storing mass on the vertices.\n  Next, we examine the asymptotic behavior of the static Wasserstein distance on a three-dimensional network domain that converges to a metric graph. We show convergence of the distance with a proof that is based on the characterization of optimal transport plans as $c$-cyclically monotone sets.\n  We conclude by illustrating our finding with several numerical examples.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14416v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Victor Hugo Pereira Rodrigues",
      "Tiago Roux Oliveira",
      "Miroslav Krstic",
      "Paulo Tabuada"
    ],
    "title": "Event-Triggered Newton Extremum Seeking for Multivariable Optimization",
    "abstract": "This paper presents a static event-triggered control strategy for multivariable Newton-based extremum seeking. The proposed method integrates event-triggered actuation into the Newton-based optimization framework to reduce control updates while maintaining rapid convergence to the extremum. Unlike traditional gradient-based extremum seeking, where the convergence rate depends on the unknown Hessian of the cost function, the proposed approach employs a dynamic estimator of the Hessian inverse, formulated as a Riccati equation, enabling user-assignable convergence rates. The event-triggering mechanism is designed to minimize unnecessary actuation updates while preserving stability and performance. Using averaging theory, we establish local stability results and exponential convergence to a neighborhood of the unknown extremum point. Additionally, numerical simulations illustrate the benefits of the proposed approach over gradient-based and continuously actuated Newton-based extremum seeking, showing improved convergence rates and reduced control update frequency, leading to more efficient implementation in real-time optimization scenarios.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14414v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Liang Wu",
      "Bo Yang",
      "Xu Yang",
      "Yilin Mo",
      "Yang Shi",
      "Ján Drgoňa"
    ],
    "title": "$π$MPC: A Parallel-in-horizon and Construction-free NMPC Solver",
    "abstract": "The alternating direction method of multipliers (ADMM) has gained increasing popularity in embedded model predictive control (MPC) due to its code simplicity and pain-free parameter selection. However, existing ADMM solvers either target general quadratic programming (QP) problems or exploit sparse MPC formulations via Riccati recursions, which are inherently sequential and therefore difficult to parallelize for long prediction horizons. This technical note proposes a novel \\textit{parallel-in-horizon} and \\textit{construction-free} nonlinear MPC algorithm, termed $π$MPC, which combines a new variable-splitting scheme with a velocity-based system representation in the ADMM framework, enabling horizon-wise parallel execution while operating directly on system matrices without explicit MPC-to-QP construction. Numerical experiments and accompanying code are provided to validate the effectiveness of the proposed method.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14396v1",
    "categories": [
      "math.RT",
      "math.RA",
      "math.SG"
    ],
    "authors": [
      "Sibylle Schroll"
    ],
    "title": "On geometric models in representation theory",
    "abstract": "Geometric models have emerged as an important tool in the representation theory of algebras. Surface models associated to gentle algebras have been particularly fruitful in advancing our understanding of their module and derived categories. We give an overview of some of the theoretical advances that geometric surface models for the derived categories of graded gentle algebras and their connections to Fukaya categories of surfaces have made possible.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14856v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Pascal Autissier"
    ],
    "title": "Effective normal basis theorem",
    "abstract": "Let K be a finite Galois extension of Q. The normal basis theorem provides an element of K whose conjugates form a Q-basis of K. Here we obtain such an element with controlled size. This improves a recent result by Fukshansky and Jeong. By the way, we estimate Minkowski's minima of ideals of integers of number fields.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14842v1",
    "categories": [
      "math.SG"
    ],
    "authors": [
      "Jan Eyll",
      "Jonas Fritsch",
      "Kai Zehmisch"
    ],
    "title": "Contactomorphic vertically convex domains",
    "abstract": "We consider the standard Darboux space equipped with the radial symmetric contact form. We study co-orientation preserving contactomorphisms between relatively compact domains up to the boundary. We determine the contactomorphism classes among all strict vertically convex domains over a round ball in the Liouville hyperplane that are radially symmetric about the Reeb axis and whose boundary coincide along a neighbourhood of the common equator. The total invariant is the mean curvature of the bounding sphere at the umbilic points with the same sign. Replacing the Liouville hyperplane by codisc bundles of closed non-Besse Riemannian manifolds or finite symplectisations of closed non-Besse strict contact manifolds analogous results are formulated in terms of characteristic length and total characteristic action, resp.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14839v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Daizhan Cheng"
    ],
    "title": "On Dimension Varying Control Systems: A Universal State Space Approach",
    "abstract": "A cross-dimensional Euclidian space ($Ω$) is proposed for the state space of dimension varying (control) systems. It is shown that the topological structure of $Ω$ is consistent with all $\\mathbb{R}^n$, which are the state spaces of each component modes of a dimension varying system. Using the universal metric from $Ω$, the switching laws are assumed to be Lipschitz. Some reasonable conventional switching laws are proposed. Under the topology deduced by the metric on $Ω$ some fundamental properties of dimension varying dynamic systems, such as stability and robustness, are investigated. Then some control problems of dimension varying control systems, including controllability, observability, stabilization, disturbance decoupling, etc. are investigated. Finally, an aggregation approach for large scale hierarchical dimension varying networks is proposed.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14812v1",
    "categories": [
      "math.CT",
      "math.QA",
      "math.RT"
    ],
    "authors": [
      "Max Demirdilek"
    ],
    "title": "A lifting theorem for Grothendieck-Verdier categories",
    "abstract": "We identify additional structure on a conservative lax monoidal functor from a closed monoidal category $\\mathcal{C}$ to a Grothendieck-Verdier category $\\mathcal{D}$, such that the Grothendieck-Verdier structure of $\\mathcal{D}$ lifts to $\\mathcal{C}$ and the functor becomes Frobenius linearly distributive. As an application, we recover and extend conditions under which modules over Hopf monads and Hopf algebroids inherit Grothendieck-Verdier structures. We also characterize when categories of bimodules, modules, and local modules over (commutative) algebras internal to a Grothendieck-Verdier category admit such structures. Our results apply to quantales, smash product algebras, skew group algebras, and enveloping algebras of Lie-Rinehart algebras.\n  For applications of the lifting theorem, we construct a strict $2$-equivalence between a $2$-category of Grothendieck-Verdier categories and one of linearly distributive categories with negation, and extend this $2$-equivalence to the braided setting.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14618v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Yuchen Xu",
      "Yong Yang"
    ],
    "title": "Large orbits of nilpotent subgroups of linear groups",
    "abstract": "Suppose that $G$ is a finite solvable group and $V$ is a finite, faithful and completely reducible $G$-module. Let $N$ be a nilpotent subgroup of $G$, then there exits $v \\in V$ such that $|\\bC_N(v)| \\leq (|N|/p)^{1/p}$, where $p$ is the smallest prime divisor of $|N|$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14508v1",
    "categories": [
      "math.NA",
      "physics.plasm-ph"
    ],
    "authors": [
      "Mustafa Aggul",
      "Manaure Francisquez",
      "Daniel R. Reynolds",
      "Sylvia Amihere"
    ],
    "title": "Super Time Stepping Methods for Diffusion using Discontinuous-Galerkin Spatial Discretizations",
    "abstract": "Super-time-stepping (STS) methods provide an attractive approach for enabling explicit time integration of parabolic operators, particularly in large-scale, higher-dimensional kinetic simulations where fully implicit schemes are impractical. In this work, we present an explicit STS framework tailored for diffusion operators in gyrokinetic models, motivated by the fact that constructing and storing a Jacobian is often infeasible due to strong nonlocal couplings, high dimensionality, and memory constraints. We investigate the performance of several STS methods, including Runge-Kutta-Chebyshev (RKC) and Runge-Kutta-Legendre (RKL) schemes, applied to a diffusion equation discretized using both discontinuous Galerkin (DG) and finite-difference methods. To support time adaptivity, we introduce a novel error norm designed to more accurately track temporal error arising from DG spatial discretizations, in which degrees of freedom contribute unevenly to the solution error. Finally, we assess the performance of an automatic eigenvalue estimation algorithm for determining the required number of STS stages and compare it against an analytical estimation formula.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14669v1",
    "categories": [
      "math.DG",
      "math.MG"
    ],
    "authors": [
      "Aditya Kumar",
      "Balarka Sen"
    ],
    "title": "Urysohn width and macroscopic scalar curvature",
    "abstract": "We show that the macroscopic version of Gromov's Urysohn width conjecture for scalar curvature is false in dimensions four and above. This is based on (1) a novel estimate on the codimension two Urysohn width of circle bundles over manifolds with large hypersphericity radius, and (2) a notion of ruling for Riemannian manifolds that yields circle bundles with total spaces admitting metrics of positive macroscopic scalar curvature. Along the way, we also show that Urysohn width is not continuous under Cheeger-Gromov collapsing limits. This article is a continuation of our study of metric invariants and scalar curvature for circle bundles over large Riemannian manifolds initiated in [KS25].",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14488v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Moustapha Diallo",
      "Zelalem Arega Worku"
    ],
    "title": "High-Order Symmetric Positive Interior Quadrature Rules on Two and Three Dimensional Domains",
    "abstract": "Fully symmetric positive interior (f-SPI) quadrature rules are key building blocks for high-order discretizations of partial differential equations, yet high-degree rules with few nodes remain scarce on reference elements commonly used in mesh generation. We construct new f-SPI rules on the square, cube, prism, and pyramid by coupling a variable parameterization that enforces positivity and interiority with an efficient Levenberg-Marquardt optimization and a symmetry-aware node-reduction strategy that eliminates and collapses orbits, allowing transitions between symmetry types. The resulting rules achieve degrees up to 77 on the square, 45 on the cube, and 30 on the prism and pyramid, and for most degrees use fewer nodes than previously published f-SPI quadrature rules. Verification tests demonstrate comparable accuracy to existing rules. Complete node and weight data are also provided.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14657v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Shaoxiong Chen",
      "Fei Yuan",
      "Fukun Zhao",
      "Jiazheng Zhou"
    ],
    "title": "Multiple standing waves of Helmholtz equation with mixed dispersion concentrating in the high frequency limit",
    "abstract": "In this paper, we study the nonlinear Helmholtz equation with mixed dispersion \\begin{equation*}\n  Δ^2 u-βk^2\\, Δu+αk^4 u=W(x)\\, |u|^{p-2}u~\\text{in}~\\mathbb{R}^N, \\end{equation*} where the weight function $W(x)$ is continuous, nonnegative, and satisfies \\[ \\limsup_{|x|\\to\\infty} W(x) \\;<\\; \\sup_{x\\in\\mathbb{R}^N} W(x). \\] Within each of the following parameter ranges, \\begin{center}\n  (a) $α<0$, $β\\in\\mathbb{R}$; \\qquad (b) $α>0$, $β<-2\\sqrtα$; \\qquad (c) $α=0$, $β<0$, \\end{center} After a suitable rescaling, we obtain the existence of dual ground state solutions, which concentrate along the global maximizers of $W$ as $k\\to\\infty$. In addition, we establish the existence of multiple solutions associated with the set of global maximum points of $W$, and we further characterize the precise concentration behavior of these solutions.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14626v1",
    "categories": [
      "math.KT",
      "math.CT"
    ],
    "authors": [
      "Chunhui Wei"
    ],
    "title": "Dévissage for Algebraic K-theory of Small Stable $\\infty$-categories",
    "abstract": "In this article, we extend Quillen's Dévissage Theorem to small stable $\\infty$-categories. To be precise, we establish sufficient conditions under which the non-negative $K$-groups of a small stable $\\infty$-category coincide with those of a stable subcategory thereof.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14600v1",
    "categories": [
      "math.PR",
      "math.AP",
      "math.SP"
    ],
    "authors": [
      "Illya M. Karabash"
    ],
    "title": "Sobolev multipliers and fractional Gaussian fields on Lipschitz boundaries with applications to deterministic and random acoustic systems",
    "abstract": "Motivated by Applied Physics and Photonics studies of random resonators, we study in the stochastic part of this paper random acoustic operators in non-smooth bounded domains $G \\subset \\mathbb{R}^d$ and introduce m-dissipative impedance boundary conditions containing fractional Gaussian fields (FGFs). The deterministic part of the paper constructs and studies the spaces of pointwise multipliers on Lipschitz continuous boundaries $\\partial G$, as well as the spaces of Sobolev (distribution-type) multipliers on boundaries $\\partial G$ of better regularity. These multipliers are used as generalized impedance coefficients $ζ(x)$, $x \\in \\partial G$, in impedance boundary conditions accompanying the first order acoustic system. The main efforts are aimed on the m-dissipativity of associated acoustic operators and the discreteness of the related spectra under weakest possible assumptions on the regularity of $ζ$. In order to connect the deterministic results with the randomization, we introduce FGFs on Lipschitz boundaries $\\partial G$ and study their regularity. To this end, we prove that a rough Weyl-type asymptotics takes place for the Laplace-Beltrami eigenvalues on arbitrary compact boundary $\\partial G$ of $C^{0,1}$-regularity.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14585v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Tomoki Nakamigawa"
    ],
    "title": "Star Decompositions of a Cyclic Polygon",
    "abstract": "Let $V$ be a set of vertices on a circumference in the plane. Let $E$ be a set of directed line segments linking two vertices of $V$. If $E$ forms a set of closed cycles and for all two adjacent edges $uv$ and $vw$, the vertices $u$, $v$, $w$ are arranged in anti-clockwise order, we call $P(V,E)$ a cyclic polygon. A star decomposition $\\mathcal{S}$ of a cyclic polygon $P$ is a set of star polygons partitioning the region of $P$ with some additional diagonals. A star decomposition $\\mathcal{S}$ is called maximal if there is no other star decomposition $\\mathcal{S}'$ such that a set of diagonals of $\\mathcal{S}$ is a proper subset of that of $\\mathcal{S}'$.\n  In this paper, it is shown that for any two maximal star decompositions $\\mathcal{S}_1$ and $\\mathcal{S}_2$ of a common cyclic polygon, $\\mathcal{S}_1$ can be transformed into $\\mathcal{S}_2$ by a finite sequence of diagonal flips. It is also shown that if a cyclic polygon $P$ admits a star decomposition, the number of diagonals contained in a maximal star decomposition of $P$ is $p - (n-2r)(n-2r-1)/2$, where $p$ is the number of all possible diagonals of $P$, $n$ is the number of vertices of $P$, and $r$ is the rotation number of $P$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14557v1",
    "categories": [
      "math.AG",
      "math.NT"
    ],
    "authors": [
      "David Kazhdan",
      "Alexander Polishchuk"
    ],
    "title": "$L^2$-property for algebraic stacks over local non-archimedean fields",
    "abstract": "We introduce an $L^2$-norm on the space of Schwartz half-densities over algebraic stacks over local non-archimedean fields. We show that these $L^2$-norms are finite for the stacks of $PGL_2$-bundles on $\\mathbb{P}^1$ with parabolic structures at $\\ge 3$ points. The latter property was conjectured in the context of the analytic Langlands correspondence of arXiv:2103.01509.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14469v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Loth Damagui Chabi",
      "Philippe Souplet"
    ],
    "title": "Sharp macroscopic blow-up behavior for the parabolic-elliptic Keller-Segel system in dimensions $n\\ge 3$",
    "abstract": "We study the space-time concentration or blow-up asymptotics of radially decreasing solutions of the parabolic-elliptic Keller-Segel system in the whole space or in a ball. We show that, for any solution in dimensions $3\\le n\\le 9$ (assuming finite mass in the whole space case), there exists a nonflat backward self-similar solution $U$ such that $$u(x,t)=(1+o(1))U(x,t),\\quad\\hbox{as $(x,t)\\to (0,T)$.}$$ This macroscopic behavior is important from the physical point of view, since it gives a sharp description of the concentration phenomenon in the scale of the original space-time variables~$(x,t)$. It strongly improves on existing results, since such behavior was previously known (\\cite{GMS}) to hold only in the microscopic scale $|x|\\le O(\\sqrt{T-t})$ as $t\\to T$ (and in the whole space case only). As a consequence, we obtain the two-sided global estimate $$C_1\\le (T-t+|x|^2)u(x,t)\\le C_2\\quad\\hbox{in $B_R\\times(T/2,T)$},$$ whose upper part only was known before (\\cite{Soup-Win}), as well as the sharp final profile: $$\\lim_{x\\to 0} |x|^2u(x,T)=L\\in(0,\\infty).$$ The latter improves, with a different proof, the recent result of \\cite{BZ} by excluding the possibility $L=0$. We also give extensions of these results, in higher dimensions, to type~I and to time monotone solutions. Moreover, we extend the known results on type I estimates and on convergence in similarity variables, and significantly simplify their proofs.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14452v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "G. I. Sharygin",
      "A. Hernandez Rodriguez"
    ],
    "title": "Double Poisson brackets on low dimensional algebras",
    "abstract": "In this paper, we describe double Poisson brackets in the sense of M. Van den Bergh on certain finite-dimensional algebras. In particular we prove that all possible double Poisson brackets on matrix algebras are \"inner\", i.e. given by some commutators in bimodules. As a corollary of this result, we see that all possible double Poisson brackets in any finite-dimensional semisimple algebras over algebraically closed fields are also given by inner derivations. We further give a description of all double Poisson brackets on the algebra of 2x2 upper triangular matrices. We further discuss Poisson structures induced from the double Poisson brackets in its representation spaces of rank two and three. In the appendix, we describe modified double Poisson brackets (in the sense of S. Arthamonov) on this algebra.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14355v1",
    "categories": [
      "math.OA",
      "math.PR"
    ],
    "authors": [
      "Tian Xin",
      "Liang Aoqin"
    ],
    "title": "Mathematical Foundations of Quantum Pricing Theory",
    "abstract": "Let $M$ be a von Neumann algebra and let $(N_t)_{t\\in[0,T]}$ be an increasing family of abelian von Neumann subalgebras encoding a (classical) information flow. Fix a faithful normal state $\\varphi_ρ$ on $M$ and assume a filtration of normal $\\varphi_ρ$-preserving conditional expectations $E_t:M\\to N_t$ satisfying the tower property. For self-adjoint observables affiliated with $M$, we introduce a truncation-stable notion of $(N_t,E_t)$-martingales via bounded functional-calculus cutoffs $f_n$, and formulate a \\emph{Local Informational Efficiency Principle} requiring symmetrically discounted traded prices to be martingales in this localized sense.\n  Assuming the existence of a pricing state $\\varphi^\\star$ and a compatible family of normal $\\varphi^\\star$-preserving conditional expectations $(E_t^\\star)$, we define for bounded terminal payoffs $X\\in M_T$ the dynamic pricing operator \\[ Π_t(X):=B_t^{1/2}\\,E_t^\\star\\!\\bigl(B_T^{-1/2}XB_T^{-1/2}\\bigr)\\,B_t^{1/2}, \\] where $(B_t)$ is a strictly positive numéraire adapted to $(N_t)$. We prove that $(Π_t)_{t\\in[0,T]}$ is normal, completely positive, unital, $N_t$-bimodular, and time-consistent; in the commutative reduction it coincides with classical risk-neutral valuation by conditional expectation.\n  We further develop an $L^2(M,\\varphi_ρ)$-prediction theory: $E_t$ acts as the $L^2$-optimal predictor and yields a canonical innovation decomposition. For differentiable parametric families of normal states, we introduce an operator-valued Fisher information relative to $(N_t)$ and derive a noncommutative Cramér--Rao inequality giving a quantitative lower bound on conditional mean-square prediction error under information constraints; the bound is computed explicitly for compound Poisson lattice-jump models under the risk-neutral constraint $\\sum_αγ_α(e^{αΔx}-1)=r$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14350v1",
    "categories": [
      "math.DS",
      "math.SG"
    ],
    "authors": [
      "Agustin Moreno"
    ],
    "title": "Cone structures from a dynamical and probabilistic viewpoint",
    "abstract": "The goal of this note is to explore, from a geometric and probabilistic point of view, the dynamics of cone structures adapted to open book decompositions. This is inspired by the picture which arises in the study of the circular restricted three body problem (CR3BP). This yields geometric obstructions to reaching a point from another point in the phase space of the CR3BP.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14928v1",
    "categories": [
      "math.MG",
      "math.DG"
    ],
    "authors": [
      "Jun Kitagawa",
      "Asuka Takatsu"
    ],
    "title": "Barycenters in Disintegrated optimal transport",
    "abstract": "We prove existence and duality on a wide class of metric spaces, and uniqueness results on any connected, complete Riemannian manifold, with or without boundary, for classical Monge--Kantorovich barycenters. In particular, this is the first and only uniqueness result with no restriction on the geometry of the manifold aside from connectedness and completeness. We obtain these via the corresponding results for barycenter problems associated to a new two-parameter family of metrics on probability measures on a general metric fiber bundle, called the $\\textit{disintegrated Monge--Kantorovich metrics}$ (previously introduced by the authors).",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14907v1",
    "categories": [
      "math.FA",
      "math.OA"
    ],
    "authors": [
      "K. Bardadyn",
      "B. K. Kwaśniewski"
    ],
    "title": "Banach algebra crossed products by inverse semigroup actions",
    "abstract": "We give a self-contained and simplified presentation of the theory of covariant representations for inverse semigroup actions on Banach algebras, which was recently introduced in the authors and A. Mckee in the twisted case. The main result of this note is a general universal description of the associated Banach algebra crossed product, that allows disintegration of all representations of the crossed product. Such a disintegration was studied so far only for actions on spaces.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14904v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Raphael Yuster"
    ],
    "title": "On the maximum density of a matrix and a transcendental Turán-type density",
    "abstract": "We prove that the inducibility of $P_4$ in ordered monotone balanced bipartite graphs is $2/e^2$, establishing the smallest known graph with transcendental Turán-type density. Moreover, the limit object is a binary graphon, so it generates a deterministic model. This is a special case of a more general framework addressed here -- the asymptotic maximum density of a constant matrix over an arbitrary symbol set, in a large, possibly monotone, matrix. We solve all $2 \\times 2$ monotone cases (one of which corresponds to the aforementioned $P_4$) and all but one of the $2 \\times 2$ unrestricted cases.\n  While $(h!/h^h)^2$ is a lower bound for the asymptotic maximum density of an $h \\times h$ matrix, we explicitly construct, for all $h \\ge 1$, an $h \\times h$ minimizer, i.e., a matrix for which this bound is attained. We also sketch how known results on the inducibility of graphs can be modified to show that, as $h$ grows, almost all $h \\times h$ $0/1$ matrices are minimizers.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14866v1",
    "categories": [
      "math.AP",
      "math-ph",
      "math.FA",
      "math.OC"
    ],
    "authors": [
      "Gabriel Claret"
    ],
    "title": "Helmholtz transmission problem and intrinsic impedance scattering problem on extension domains",
    "abstract": "We consider a transmission problem for the Helmholtz equation across the boundary of an extension domain. A such boundary can be Lipschitz, fractal, or of varying Hausdorff dimension for instance. We generalise the notions of layer potential and Neumann-Poincar{é} operators, and of Calder{ó}n projectors in that context. Those boundary operators allow to connect the transmission problem (on the whole space) to one-sided problems -- notably, scattering problems -- with Dirichlet, Neumann and Robin boundary conditions. Since an extension domain needs no specific boundary measure, the Robin (impedance) condition is not understood in a boundary L^2-type space, rather by duality on the trace space itself. We discuss the well-posedness of the impedance scattering problem in that framework and compare to the classical L^2 setting. Our analysis allows to generalise optimisation results for acoustic scattering when the obstacle is an extension domain in any dimension.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14828v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Deniz Tuncer",
      "Burak Kocuk"
    ],
    "title": "MIQCP and MISOCP-Based Solution Methods for the Multi-Layer Thin Films Problem",
    "abstract": "The Multi-Layer Thin Films Problem is a materials science problem that aims to enhance the reflectance of a metallic substrate by designing multi-layer coatings composed of different dielectric materials and thicknesses. While previous studies on the problem mostly rely on heuristic approaches and are designed for single wavelength applications, this work addresses the problem using global optimization techniques for multiple wavelengths. We develop an exact nonconvex mixed-integer quadratically constrained programming (MIQCP) model to solve this problem. We also develop a mixed-integer second-order cone programming relaxation that has computational advantage over the MIQCP model. Our numerical experiments yield solutions that have average reflectance of 99% over the visible spectrum (380-770 nm) and 95% over the broad spectrum (300-3000 nm).",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14816v1",
    "categories": [
      "math-ph",
      "math.DS"
    ],
    "authors": [
      "Habib Ammari",
      "Clemens Thalhammer"
    ],
    "title": "A Real-Space Formulation of the Zak Phase via Weyl m-Functions",
    "abstract": "We establish a new, real-space formula for the Zak phase for one dimensional periodic Jacobi operators in terms of the Weyl $m_+$-function that does not rely on Floquet-Bloch theory. This novel representation highlights the dependence of the Zak phase on boundary terms. Moreover, we show how to recover the classical quantisation of the Zak phase for periodic Jacobi operators with inversion symmetric fundamental cells.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14803v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Yuhui Jiao",
      "Qian Zhang",
      "Xuejun Cheng",
      "Yunxiao Li",
      "Yufei Zhao",
      "Ju Liu",
      "Yong Liang Guan"
    ],
    "title": "Efficient Beamforming for Discrete SIM-Aided Multiuser Systems Under Statistical CSI",
    "abstract": "Stacked Intelligent Metasurfaces (SIM) have emerged as a revolutionary architecture for next-generation wireless communications, offering wave-domain signal processing capabilities with significantly reduced hardware complexity compared to conventional systems. However, most existing SIM research assumes continuous phase shifts and perfect instantaneous channel state information (CSI), which are impractical due to hardware discrete phase shift constraints and prohibitive pilot overhead. This paper presents a joint power allocation and discrete phase shift optimization framework for SIM-aided multiuser multiple-input single-output(MISO) downlink systems under statistical CSI. We formulate the achievable sum rate maximization problem considering practical discrete phase constraints and derive a closed-form expression for the average achievable rate under statistical CSI. To tackle the resulting non-convex optimization problem, we decouple the problem by using the weighted minimum mean square error (WMMSE) algorithm and alternating optimization (AO). Subsequently, we utilize the Lagrangian multiplier method and alternating direction method of multipliers (ADMM) to obtain closed-form iterative solutions. Our simulations demonstrate that the proposed algorithm reduces computational complexity by a factor of 50 compared to semi-definite relaxation (SDR) methods, , while maintaining over 85% of the continuous phase shift performance with only 1-bit quantization, highlighting its feasibility for low-cost hardware systems.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14794v1",
    "categories": [
      "math.NA",
      "cs.LG"
    ],
    "authors": [
      "Dimitrios G. Patsatzis",
      "Alessandro Della Pia",
      "Lucia Russo",
      "Constantinos Siettos"
    ],
    "title": "RANDSMAPs: Random-Feature/multi-Scale Neural Decoders with Mass Preservation",
    "abstract": "We introduce RANDSMAPs (Random-feature/multi-scale neural decoders with Mass Preservation), numerical analysis-informed, explainable neural decoders designed to explicitly respect conservation laws when solving the challenging ill-posed pre-image problem in manifold learning. We start by proving the equivalence of vanilla random Fourier feature neural networks to Radial Basis Function interpolation and the double Diffusion Maps (based on Geometric Harmonics) decoders in the deterministic limit. We then establish the theoretical foundations for RANDSMAP and introduce its multiscale variant to capture structures across multiple scales. We formulate and derive the closed-form solution of the corresponding constrained optimization problem and prove the mass preservation property. Numerically, we assess the performance of RANDSMAP on three benchmark problems/datasets with mass preservation obtained by the Lighthill-Whitham-Richards traffic flow PDE with shock waves, 2D rotated MRI brain images, and the Hughes crowd dynamics PDEs. We demonstrate that RANDSMAPs yield high reconstruction accuracy at low computational cost and maintain mass conservation at single-machine precision. In its vanilla formulation, the scheme remains applicable to the classical pre-image problem, i.e., when mass-preservation constraints are not imposed.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14629v1",
    "categories": [
      "math.OC",
      "cs.DS",
      "cs.LG"
    ],
    "authors": [
      "Yuze Chen",
      "Yuan Zhou",
      "Baichuan Mo",
      "Jie Ying",
      "Yufei Ruan",
      "Zhou Ye"
    ],
    "title": "Online Linear Programming with Replenishment",
    "abstract": "We study an online linear programming (OLP) model in which inventory is not provided upfront but instead arrives gradually through an exogenous stochastic replenishment process. This replenishment-based formulation captures operational settings, such as e-commerce fulfillment, perishable supply chains, and renewable-powered systems, where resources are accumulated gradually and initial inventories are small or zero. The introduction of dispersed, uncertain replenishment fundamentally alters the structure of classical OLPs, creating persistent stockout risk and eliminating advance knowledge of the total budget.\n  We develop new algorithms and regret analyses for three major distributional regimes studied in the OLP literature: bounded distributions, finite-support distributions, and continuous-support distributions with a non-degeneracy condition. For bounded distributions, we design an algorithm that achieves $\\widetilde{\\mathcal{O}}(\\sqrt{T})$ regret. For finite-support distributions with a non-degenerate induced LP, we obtain $\\mathcal{O}(\\log T)$ regret, and we establish an $Ω(\\sqrt{T})$ lower bound for degenerate instances, demonstrating a sharp separation from the classical setting where $\\mathcal{O}(1)$ regret is achievable. For continuous-support, non-degenerate distributions, we develop a two-stage accumulate-then-convert algorithm that achieves $\\mathcal{O}(\\log^2 T)$ regret, comparable to the $\\mathcal{O}(\\log T)$ regret in classical OLPs. Together, these results provide a near-complete characterization of the optimal regret achievable in OLP with replenishment. Finally, we empirically evaluate our algorithms and demonstrate their advantages over natural adaptations of classical OLP methods in the replenishment setting.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15010v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Marcelo M. Disconzi",
      "Zhongtian Hu",
      "Chenyun Luo"
    ],
    "title": "On a Class of Global Solutions to 3D Free-Boundary Relativistic Euler Equations with a Physical Vacuum Boundary",
    "abstract": "We consider the free-boundary relativistic Euler equations in Minkowski spacetime $\\mathbb{M}^{1+3}$ equipped with a physical vacuum boundary, which models the motion of a relativistic gas. We concern ourselves with the family of isentropic, barotropic, and polytropic gas, with an equation of state $p = ρ^{1+κ}, κ\\in (0,\\frac23]$. We construct an open class of initial data that launches future-global solutions. Such solutions are spherically symmetric, have small initial density, and expand asymptotically linearly in time. In particular, the asymptotic rate of expansion is allowed to be arbitrarily close to the speed of light. Therefore, our main result is far from a perturbation of existing results concerning the classical isentropic Euler counterparts.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15009v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Soumendu Roy",
      "Karthika Ramasamy",
      "Lavanya Kumar",
      "Purabi Jana"
    ],
    "title": "Characterizations of $\\ast$-Ricci-Bourguignon solitons on Kenmotsu manifolds",
    "abstract": "In this paper, we have found some features of $\\ast$- Ricci Bourguignon Soliton on Kenmotsu manifold. We estimated the conditions for $\\ast$-Ricci Bourguignon on Kenmotsu manifold to be compressing, balancing or enlarging accordingly. We have found some curvature properties of Kenmotsu manifold admitting $\\ast$-Ricci Bourguignon Soliton. Additionally, we have featured $\\ast$-Ricci Bourguignon on Kenmotsu manifold with torse-forming vector field. Finally, we proved an example of $5$-dimensional Kenmotsu manifold on $\\ast$-Ricci Bourguignon Soliton.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14988v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Sacha Goldman"
    ],
    "title": "The Torsion of Automorphisms of Nilpotent Spaces",
    "abstract": "We reprise a $K_1$-valued refinement of Whitehead torsion originally studied by Gersten. We use this Gersten torsion to show that for nilpotent spaces with infinite fundamental group, any self-equivalence which acts as the identity on the fundamental group has vanishing Whitehead torsion. We find two applications of our vanishing result. First, we provide many examples of spaces with infinitely many simple structures. Second, we conclude that the group of homotopy classes of simple self-equivalences of a connected nilpotent space that act as the identity on the fundamental group is commensurable to an arithmetic group, building on a theorem of Sullivan. We also give a corrected version of Sullivan's proof as an appendix.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14935v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Lynn Heller",
      "Sebastian Heller",
      "Martin Traizet"
    ],
    "title": "The Enclosed Volume for Periodic Constant Mean Curvature Surfaces",
    "abstract": "We establish a general formula for the enclosed volume of constant mean curvature (CMC) surfaces in Euclidean three space with translational periods forming a lattice. The formula relates the volume to the surface area, a Wess-Zumino-Witten-type term, and a newly defined curvature term of the associated family of flat connections, thereby extending the classical Minkowski formula for closed CMC surfaces. Interpreting the volume as a gauge-invariant quantity, we apply the result to a variety of examples and provide explicit computations. As an application, we construct a counterexample to the isoperimetric problem in $\\mathbb{T}^2 \\times \\mathbb{R}$, disproving the conjecture that minimizers are restricted to spheres, cylinders, or pairs of planes.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15276v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ruben Carpenter",
      "Colin Defant",
      "Noah Kravitz"
    ],
    "title": "On the number of permutation-twisted dot products",
    "abstract": "For distinct real numbers $a_1, \\ldots, a_n$ and distinct real numbers $b_1, \\ldots, b_n$, consider the sum $S=\\sum_{i=1}^n a_i b_{π(i)}$ as $π$ ranges over the permutations of $[n]$. We show that this sum always assumes at least $Ω(n^3)$ distinct values, which is optimal. This ``support'' bound complements recent work of Do, Nguyen, Phan, Tran, and Vu on the anticoncentration properties of $S$ when $π$ is chosen uniformly at random.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15272v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ronald Orozco López"
    ],
    "title": "Lucas-Pantograph Type Exponential, Trigonometric, and Hyperbolic Functions",
    "abstract": "In this paper, we include some new results for the Lucas calculus. A Lucas-Pantograph type exponential function is introduced. Additionally, we define Lucas-Pantograph type trigonometric functions, and some of their most notable identities are given: parity, sum and difference formulas, Pythagorean identities, double-angle identities, and some special values. Lucas-Pantograph type hyperbolic functions are also introduced.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15271v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Robert Wilms"
    ],
    "title": "On the Faltings height of the curve $y^2=x^n-1$",
    "abstract": "We compute the stable Faltings height of the hyperelliptic curve $X_n\\colon y^2=x^{n}-1$ for every odd integer $n\\ge 3$ in terms of special values of Euler's gamma function. In particular, we prove the bounds $$-0.975n< h_{\\mathrm{Fal}}(X_n)-\\tfrac{n}{8}\\log n<\\tfrac{9}{64}n\\log\\log n-0.263n.$$ As an application, we bound the Faltings height of any abelian variety with complex multiplication by the canonical CM-type of the $n$-th cyclotomic field by $\\frac{n}{8}\\log n+\\frac{9}{64}n\\log\\log n-0.136n$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15270v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Hirotaka Onuki"
    ],
    "title": "Global $+$-regularity of regular del Pezzo surfaces in mixed characteristic",
    "abstract": "Let $R = W(k)$ be the ring of Witt vectors over an algebraically closed field $k$ of characteristic $p > 2$. Let $M$ be a three-dimensional regular integral flat projective $R$-scheme such that $H^0(M,\\mathcal{O}_M) = R$ and the anticanonical sheaf $ω_M^{-1}$ is ample. We show that $M$ is globally $+$-regular if the closed fiber $M_k$ is reduced.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15252v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Jamie Fravel",
      "Robert Hildebrand"
    ],
    "title": "Automating Idealness Proofs for Binary Programs with Application to Rectangle Packing",
    "abstract": "An integer program is called ideal if its continuous relaxation coincides with its convex hull allowing the problem to be solved as a continuous program and offering substantial computational advantages. Proving idealness analytically can be extraordinarily tedious -- even for small formulations -- such proofs often span many pages of intricate case analysis which motivates the development of automated verification methods. We develop a general-purpose framework for certifying idealness in Mixed Binary Linear Programs (MBLPs), formulating the verification problem as a linear program when the data is fixed and as a nonconvex quadratic program when the data is parametric. We apply this framework to study several formulations of the rectangle packing problem that are conjectured to be pairwise-ideal, obtaining computational proofs where analytic proofs were previously unknown or impractical. As our second contribution, we introduce and model a novel generalization of the rectangle packing problem that enforces edge clearances between selected rectangles. We present both existing and novel MBLP formulations which arise from different encodings of the underlying disjunctive constraints. We perform some computational experiments on these formulations under a strip-packing objective to determine the importance of pairwise-idealness in practice.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15243v1",
    "categories": [
      "math.AC",
      "math.CO"
    ],
    "authors": [
      "Adam LaClair",
      "Matthew Mastroeni",
      "Jason McCullough",
      "Irena Peeva"
    ],
    "title": "Koszul Binomial Edge Ideals",
    "abstract": "As the binomial edge ideal of a graph is always generated by homogeneous quadratic polynomials corresponding to the edges of the graph, the question of when a binomial edge ideal defines a Koszul algebra has been studied by many authors ever since the class of ideals was first defined. Several partial results are known, including a characterization of those binomial edge ideals that possess a quadratic Gröbner basis. However, a complete characterization of the graphs determining Koszul binomial edge ideals has remained elusive. Inspired by our recent work characterizing when the graded Möbius algebras of graphic matroids are Koszul, we answer the question once and for all by proving that a graph defines a Koszul binomial edge ideal if and only if it is strongly chordal and claw-free.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15242v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Kush Kinra",
      "Fernanda Cipriano"
    ],
    "title": "Optimal control problem associated with three-dimensional critical convective Brinkman-Forchheimer equations",
    "abstract": "In this article, we are concerned about the velocity tracking optimal control problem for 3D critical convective Brinkman-Forchheimer equations defined on a simply connected bounded domain $\\mathbb{D}\\subset\\mathbb{R}^3$ with $\\mathrm{C}^2$-boundary $\\partial\\mathbb{D}$. The control is introduced through an external force. The objective is to optimally minimize a velocity tracking cost functional, for which the velocity vector field is oriented towards a target velocity. Most importantly, we are concerned about the first-order necessary optimality conditions for above-mentioned optimal control problem which is the main challenging task of this article. To overcome the difficulties related to the differentiability of the control-to-state mapping, consequence of the lack of regularity of the state variable on bounded domains, we first establish some intermediate optimality conditions and then pass to the limit.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15238v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Cyril Imbert"
    ],
    "title": "De Giorgi's regularity theory for elliptic, parabolic and kinetic equations",
    "abstract": "This book presents a comprehensive regularity theory for solutions of elliptic, parabolic, and kinetic equations. The foundation of this theory was laid by E. De Giorgi's groundbreaking resolution of Hilbert's nineteenth problem in 1956. The innovative tools he developed to tackle this problem proved to be remarkably versatile. In 1957, just one year later, J. Nash independently developed analogous techniques for parabolic equations, concurrently with De Giorgi's research. By the year 2000, these techniques had been extended to address elliptic and parabolic equations featuring integral diffusion, such as the fractional Laplacian. More recently, the theory has evolved to encompass kinetic equations, accommodating both local and integral diffusions. This book aims to present these results in a unified and coherent manner, beginning with the classical elliptic framework and progressing through to the most recent advancements in kinetic equations.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15229v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Franz Lemmermeyer"
    ],
    "title": "Vieta jumping and small norms in quadratic number fields",
    "abstract": "In this article we explain the connection between the famous problemfrom the IMO 1988 and elements of small norms in quadratic number fields with parametrized units.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15213v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Railane Antonia",
      "Marcos P. Cavalcante",
      "Vinicius Souza"
    ],
    "title": "Second Robin eigenvalue bounds for Schrödinger operators on Riemannian surfaces",
    "abstract": "Let $(Σ^2,ds^2)$ be a compact Riemannian surface, possibly with boundary, and consider Schrödinger-type operators of the form $L=Δ+V-aK$ together with natural Robin and Steklov-type boundary conditions incorporating a boundary potential $W$ and (in the curvature-corrected setting) the geodesic curvature $κ_g$ of $\\partialΣ$. Our main contribution is a geometric upper bound for the second Robin eigenvalue in terms of the topology of $Σ$ and the integrals of $V$ and $W$, obtained via a Hersch balancing argument on the capped surface. As a geometric application, we derive sharp topological restrictions for compact two-sided free boundary minimal surfaces of Morse index at most one inside geodesic balls of negatively curved pinched Cartan--Hadamard $3$-manifolds under a mild radius condition. We also prove complementary upper bounds for first eigenvalues in the closed and Robin settings, including rigidity in the curvature-corrected case, and we establish Steklov-type estimates in a coercive regime where the Dirichlet-to-Neumann operator is well defined for all boundary data.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15206v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Jos\\é Francisco Rodrigues",
      "Lisa Santos"
    ],
    "title": "Variational and Quasi-variational solutions to thick flows",
    "abstract": "We formulate the flow of thick fluids as evolution variational and quasi-variational inequalities, with a variable threshold on the absolute value of the deformation rate tensor. In the variational case, we show the existence and uniqueness of strong and weak solutions in the viscous case and also the existence of strong and weak solutions in the inviscid case. These problems correspond to solve, respectively, the Navier-Stokes and the Euler equations with an additional generalised Lagrange multiplier associated with the threshold on the deformation rate tensor. Applying the continuous dependence of strong and weak solutions to the variational inequalities for the Navier-Stokes with constraints on the derivatives, and on their respective generalised Lagrange multipliers, we can solve the case of the variable threshold depending on the solution itself that correspond to quasi-variational problems.\n  \\vspace{2mm}\n  $$ \\text{Dedicated to Vsevolod Alekseevich Solonnikov, {\\em in memoriam}}$$",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15184v1",
    "categories": [
      "math.OC",
      "math-ph",
      "quant-ph"
    ],
    "authors": [
      "Julius A. Zeiss",
      "Gereon Koßmann",
      "René Schwonnek",
      "Martin Plávala"
    ],
    "title": "Finite de Finetti for convex bodies and Polynomial Optimization",
    "abstract": "Leveraging a recently proposed notion of relative entropy in general probabilistic theories (GPT), we prove a finite de Finetti representation theorem for general convex bodies. We apply this result to address a fundamental question in polynomial optimization: the existence of a convergent outer hierarchy for problems with inequality constraints and analytical convergence guarantees. Our strategy generalizes a quantitative monogamy-of-entanglement argument from quantum theory to arbitrary convex bodies, establishing a uniform upper bound on mutual information in multipartite extensions. This leads to a finite de Finetti theorem and, subsequently, a convergent conic hierarchy for a wide class of polynomial optimization problems subject to both equality and inequality constraints. We further provide a constructive rounding scheme that yields certified interior points with controlled approximation error. As an application, we express the optimal GPT value of a two-player non-local game as a polynomial optimization problem, allowing our techniques to produce approximation schemes with finite convergence guarantees.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15174v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Xinrong Zhao"
    ],
    "title": "Combinatorial Ricci Flows and Hyperbolic Structures on a Class of Compact $3$-Manifolds with Boundary",
    "abstract": "In this paper, we study a combinatorial Ricci flow on closed pseudo $3$-manifolds $(M,\\mathcal{T})$. We prove that if every edge in the triangulation $\\mathcal{T}$ has valence at least $9$, then the combinatorial Ricci flow converges exponentially fast to a hyperbolic metric. As a consequence, for any compact $3$-manifold $N$ with boundary admitting an ideal triangulation $\\mathcal{T}_N$ whose edges all have valence at least $9$, there exists a unique complete hyperbolic metric with totally geodesic boundary on $N$ such that $\\mathcal{T}_N$ is isotopic to a geometric decomposition of $N$. This provides a partial solution to the conjecture of Costantino, Frigerio, Martelli and Petronio, and hence an affirmative answer of Thurston's geometric ideal triangulation conjecture for such manifolds. Moreover, we obtain explicit upper and lower bounds for the resulting hyperbolic metric.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15166v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Ashok S Kumar",
      "Shashank Shekhar",
      "Gokularam Muthukrishnan",
      "Muralikrishnan Srinivasan",
      "Sheetal Kalyani"
    ],
    "title": "Integrating OTFS in Airplane-Aided Next-Generation Networking",
    "abstract": "Next-generation networks explore the opportunistic assistance of airliner/high-altitude platforms (HAPs) in delivering high data rates for terrestrial networks to ensure consistent and reliable communication. When an airliner/HAP moves at very high speeds, its mobility has a substantial impact on ensuring seamless connectivity, stable signal strength, and reliable data transmission. Orthogonal time frequency space (OTFS) modulation has been shown to provide notable improvement in performance when handling Doppler effects during high-mobility situations. This paper presents an OTFS-based airplane-aided next-generation networking system. In the proposed system, the airliner/HAPs are equipped with a planar antenna array that applies null steering beamforming (NSB) at the transmitter for communication with terrestrial users. A comprehensive performance comparison between OTFS and orthogonal frequency division multiplexing (OFDM) is performed under varying airliner altitude, velocity, array dimension, and Rician factor conditions. The simulation results show that OTFS consistently outperforms OFDM, achieving a lower bit error rate (BER) and more stable performance across different airliner altitudes, velocities, array dimensions, and propagation environments.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15107v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Pavel Drábek",
      "Soyeun Jung",
      "Eunkyung Ko",
      "Michaela Zahradníková"
    ],
    "title": "Traveling waves for bistable reaction-diffusion-convection equations with discontinuous density-dependent coefficients",
    "abstract": "Continuing our previous study \\cite{DJKZ} on the monostable reaction-diffusion-convection equation, we analyze the bistable case under weak regularity assumptions. Our approach applies monostable results on the subintervals where the reaction term $g$ has constant sign, thereby establishing both existence and nonexistence of bistable traveling wave solutions. We extend the results of \\cite{MMM04}, obtained for $p=2$ under higher regularity assumptions ($d \\in C^1[0,1]$, $g,h \\in C[0,1]$), to the $p$-Laplacian with $p>1$ in our weak regularity setting.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15090v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Mehrnaz Anvari",
      "Marius Neuwirth",
      "Okan Akca",
      "Luna Lütz",
      "Simon Lukas Bussmann",
      "Tobias Fleiter",
      "Bernhard Klaassen"
    ],
    "title": "From carbon management strategies to implementation: Modeling and physical simulation of CO2 pipeline infrastructure - a case study for Germany",
    "abstract": "Carbon capture and storage or utilization (CCUS) will play an important role to achieve climate neutrality in many economies. Pipelines are widely regarded as the most efficient means of CO2 transport; however, they are currently non-existent. Policy-makers and companies need to develop large-scale infrastructure under substantial uncertainty. Methods and analyses are needed to support pipeline planning and strategy development. This paper presents an integrated method for designing CO2 pipeline networks by combining energy system scenarios with physical network simulation. Using Germany as a case study, we derive spatially highly resolved CO2 balances to develop a dense-phase CO2 pipeline topology that follows existing gas pipeline corridors. The analyzed system includes existing sites for cement and lime production, waste incineration, carbon users, four coastal CO2 hubs, and border crossing points. We then apply the multiphysical network simulator MYNTS to assess the technical feasibility of this network. We determine pipeline diameters, pump locations, and operating conditions that ensure stable dense-phase transport. The method explicitly accounts for elevation and possible impurities. The results indicate that a system of about 7000 km pipeline length and a mixed normed diameter of DN700 on main corridors and of DN500/DN400 on branches presents a feasible solution to connect most sites. Investment costs for the optimized pipeline system are calculated to be about 17 billion Euros. The method provides a reproducible framework and is transferable to other countries and to European scope.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15052v1",
    "categories": [
      "math.RA",
      "math-ph"
    ],
    "authors": [
      "Nicolas Crampé",
      "Wolter Groenevelt",
      "Quentin Labriet",
      "Lucia Morey",
      "Luc Vinet",
      "Carel Wagenaar"
    ],
    "title": "Bispectral rational functions and Leonard trios",
    "abstract": "It is well-known that Leonard pairs have a close connection with bispectral orthogonal polynomials of the Askey scheme. In this paper, we introduce the notion of a Leonard trio $(V,\\oV,Z)$, an algebraic structure extending Leonard pairs, for which the overlap coefficients of eigenfunctions of $V$ and $\\oV$ are biorthogonal rational functions satisfying generalized eigenvalue problems. We introduce and start the classification of irreducible Leonard trios by using its connection with Leonard pairs and Heun operators. In particular, we show that Wilson's rational functions appear as overlap coefficients, prove its difference, recurrence and biorthogonality relations, and obtain a summation formula expressing them as a finite sum of products of two $q$-Racah polynomials. We also begin to investigate reduced Leonard trios, for which the general eigenvalue problem simplifies to a $R_I$-type recurrence relation. As an illustration, we present an example of this in which the rational functions appearing as overlap coefficients can be expressed as a ${}_{4}φ_3$ and are associated with a Leonard pair of dual $q$-Hahn type.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15022v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Anna Siffert"
    ],
    "title": "The Initial Value Problem for Harmonic maps of Cohomogeneity One manifolds",
    "abstract": "We set up and solve the initial value problem for equivariant harmonic maps of cohomogeneity one manifolds, i.e. we show the local existence of a harmonic map in the neighborhood of a singular orbit. Furthermore, we present some theory of regular-singular systems of first order.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14987v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "AmirPouya Moeini",
      "Albert Guillén i Fàbregas"
    ],
    "title": "Random Gilbert-Varshamov Codes for Joint Source-Channel Coding",
    "abstract": "We propose a random coding technique for joint source-channel coding of discrete memoryless sources and channels. The approach builds on the random Gilbert-Varshamov code construction of Somekh-Baruch et al. and extends it to the joint source-channel setting. We show that the resulting ensemble attains the maximum of the random-coding and expurgated error exponents.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15268v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Jesse Jääsaari"
    ],
    "title": "On the Real Zeroes of Half-integral Weight Hecke Cusp Forms, II",
    "abstract": "We show that for $\\gg K^2$ of the half-integral weight Hecke cusp forms in the Kohnen plus subspace with weight bounded by a large parameter $K$, the number of \"real\" zeroes grows at the expected rate. A key technical step in the proof is to obtain sharp bounds for the mollified first and second moments of quadratic twists of modular $L$-functions.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15259v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Florian Kogelbauer"
    ],
    "title": "Non-Hydrodynamic Solutions to the linear Density-dependent BGK equation",
    "abstract": "We prove the existence of non-hydrodynamic solutions to the linear density-dependent BGK equation in $d$ dimensions. Specifically, we show the existence of an initial condition for any Knudsen number $τ$ for which the dissipation rate of the macroscopic mass density diverges $\\sim 1/τ$. Our results rely on a detailed spectral analysis of the linear BGK operator, an explicit solution formula for the time-dependent problem using a combination of Fourier series with the Laplace transform and subsequent contour integration arguments from complex analysis.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15245v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Domagoj Bradač",
      "Jacob Fox",
      "Raphael Steiner",
      "Benny Sudakov",
      "Shengtong Zhang"
    ],
    "title": "Coloring small locally sparse degenerate graphs and related problems",
    "abstract": "The classic upper bound on the chromatic number of $d$-degenerate graphs is $d+1$, shown to be tight by complete graphs. A natural question is whether this bound remains tight if one forbids large cliques. Classic constructions of Tutte and Zykov from the early 50s show that there exist $d$-degenerate $(d+1)$-chromatic graphs that are triangle-free, however these constructions grow rapidly with $d$. Motivated by this and addressing a problem posed by the second author at the Oberwolfach Graph Theory workshop, we prove that the minimum order $f(d)$ of a $d$-degenerate triangle-free graph of chromatic number $d+1$ satisfies $e^{Ω(d)}\\le f(d)\\le e^{O(d^2\\log d)}.$ The lower bound follows from a novel upper bound on the chromatic number of triangle-free graphs: Every triangle-free $d$-degenerate graph $G$ on $n \\le e^{O(d)}$ vertices satisfies $$χ(G)\\le O\\left(\\frac{d}{\\log\\left(d/\\log n\\right)}\\right).$$ We extend this to a more general result about degenerate graphs with sparse neighborhoods, which has applications to many graph coloring problems: For example, we prove that every counterexample to Hadwiger's conjecture with parameter $t$ must have a complete bipartite subgraph with one exponentially large side ($K_{a,b}$ where $a=(\\log t)^{1/2-o(1)}$ and $b=e^{t^{1-o(1)}}$) or a small and very dense subgraph (of order $\\le t$ with $t^{2-o(1)}$ edges) in some neighborhood.\n  For the upper bound on $f(d)$ we establish a surprising connection between $f(d)$ and the on-line-chromatic number $g(n)$ of $n$-vertex triangle-free graphs. We also give an asymptotic improvement of the previous best upper bound for $g(n)$ due to Lovász, Saks and Trotter from 1989.\n  Along the way we disprove a generalization of Harris' fractional coloring conjecture to graphs of bounded clique number and raise numerous problems which open up interesting directions to explore for future research.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15223v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Kush Kinra"
    ],
    "title": "Large time behaviour for a class of 2D and 3D stochastic non-Newtonian fluids of differential types: Attractors and invariant measures",
    "abstract": "This study investigates a stochastic version of a class of non-Newtonian fluids governed by third-grade fluid equations, which exhibit complex and highly nonlinear dynamics. In particular, we address the random dynamics and asymptotic behavior of stochastic third-grade fluid equations (STGFEs) driven by a \\emph{linear multiplicative Itô-type white noise} on general domains $\\mathbb{Q}\\subseteq\\mathbb{R}^d$, $d\\in\\{2,3\\}$. We first prove that the non-autonomous STGFEs generate a continuous non-autonomous random dynamical system $Φ$, and we establish the existence of a pullback absorbing set. Using compact Sobolev embeddings on bounded domains and uniform tail estimates on unbounded domains, we show the pullback asymptotic compactness of $Φ$, which leads to the existence of pullback random attractors that are compact and attracting in $\\mathbb{L}^2(\\mathbb{Q})$. As a consequence, we demonstrate the existence of an invariant measure associated with the STGFEs and, exploiting the linear multiplicative structure of the noise along with the exponential stability of solutions, we prove uniqueness of the invariant measure in the case of zero external forcing. These results are entirely new for STGFEs on general domains, and, in particular, the existence of pullback random attractors with linear multiplicative noise is obtained here for the first time. We further note that, unlike Stratonovich noise, which is widely used in the literature to study random attractors, Itô noise is more appropriate for domains that do not satisfy the Poincaré inequality. Overall, this work resolves several open problems regarding random attractors, invariant measures, and ergodicity for stochastic third-grade fluids on general unbounded domains $\\mathbb{Q}\\subseteq\\mathbb{R}^d$, $d\\in\\{2,3\\}$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15218v1",
    "categories": [
      "math.OC",
      "math.AP"
    ],
    "authors": [
      "Luigi De Pascale",
      "Igor Pinheiro"
    ],
    "title": "Some reverse inequality in optimal mass transportation",
    "abstract": "Controlling the $\\mathcal W_\\infty$ Wasserstein distance by the $\\mathcal W_p$ Wasserstein distance is interesting both for theorical and numerical applications. A first paper on this problem was written several years ago [3]. Some year later [14] framed it in the same inequality for more general costs which increase with the distance. In this paper, we prove this type of inequality for optimal transport problems with pointwise cost which is a decreasing function of the distance. We show, in particular, that there is a general framework that encompasses all the cases above.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15185v1",
    "categories": [
      "math.GR",
      "math.GN"
    ],
    "authors": [
      "Luna Elliott"
    ],
    "title": "The Zariski Topology on Homeomorphism groups",
    "abstract": "The Zariski topology on a group G is the coarsest topology such that all sets of the form $\\{x \\in G | 1_G \\neq g_0 x^{k_0} g_1 ... g_{l-1} x^{k_{l-1}} g_l\\}$ are open. Originally introduced by Bryant as the verbal topology, it serves as a fundamental tool for investigating the topological structure of infinite groups and is always a $T_1$ topology with continuous shifts and inversion. Since the Zariski topology is coarser than every Hausdorff group topology on G, it provides a natural starting point for topologizing groups; specifically, for countable or abelian groups, it is known that the Zariski topology coincides with the Markov topology-the intersection of all Hausdorff group topologies on G.\n  In this paper, we analyze the Zariski topology on various homeomorphism groups. We demonstrate that for the Thompson groups F and T, the Zariski (and thus Markov) topology coincides with the standard compact-open topology derived from their respective actions on $[0,1]$ and $S^1$. In contrast, we show that the Zariski (and thus Markov) topology on Thompson's group V is irreducible, and therefore neither Hausdorff nor a group topology. As V acts highly transitively on each of its orbits, this result stands in notable opposition to a theorem by Banakh et al, which establishes that the Zariski topology on any permutation group containing all finitely supported elements is a Hausdorff group topology.\n  We also extend these investigations to Homeo$([0,1])$, Homeo$(S^1)$, and Homeo$(2^ω)$. We conclude by providing a classification of the topological manifolds $M$ for which the homeomorphism group Homeo$(M)$ admits a Hausdorff Zariski topology.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15143v1",
    "categories": [
      "math.AP",
      "math.FA"
    ],
    "authors": [
      "Nicola Garofalo",
      "Annunziata Loiudice",
      "Dimiter Vassilev"
    ],
    "title": "Fractional operators and Sobolev spaces on homogeneous groups",
    "abstract": "We establish foundational properties of fractional operators on Lie groups of homogeneous type. We prove embedding theorems for the associated Sobolev-type spaces.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15117v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Stefano Pasquero"
    ],
    "title": "An alternative approach to the Painlevé paradox through constitutive characterization of constraints in impulsive Mechanics",
    "abstract": "We frame the Painlevè mechanical system, which has been extensively studied because of the paradox it generates, within the class of Regular Geometric Impulsive Mechanical Systems (RGIMS), by modeling it as a mechanical system subject to a rough unilateral positional constraint $\\cal{S}$, where friction is represented by an instantaneous kinetic constraint $\\cal{B}$, internal to $\\cal{S}$ and of impulsive nature. The evolution of the system is therefore determined by the choice of a constitutive characterization for these constraints, a choice that restores mechanical determinism and eliminates any paradoxical aspects of the system's behavior, in agreement with experimental evidence. It is shown that, similarly to what occurs in general non ideal impulsive systems, the choice of a constitutive characterization of the constraint system depends on the determination of two numerical coefficients $σ$ and $β$, which depend on the kinematic and mass-related data of the system, and possibly also on physical quantities not strictly of a mechanical nature, such as material properties. The simplicity of the model also allows for a straightforward experimental analysis of the system's behavior and for the experimental determination of the values of these coefficients.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15113v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Yixuan Huang",
      "Jie Yang",
      "Chao-Kai Wen",
      "Xiao Li",
      "Shi Jin"
    ],
    "title": "Physics-Informed Wireless Imaging with Implicit Neural Representation in RIS-Aided ISAC System",
    "abstract": "Wireless imaging is emerging as a key capability in next-generation integrated sensing and communication (ISAC) systems, supporting diverse context-aware applications. However, conventional imaging approaches, whether based on physical models or data-driven learning, face challenges such as accurate multipath separation and representative dataset acquisition. To address these issues, this study explores the use of implicit neural representation (INR), a paradigm that has achieved notable advancements in computer vision, for wireless imaging in reconfigurable intelligent surface-aided ISAC systems. The neural network of INR is specifically designed with positional encoding and sine activation functions. Leveraging physics-informed loss functions, INR is optimized through deep learning to represent continuous target shapes and scattering profiles, enabling resolution-agnostic imaging with strong generalization capability. Extensive simulations demonstrate that the proposed INR-based method achieves significant improvements over state-of-the-art techniques and further reveals the focal length characteristics of the imaging system.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15082v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Marthe Bonamy",
      "Zdeněk Dvořák",
      "Lukas Michel",
      "David Mikšaník"
    ],
    "title": "Characterization of sparse monotone graph classes with bounded domination-to-2-independence ratio",
    "abstract": "We give an exact characterization of monotone graph classes C with bounded average degree that satisfy the following property: The domination number of every graph from C is bounded by a linear function of its 2-independence number.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15070v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Gerardo Cicalese",
      "Gabriele Ciaramella",
      "Ilario Mazzieri",
      "Martin J. Gander"
    ],
    "title": "Optimized Schwarz Waveform Relaxation for the Damped Wave Equation",
    "abstract": "The performance of Schwarz Waveform Relaxation is critically dependent on the choice of transmission conditions. While classical absorbing conditions work well for wave propagation, they prove insufficient for damped wave equations, particularly in viscoelastic damping regimes where convergence becomes prohibitively slow. This paper addresses this limitation by introducing a more general transmission operator with two free parameters for the one-dimensional damped wave equation. Through frequency-domain analysis, we derive an explicit expression for the convergence factor governing the convergence rate. We propose and compare two optimization strategies (L-infinity and L-2 minimization) for determining optimal transmission parameters. Numerical experiments demonstrate that our optimized approach significantly accelerates convergence compared to standard absorbing conditions, especially for viscoelastic damping cases. The method provides a computationally efficient alternative to exhaustive parameter search while maintaining robust performance across different damping regimes.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15266v1",
    "categories": [
      "math.GR",
      "math.RT"
    ],
    "authors": [
      "Pierre-Emmanuel Caprace",
      "Geoffrey Janssens",
      "François Thilmany"
    ],
    "title": "Center-preserving irreducible representations of finite groups",
    "abstract": "Given finite groups $H \\leq G$, a representation $σ$ of $G$ is called center-preserving on $H$ if the only elements of $H$ that become central under $σ$ are those that were already central in $G$. We prove that if $H$ has a faithful irreducible representation $ρ$, then at least one of the irreducible components of the induction $\\operatorname{Ind}_H^G(ρ)$ is center-preserving on $H$. In consequence, $H$ has a faithful irreducible representation if and only if every finite group $G$ containing $H$ as a subgroup has an irreducible representation whose restriction to $H$ is faithful, and which is center-preserving on $H$. In addition, we give examples illustrating the sharpness of the statement, and discuss the connection with projective representations.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15244v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Miguel Guerrero-Castillo"
    ],
    "title": "The Wahl map of the normalization of nodal curves on Hirzebruch surfaces",
    "abstract": "In this paper we study the Wahl map for the normalization of a $δ$-nodal curve $C$ on a Hirzebruch surface $\\mathbb{F}_{n}$ for $n\\geq 0$. Let $σ:X\\rightarrow \\mathbb{F}_{n}$ be the blow up of $\\mathbb{F}_{n}$ along the $δ$ nodes of $C$ and let $\\widetilde{C}$ be the normalization of $C$ under $σ$. Let $K_{X}$ be the canonical bundle of $X$ and let $Ω^{1}_{X}$ be the sheaf of $1$-holomorphic forms on $X$. We give conditions for the surjectivity of the map $Φ_{X,\\mathcal{O}_{X}(K_{X}+\\widetilde{C})}: \\bigwedge^{2}H^{0}(X,\\mathcal{O}_{X}(K_{X}+\\widetilde{C}))\\rightarrow H^{0}(X,Ω^{1}_{X}(2K_{X}+2\\widetilde{C}))$. Using this surjectivity, we analyze the Wahl map $Φ_{\\widetilde{C}}:\\bigwedge^{2}H^{0}(\\widetilde{C},Ω^{1}_{\\widetilde{C}})\\rightarrow H^{0}(\\widetilde{C},(Ω^{1}_{\\widetilde{C}})^{\\otimes 3})$ and compute the corank of $Φ_{\\widetilde{C}}$ in various cases. We prove that the corank of the Wahl map for the normalization of a $δ$-nodal curve on $\\mathbb{F}_{n}$ is $h^{0}(\\mathbb{F}_{n},\\mathcal{O}_{\\mathbb{F}_{n}}(-K_{\\mathbb{F}_{n}}))$, that verifies a conjecture by Wahl. Furthermore, as an application of our results, we demonstrate that, under certain conditions, a $δ$-nodal curve on a Hirzebruch surface $\\mathbb{F}_{n}$ cannot be embedded as $δ-$nodal curve on a different Hirzebruch surface $\\mathbb{F}_{m}$, for $n\\neq m$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15215v1",
    "categories": [
      "math.PR",
      "math.OA"
    ],
    "authors": [
      "Nicolas Gilliers",
      "David Jekel"
    ],
    "title": "Bigraph independence : a mixture of the five natural independences",
    "abstract": "We introduce a notion of non-commutative joint independence for multiple algebras in a non-commutative probability space. The pairwise relationships between these algebras are encoded by a graph with two edge sets -- a combinatorial structure we call a bigraph -- and naturally encompass the five fundamental types of independence: tensor, free, (anti)monotone, and Boolean. It subsumes the BMT independence of Arizmendi--Mendoza--Vazquez-Becerra (when all pairwise relationships are Boolean, (anti)monotone, or tensor) and the $ε$ or $Λ$-independence of Mlotkowski (when the pairwise relationships are tensor and free). We present explicit combinatorial moment formulas, a Hilbert space construction, and natural associativity relations within this setting. Furthermore, we demonstrate that bigraph independence emerges in the asymptotic behavior of tensor product random matrix models with respect to a vector state, encompassing the Charlesworth--Collins model for $\\varepsilon$-independence as a special case and offering a random matrix perspective on BMT independence.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15179v1",
    "categories": [
      "math.HO"
    ],
    "authors": [
      "Maria Luisa Acuña Fuentes",
      "Édouard Thomas"
    ],
    "title": "Role of (periodic as well as aperiodic) tessellations in contemporary composition. The cases of Tesselles sonores and Le Chapeau à douze cornes by Marisa Acuña",
    "abstract": "The recent discovery of a family of aperiodic monotiles, which includes David Smith's famous Hat, has shaken the field of plane tessellations. Music composers have already utilised the visual representation of plane tilings in their artwork (Tom Johnson through his use of Vuza's canons, talea and color in isorhythmic motets...). Constructions of the Hat from elementary geometric polygons provide a different perspective, for example through the sound transformation of microtonal intervals, as seen in Marisa Acuña's piece Le Chapeau à douze cornes.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15096v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Minhyun Kim",
      "Luke Schleef",
      "Russell W. Schwab"
    ],
    "title": "Partial Hölder regularity for fully nonlinear nonlocal parabolic equations with integrable kernels",
    "abstract": "In this work, we consider solutions to (fully nonlinear) parabolic integro-differential equations with integrable interaction kernels. A typical equation would be that obtained by starting with, for $s\\in(0,1)$, the $s$-fractional heat equation, but replacing the interaction kernel in the integro-differential term with one which has been truncated, for $ρ>0$, at the value $ρ^{-d-2s}$, hence integrable. We show that solutions to these equations have a partial regularity estimate which captures differences of the solution up to the scale at which the kernel has a truncation in its singularity. The estimates we provide are robust with respect to the truncation parameter, and they include the existing results for the original operators without truncation. There are some earlier results for linear and elliptic cases of this situation of integrable interaction kernels, and so our work is a generalization of those to the nonlinear and parabolic setting.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15044v1",
    "categories": [
      "math.MG",
      "math.FA"
    ],
    "authors": [
      "Luis J. Alías",
      "Bernardo González Merino",
      "Beatriz Marín Gimeno"
    ],
    "title": "On isoperimetric local-Bollobás-Thomason inequalities",
    "abstract": "We prove the following isoperimetric-type inequality: for every convex body $K$ in $\\mathbb R^n$ and some $σ\\subset[n]:=\\{1,\\dots,n\\}$ there exists a suitable Hanner polytope $B_K$ with the same volume as $K$ and such that the volume of each of its orthogonal projections onto every subspace whose basis is formed by the canonical vectors $\\{e_i:i\\inτ\\cup([n]\\setminusσ)\\}$, for every $τ\\subseteqσ$, bounds from below the volume of the corresponding projections of $K$.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15043v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Daoqiang Liu"
    ],
    "title": "Bottom spectrum and Llarull's theorem on complete noncompact manifolds",
    "abstract": "In this paper, we prove an extension of the noncompact version of Llarull's theorem due to Zhang and Li-Su-Wang-Zhang, giving an upper bound for the infimum of scalar curvature in terms of the bottom spectrum of the Laplacian. Moreover, we extend the theorem to manifolds with boundary, relaxing the strict positivity condition on the scalar curvature near the boundary that was required by Liu-Liu. Our approach is based on deformed Dirac operators.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15028v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Takuya Isomura"
    ],
    "title": "Information mechanics: conservation and exchange",
    "abstract": "Inference and learning are commonly cast in terms of optimisation, yet the fundamental constraints governing uncertainty reduction remain unclear. This work presents a first-principles framework inherent to Bayesian updating, termed information mechanics (infomechanics). Any pointwise reduction in posterior surprisal is exactly balanced by information gained from data, independently of algorithms, dynamics, or implementation. Imposing additivity, symmetry, and robustness collapses the freedom of this identity to only two independent conservation relations. One governs the global redistribution of uncertainty and recovers Shannon entropy. The other captures a complementary local geometric component, formalised as Fisher information. Together, these conserved quantities motivate a non-additive state function, the information potential $Φ$, which isolates structural degrees of freedom beyond entropy while remaining invariant under reparametrisation. $Φ$ quantifies local sharpness and ruggedness in posterior beliefs and vanishes uniquely for isotropic Gaussian distributions. In a low-temperature regime, $Φ$ scales logarithmically with the effective number of local optima, linking information geometry to computational complexity. This formalises an information-computation exchange, whereby information acquisition reshapes the inference landscape and reduces computational demands. By separating invariant informational constraints from inference mechanisms, this framework provides a unified, algorithm-independent foundation for inference, learning, and computation across biological and artificial systems.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15008v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Youssef Ayad"
    ],
    "title": "Pseudo-Riemannian Algebraic Ricci Solitons on Four-Dimensional Lie Groups",
    "abstract": "We investigate the conditions under which pseudo-Riemannian inner products induce pseudo-Riemannian algebraic Ricci solitons on four-dimensional Lie algebras. By analyzing the algebraic Ricci soliton equation for each four-dimensional Lie algebra, we obtain a complete description of when such pseudo-Riemannian algebraic Ricci solitons arise in dimension four. We present two applications of our formalism on a chosen four-dimensional Lie algebra by exhibiting a pseudo-Riemannian algebraic Ricci soliton and a flat pseudo-Riemannian inner product, which is a trivial algebraic Ricci soliton.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14985v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Seyed AmirPouya Moeini",
      "Albert Guillén i Fàbregas"
    ],
    "title": "Two-Class Joint Source-Channel Coding: Expurgated Exponents with i.i.d. Distributions",
    "abstract": "This paper studies expurgated exponents for joint source-channel coding of discrete memoryless sources and channels under i.i.d. random coding. We show that a two-class partitioning of source sequences, where the codeword distribution depends on the source type, achieves an exponent at least as high as that of optimal single-class coding, in which the codeword distribution is independent of the source message.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14940v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Inna K. Shingareva",
      "Andrei D. Polyanin"
    ],
    "title": "Nonclassical symmetries of polynomial equations and test problems with parameters for computer algebra systems",
    "abstract": "Nonclassical symmetries and reductions of polynomial equations and systems of polynomial equations are considered. It is shown that specific polynomial equations having \"hidden\" symmetries can be reduced to classical symmetric systems of polynomial equations by introducing a new additional variable. It has been established that symmetric systems of polynomial equations of mixed type, consisting of symmetric and anti-symmetric polynomials, can be transformed into simpler systems. A method is presented for solving nonclassical symmetric systems of two polynomial equations that change places when the unknowns are permuted. We study polynomial equations containing the second iteration of a given polynomial, which are reduced to nonclassical symmetric systems of equations. New higher-degree polynomial equations containing free parameters that admit solutions in radicals are found. Three such equations of the sixth and ninth degrees are further used as test problems with parameters for analyzing the capabilities of two leading computer algebra systems. It is shown that currently, the Maple and Mathematica systems do not allow us to efficiently find analytical solutions (in radicals) of polynomial equations with free parameters, but they allow us to obtain numerical solutions of equations for fixed numerical values of the parameters. The results of this work and the proposed test problems with parameters can be used to further improve existing computer algebra systems.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14983v1",
    "categories": [
      "math.AT",
      "math.GR"
    ],
    "authors": [
      "Marco Praderio Bova"
    ],
    "title": "Computing higher limits over the fusion orbit category via amalgams",
    "abstract": "We study higher limits over the centric orbit category of a fusion system realized by an amalgamated product. In so doing we provide a novel technique for studying the Diaz-Park sharpness conjecture and prove it (in the case of the cohomology Mackey functors) for all the Clelland-Parker and Parker-Stroth fusion systems. This complements previous work from Henke, Libmand and Lynd. We further use the developed technique to study the Benson-Solomon fusion systems thus relating higher limits over the centric fusion orbit category of these systems with the signalizer functors described by Aschbacher and Chermak. We believe that the proposed technique can, in future work, be used as a first step in an induction argument that can bring us closer to providing an answer to this conjecture.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.14947v1",
    "categories": [
      "math.ST",
      "stat.ME"
    ],
    "authors": [
      "Giacomo Francisci",
      "Claudio Agostinelli"
    ],
    "title": "Central subspace data depth",
    "abstract": "Statistical data depth plays an important role in the analysis of multivariate data sets. The main outcome is a center-outward ordering of the observations that can be used both to highlight features of the underlying distribution of the data and as input to further statistical analysis. An important property of data depth is related to symmetric distributions as the point with the highest depth value, the center, coincides with the point of symmetry. However, there are applications in which it is more natural to consider symmetry with respect to a subspace of a certain dimension rather than to a point, i.e. a subspace of dimension zero. We provide a general framework to construct statistical data depths which attain maximum value in a subspace, providing a center-outward ordering from that subspace. We refer to these data depths as central subspace data depths. Moreover, if the distribution is symmetric with respect to a subspace, then the depth is maximized at that subspace. We introduce general notions of symmetry about a subspace for distributions, study the properties of central subspace data depths and provide asymptotic convergence for the corresponding sample versions. Additionally, we discuss connections with projection pursuit and dimension reduction. An application based on custom data fraud detection shows the importance of the proposed approach and strengthens its potential.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15264v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Jose C. Martin"
    ],
    "title": "Dynamics of self-maps in their primal topologies",
    "abstract": "We study a series of dynamical concepts for self-maps in the primal topology induced by them. Among the concepts studied are non-wandering points, limit points, recurrent points, minimal sets, transitive points and self-maps, topologically ergodic self-maps, weakly mixing self-maps, strongly mixing self-maps, Lyapunov stable self-maps, chaotic self-maps in the sense of Auslander-Yorke, chaotic self-maps in the sense of Devaney, asymptotic pairs, proximal pairs, and syndetically proximal pairs.\n  Some results are given in the more general context of continuous self-maps in an Alexandroff topological space. We prove that a continuous self-map of an Alexandroff space is always Lyapunov stable.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15217v1",
    "categories": [
      "math.PR",
      "math.AP"
    ],
    "authors": [
      "Kush Kinra"
    ],
    "title": "Rate of convergence of random attractors towards deterministic singleton attractor for a class of non-Newtonian fluids of differential type",
    "abstract": "In this article, we investigate the long-term dynamics of a class of two- and three-dimensional non-Newtonian fluids of differential type, known as third-grade fluids. We first show that when the external forcing is sufficiently small, the global attractor of the underlying system (which characterizes its asymptotic behavior) reduces to a single point. We then consider the system under stochastic perturbations, specifically infinite-dimensional additive white noise. In this random setting, we do not find conclusive evidence that the corresponding random attractor remains a single point, as in the deterministic case. However, we are able to estimate the rate at which the random attractor approaches the deterministic singleton attractor as the intensity of the stochastic noise tends to zero.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15208v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Samir Adly",
      "Juan José Maulén",
      "Emilio Vilches"
    ],
    "title": "Penalty-Based Smoothing of Convex Nonsmooth Supremum Functions with Accelerated Inertial Dynamics",
    "abstract": "We propose a penalty-based smoothing framework for convex nonsmooth functions with a supremum structure. The regularization yields a differentiable surrogate with controlled approximation error, a single-valued dual maximizer, and explicit gradient formulas. We then study an accelerated inertial dynamic with vanishing damping driven by a time-dependent regularized function whose parameter decreases to zero. Under mild integrability and boundedness conditions on the regularization schedule, we establish an accelerated $\\mathcal{O}(t^{-2})$ decay estimate for the regularized residual and, in the regime $α>3$, a sharper $o(t^{-2})$ decay together with weak convergence of trajectories to a minimizer of the original nonsmooth problem via an Opial-type argument. Applications to multiobjective optimization (through Chebyshev/max scalarization) and to distributionally robust optimization (via entropic regularization over ambiguity sets) illustrate the scope of the framework.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15204v1",
    "categories": [
      "math.FA",
      "math.OA"
    ],
    "authors": [
      "Eusebio Gardella",
      "Jan Gundelach"
    ],
    "title": "Embeddings of $L^p$-operator algebras",
    "abstract": "We study embeddings of $L^p$-operator algebras arising from (twisted) étale groupoids, with particular emphasis on rigidity phenomena for $p\\neq 2$. Our methods rely on a detailed analysis of core normalizers and their functorial behavior under algebra homomorphisms. Using the notion of actors between groupoids, we show that under natural hypotheses, embeddings between reduced $L^p$-groupoid algebras can be described entirely in terms of morphisms of the underlying groupoids. We further show that embeddings of $L^p$-groupoid algebras induce embeddings of the associated topological full groups. Our results provide new tools for studying embeddability questions in the $L^p$-setting, and are particularly helpful when ruling out the existence of embeddings.\n  As applications, we obtain strong rigidity results for (spatial) $L^p$-AF-embeddability, showing that, for $p\\neq 2$, an $L^p$-groupoid algebra embeds into a spatial $L^p$-AF-algebra if and only if the underlying groupoid is AF. In particular, irrational rotation $L^p$-operator algebras do not embed into spatial $L^p$-AF-algebras. We apply these results to tensor products of $L^p$-Cuntz algebras and prove that, for $p\\neq 2$, there is no unital contractive homomorphism from $\\mathcal{O}_2^p \\otimes_p \\mathcal{O}_2^p$ into $\\mathcal{O}_2^p$, showing that there is no $L^p$-analog of Kirchberg's $\\mathcal{O}_2$-embedding theorem.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15194v1",
    "categories": [
      "math.PR",
      "cond-mat.stat-mech",
      "cs.IT"
    ],
    "authors": [
      "Oliver Baker",
      "Carl P. Dettmann"
    ],
    "title": "Entropy of Soft Random Geometric Graphs in General Geometries",
    "abstract": "We study the effect of the choice of embedding geometry on the entropy of random geometric graph ensembles with soft connection functions. First we show that when the connection range is small, the entropy is dependent only on the dimension of the geometry and not the shape, but for large connection ranges the boundaries of the domain matter. Next, we formulate the problem of estimating entropy as a problem of estimating the average degree of a graph with the binary entropy function as its connection function. We use this formulation to study the effect of boundaries on the entropy, and to estimate the entropy of soft random geometric graphs in complicated geometries where a closed form pair distance density is not available.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15183v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Marcelo Campos",
      "Cosmin Pohoata"
    ],
    "title": "An update on multicolor Ramsey lower bounds",
    "abstract": "Building upon previous works by Conlon-Ferber and Wigderson, Sawin showed a few years ago that upper bounds on the minimum density of independent sets in a $K_t$-free $G$ can be used to provide lower bounds for multicolor Ramsey numbers.\n  In this note, we observe how a further improved upper bound on this parameter directly follows from a recent spherical random geometric graph construction of Ma-Shen-Xie. As a consequence, we derive a small exponential improvement over the best known lower bounds for multicolor Ramsey numbers.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15128v1",
    "categories": [
      "math.CO",
      "math.AC",
      "math.AG",
      "math.ST"
    ],
    "authors": [
      "Per Alexandersson",
      "Yulia Alexandr",
      "Emiliano Liwski",
      "Fatemeh Mohammadi",
      "Pardis Semnani"
    ],
    "title": "Decomposing Determinantal Varieties from Statistics via Matroid Theory",
    "abstract": "We study determinantal varieties from conditional independence models with hidden variables, focusing on their irreducible decompositions, dimensions, degrees, and Gröbner bases. Each variety encodes a collection of matroids, whose flats capture algebraic dependencies among variables. Using this approach, we provide a systematic description of the components, their dimensions, and defining equations, and introduce a combinatorial framework for computing the degree of the determinantal variety. Our approach highlights the central role of matroidal structures in the study of determinantal varieties and extends beyond the reach of current computational techniques.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15105v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Stefano Marmi",
      "Daniel Smania"
    ],
    "title": "Brjuno-Like Functions for nonlinear expanding maps: Fractional Derivatives and Regularity Dichotomies",
    "abstract": "Cohomological equations appear frequently in dynamical systems. One of the most classical examples is the Livšic equation $$ v(x) = α\\circ F(x) - α(x).$$ The existence and regularity of its solutions $α$ is well understood when $F$ is a hyperbolic dynamical system (for instance an expanding map of the circle) and $v$ is a Hölder function.\n  The $\\textbf{twisted cohomological equation}$ $$ v(x) = α\\circ F(x) - (DF(x))^β\\, α(x) $$ is much less well understood. Functions similar to the famous Brjuno, Weierstrass, and Takagi functions appear as solutions of this equation. This functional equation also appears in the work of M. Lyubich, and of Avila, Lyubich, and de Melo in their study of deformations of quadratic-like and real-analytic maps.\n  Nevertheless, there are some striking results concerning the (lack of) regularity of solutions $α$ when $F$ is a linear endomorphism of the circle and $v$ is very regular. Notable contributions include works by Berry and Lewis; Ledrappier; Przytycki and Urbański, and more recently by Barański, Bárány and Romanowska, as well as by Shen, and by Ren and Shen, on Takagi and Weierstrass (and Weierstrass-like) functions.\n  We study the regularity of solutions $α$ when $F$ is a $\\textbf{nonlinear}$ expanding map of the circle and $v$ is not differentiable or even continuous, a setting in which previously used transversality techniques do not appear to be applicable. The new approach uses fractional derivatives to reduce the study of the twisted cohomological equation to that of a corresponding Livšic cohomological equation, and to show that the resulting distributional solutions (in the sense of Schwartz) satisfy certain Central Limit Theorem.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15092v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Sudkobfa Boontawee",
      "Mootta Prangprakhon",
      "Nimit Nimana"
    ],
    "title": "Federated Incremental Subgradient Method for Convex Bilevel Optimization Problems",
    "abstract": "In this letter, we consider a bilevel optimization problem in which the outer-level objective function is strongly convex, whereas the inner-level problem consists of a finite sum of convex functions. Bilevel optimization problems arise in situations where the inner-level problem does not have a unique solution. This has led to the idea of introducing an outer-level objective function to select a solution with the specific desired properties. We propose an iterative method that combines an incremental algorithm with a broadcast algorithm, both based on the principles of federated learning. Under appropriate assumptions, we establish the convergence results of the proposed algorithm. To demonstrate its performance, we present two numerical examples related to binary classification and a location problem.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15067v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Mingcheng Nie",
      "Ruoxi Chong",
      "Shuangyang Li",
      "Weijie Yuan",
      "Derrick Wing Kwan Ng",
      "Michail Matthaiou",
      "Giuseppe Caire",
      "Yonghui Li"
    ],
    "title": "A Novel Cross-Domain Channel Estimation Scheme for OFDM",
    "abstract": "In this paper, we propose a novel cross-domain channel estimation (CDCE) algorithm for orthogonal frequency division multiplexing (OFDM) systems, leveraging the unique characteristics of the delay-Doppler (DD) domain channel. Specifically, the proposed algorithm transforms the time-frequency (TF) domain pilot sequence of OFDM into the DD domain and applies a two-dimensional (2D) twisted-convolution for acquiring a coarse estimation of the underlying channel delay and Doppler. Then, the OFDM channel estimation is formulated as a sparse signal recovery problem in the TF domain according to the dictionary derived based on the obtained delay and Doppler estimates. Furthermore, a low-complexity $\\ell_1$-regularized least-square estimator is proposed to effectively solve this problem. Moreover, we further develop a performance analysis framework of the proposed scheme based on the ambiguity function (AF) of the adopted pilot sequence. Our numerical results demonstrate noticeable estimation performance improvement compared to conventional OFDM channel estimation methods, particularly in the presence of high channel mobility.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15058v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Corentin Fierobe",
      "Daniel Tsodikovich"
    ],
    "title": "Rigidity of the Suris' potential in the Frenkel-Kontorova Model",
    "abstract": "The goal of this paper is to establish a local rigidity result for the integrability of standard-like maps. The main focus of the paper is the remarkable integrable potential discovered by Suris in the 80's. We show that locally, the integrability of this potential is rigid. The proof relies on a similar strategy that was used for billiards in an ellipse, and involves developing the action-angle coordinates for this system, and exploiting it to construct a Riesz basis for $L^2$. As a corollary, we obtain a spectral rigidity result for this setting. Finally, we study the integrability question in the setting of potentials that are periodic.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15033v1",
    "categories": [
      "math.SP"
    ],
    "authors": [
      "Fernando De Terán",
      "Froilán M. Dopico"
    ],
    "title": "Generic real Jordan canonical forms",
    "abstract": "We obtain the generic real Jordan canonical forms for $n\\times n$ matrices with real entries. More precisely, we prove that the set of $n\\times n$ real matrices is the union of the closures of $\\lfloor n/2\\rfloor+1$ sets, which are called generic bundles, as they are particular \"bundles\". In general, a bundle is the set of $n\\times n$ real matrices with the same real Jordan canonical form, up to the values of the eigenvalues, provided that the eigenvalues which are distinct in one matrix of the bundle remain distinct in any other matrix of the same bundle. The $k$th generic bundle, for $0\\leq k\\leq\\lfloor n/2\\rfloor$, contains the $n\\times n$ real matrices having $k$ different pairs of non-real conjugate eigenvalues and $n-2k$ different real eigenvalues. We prove that each of the $\\lfloor n/2\\rfloor+1$ generic bundles is an open subset of the set of $n\\times n$ real matrices. Some numerical experiments are carried out with large sets of random matrices of different sizes to confirm that all the generic bundles show up, and only these ones.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15020v1",
    "categories": [
      "math.CV",
      "math.DG"
    ],
    "authors": [
      "Andrea Loi",
      "Matteo Palmieri"
    ],
    "title": "On the Bergman metric of symmettric spaces",
    "abstract": "We study bounded domains $Ω\\subset\\mathbb{C}^n$ whose Bergman metric is locally symmetric, i.e. its Riemannian curvature tensor is parallel with respect to the Levi-Civita connection. Following the strategy developed in \\cite{UnifThm2}, we obtain two rigidity results. If the Bergman metric of $Ω$ is complete, then $Ω$ is (globally) symmetric. If instead $Ω$ is pseudoconvex, then $Ω$ is biholomorphic to $\\widetildeΩ\\setminus E$, where $\\widetildeΩ\\subset\\mathbb{C}^n$ is a bounded symmetric domain and $E\\subset\\widetildeΩ$ is relatively closed and pluripolar. The proofs combine the structure theory of Hermitian symmetric spaces with Calabi's theory of Kähler immersions into the infinite dimensional complex projective space (in particular, rigidity and the hereditary property of the diastasis), together with analytic and pluripotential tools based on extension properties of square-integrable holomorphic functions and the Bergman kernel.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15003v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Bartosz Bieganowski",
      "Daniel Strzelecki"
    ],
    "title": "Note on the multiplicity of solutions for nonlinear scalar field equations with a critical inverse-square potential",
    "abstract": "We are interested in the multiplicity of solutions to the following scalar field equation $$ -Δu - \\frac{(N-2)^2}{4|x|^2} u = g(u), \\quad \\mbox{in } \\mathbb{R}^N \\setminus \\{0\\}. $$ We establish the existence of infinitely many radial and non-radial solutions.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15256v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Ruichuan Zhang"
    ],
    "title": "Derived logarithmic deformation theory and moduli stacks of derived logarithmic structures",
    "abstract": "This paper investigates the derived and spectral analogs of logarithmic geometry. We develop the deformation theory for animated log rings and $\\mathbb{E}_\\infty$-log rings and examine the corresponding theories of derived and spectral log stacks. Furthermore, we define moduli stacks for derived and spectral log structures and establish their representability. As an application, we will construct $\\infty$-root stacks in the derived and spectral settings and study the associated geometric properties.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15191v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Iñigo Jimenez-Ciga",
      "Francisco Gaspar",
      "Kundan Kumar",
      "Florin A. Radu"
    ],
    "title": "Parareal algorithm for coupled elliptic-parabolic problems",
    "abstract": "We present a convergence analysis of the parallel-in-time integration method known as the Parareal algorithm for degenerate differential-algebraic systems arising from quasi-static Biot models, which govern coupled flow and deformation in porous media. The underlying system exhibits a saddle-point structure and degeneracy due to the quasi-static assumption. We extend the Parareal algorithm to this setting and propose three coarse propagators: monolithic, fixed-stress, and multirate fixed-stress schemes. For each, we derive sufficient conditions for convergence and establish explicit time step restrictions that guarantee contractivity of the iteration matrix. Numerical experiments show computational savings accrued by using a parareal solver in multiphysics simulations involving poroelasticity and other coupled systems.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15173v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Katarina Krivokuća"
    ],
    "title": "Upper Bounds on Covering Minima of Convex Bodies",
    "abstract": "We give two new upper bounds on the covering minima of convex bodies, depending on covering minima of certain projections and intersections with linear subspaces. We show one bound to be sharp for direct sums of two convex bodies, generalizing previous results on the covering radius and lattice width of direct sums. We apply our results to standard terminal simplices, reducing the gap between the upper and lower bounds in a conjecture of Gonzaléz Merino and Schymura (2017), which gives insight on a conjecture of Codenotti, Santos and Schymura (2021) on the maximal covering radius of a non-hollow lattice polytope.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15168v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "J. Nicholas Neuberger",
      "Alen Alexanderian",
      "Bart van Bloemen Waanders",
      "Ahmed Attia"
    ],
    "title": "Path-OED for infinite-dimensional Bayesian linear inverse problems governed by PDEs",
    "abstract": "We consider infinite-dimensional Bayesian linear inverse problems governed by time-dependent partial differential equations (PDEs) and develop a mathematical and computational framework for optimal design of mobile sensor paths in this setting. The proposed path optimal experimental design (path-OED) framework is established rigorously in a function space setting and elaborated for the case of Bayesian c-optimality, which quantifies the posterior variance in a linear functional of the inverse parameter. The latter is motivated by goal-oriented formulations, where we seek to minimize the uncertainty in a scalar prediction of interest. To facilitate computations, we complement the proposed infinite-dimensional framework with discretized formulations, in suitably weighted finite-dimensional inner product spaces, and derive efficient methods for finding optimal sensor paths. The resulting computational framework is flexible, scalable, and can be adapted to a broad range of linear inverse problems and design criteria. We also present extensive computational experiments, for a model inverse problem constrained by an advection-diffusion equation, to demonstrate the effectiveness of the proposed approach.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15157v1",
    "categories": [
      "math.SP",
      "math.MG"
    ],
    "authors": [
      "Laura Monk"
    ],
    "title": "Typical hyperbolic surfaces have an optimal spectral gap",
    "abstract": "The first non-zero Laplace eigenvalue of a hyperbolic surface, or its spectral gap, measures how well-connected the surface is: surfaces with a large spectral gap are hard to cut in pieces, have a small diameter and fast mixing times. For large hyperbolic surfaces (of large area or large genus $g$, equivalently), we know that the spectral gap is asymptotically bounded above by $\\frac 14$. The aim of these talks is to present joint work with Nalini Anantharaman, where we prove that most hyperbolic surfaces have a near-optimal spectral gap. That is to say, we prove that, for any $ε> 0$, the Weil--Petersson probability for a hyperbolic surface of genus $g$ to have a spectral gap greater than $\\frac 14- ε$ goes to one as $g$ goes to infinity. This statement is analogous to Alon's 1986 conjecture for regular graphs, proven by Friedman in 2003. I will present our approach, which shares many similarities with Friedman's work, and introduce new tools and ideas that we have developed in order to tackle this problem.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15140v1",
    "categories": [
      "math.GR",
      "math.MG"
    ],
    "authors": [
      "Jannis Weis"
    ],
    "title": "Quasi-isometry Invariance of discrete Higher Filling functions",
    "abstract": "We prove that homological filling functions over a ring $R$ equipped with the discrete norm are quasi-isometry invariants for all groups of type $\\mathrm{FP}_n$. This confirms a conjecture of Bader-Kropholler-Vankov in the case of discrete norms. The proof uses a technique of equipping free chain complexes with a geometric structure, allowing for analogues of cellular constructions in the purely algebraic setting. As a further application we prove quasi-isometry invariance for a weighted version of integral and discrete filling functions originally introduced in the study of the rapid decay property.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15138v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Niklas Müller"
    ],
    "title": "Inequalities of Miyaoka-Yau type $\\&$ Uniformisation of varieties of intermediate Kodaira Dimension",
    "abstract": "In this paper we present, for any integers $0\\leq ν\\leq n$, a set of inequalities satisfied by the Chern classes of any minimal complex projective variety of dimension $n$ and numerical dimension $ν$. In the cases where $ν$ is either very small or very large compared with $n$, this recovers many previously known results. We demonstrate that our inequalities are sharp by providing an explicit characterisation of those varieties achieving the equality; our proof, in particular, resolves the Abundance conjecture in this situation. Additionally, we provide some new examples of varieties with extremal Chern classes that demonstrate the optimality of our results.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15134v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Peter Howard",
      "Adam Larios",
      "Quyuan Lin"
    ],
    "title": "A New Measure of Coarseness for Solutions to Cahn--Hilliard Equations",
    "abstract": "We introduce a new measure of coarseness for characterizing phase separation processes such as those described by Cahn--Hilliard equations. An advantage of our measure is that it remains consistent throughout the evolution, including for solutions with no periodic structure. We use our measure to compare two previous models of coarsening dynamics with numerically generated dynamics, providing the first direct check that we are aware of for the efficacy of these methods.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15089v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Zhuchao Ji",
      "Jiarui Song",
      "Junyi Xie"
    ],
    "title": "A geometric approach to the uniform boundedness of $\\ell$-primary torsion points",
    "abstract": "We prove that for a non-isotrivial abelian scheme over a smooth curve, the genus of a generic sequence of multi-sections with small heights tends to infinity.\n  As an application, we give a new proof of the uniform boundedness of $\\ell$-primary torsion points on fibers of an abelian scheme over a smooth curve, a result originally proved by Cadoret and Tamagawa. Furthermore, our approach allows us to resolve a conjecture of Cadoret and Tamagawa without additional assumptions.\n  Our approach is based on the theory of Betti foliations and the arithmetic equidistribution theorem.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15060v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Andreia Chapouto",
      "Simão Correia",
      "João Pedro Ramos"
    ],
    "title": "Gauge transform for the Korteweg-de Vries equation and well-posedness below the $H^{-1}$-scale",
    "abstract": "We propose a new formulation of the Korteweg-de Vries equation (KdV) on the real line, via a gauge transform. While KdV and the gauged equation are equivalent for smooth solutions, the latter is better behaved at low regularity in Fourier-Lebesgue spaces. In particular, the admissible regularities go beyond the $H^{-1}$-scale, which is a well-known threshold for KdV. As a byproduct, by reversing the gauge transform, we are able to improve on the known theory for KdV and derive sharp local well-posedness in Fourier-Lebesgue spaces with large integrability exponent. Our strategy is based on an infinite normal form reduction and Fourier restriction estimates, together with a thorough exploitation of algebraic cancellations. Additionally, our method is totally independent of the KdV completely integrable structure, and extends to other non-integrable models with quadratic nonlinearities.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15048v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Mingcheng Nie",
      "Ruoxi Chong",
      "Shuangyang Li",
      "Arman Farhang",
      "Fabian Göttsch",
      "Derrick Wing Kwan Ng",
      "Michail Matthaiou",
      "Yonghui Li"
    ],
    "title": "Towards Standardizing OTFS: A Candidate Waveform for Next-Generation Wireless Networks",
    "abstract": "The standardization of the sixth-generation (6G) has recently commenced to address the rapidly growing demands for enhanced wireless network services. Nevertheless, existing wireless systems, particularly at the physical layer waveform level, remain inadequate for achieving the ambitious key performance indicators (KPIs) envisioned for 6G. Specifically, orthogonal frequency division multiplexing (OFDM), the widely adopted waveform in fifth-generation new radio (5G-NR) networks, suffers from inherent limitations in satisfying these stringent requirements. In practice, OFDM can experience severe inter-carrier interference (ICI), resulting in a pronounced data rate error floor caused by high Doppler shifts. Additionally, the repetitive usage of cyclic prefixes (CPs), intended to combat multipath delays, results in significant spectral inefficiency. These fundamental drawbacks pose critical obstacles to fulfilling 6G performance objectives. Orthogonal time frequency space (OTFS) modulation has recently emerged as a promising waveform candidate, addressing the aforementioned challenges by exploiting the unique characteristics of the delay-Doppler (DD) domain channel. Unlike OFDM, OTFS is inherently resilient to channel distortions induced by delay and Doppler effects, while remaining sensitive to time and frequency shifts. Such intrinsic properties are instrumental in enabling OTFS, with joint communication and sensing capabilities, to embrace, rather than combat, dynamic channel conditions. Motivated by these compelling advantages, this article investigates the feasibility and practical implementation of OTFS modulation leveraging the current OFDM-based wireless systems.",
    "date": "01-22"
  },
  {
    "link": "https://arxiv.org/pdf/2601.15035v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Juan Marshall-Maldonado",
      "Boris Solomyak"
    ],
    "title": "Quantitative weak mixing for typical Salem substitution suspension flows",
    "abstract": "The paper investigates quantitative weak mixing of Salem substitutions flows. We prove that for a substitution whose substitution matrix is irreducible over the rationals and the dominant eigenvalue is a Salem number, for almost every suspension flow with a piecewise constant roof function, quantitative weak mixing holds with a rate that is slightly worse than a power of $\\log\\log$. We do not know if this is sharp, but we do show that for any suspension flow of this kind, quantitative weak mixing with a polynomial rate is impossible. Results for specific systems are often much weaker than for ``typical'' or ``generic'' ones. In the Appendix we explain how a minor modification of an argument from Bufetov and Solomyak (2014) yields very weak, but nevertheless quantitative weak mixing estimates of $\\log^*$ type for the {\\em self-similar} suspension flow over a Salem substitution. Simultaneously this provides first quantitative decay rates for the Fourier transform of Salem Bernoulli convolutions.",
    "date": "01-22"
  }
]