[
  {
    "link": "https://arxiv.org/pdf/2601.18951v1",
    "categories": [
      "math.CO",
      "cs.CG",
      "cs.DM"
    ],
    "authors": [
      "Bhaswar B. Bhattacharya",
      "Sandip Das",
      "Sk Samim Islam",
      "Aashirwad Mohapatra",
      "Ishan Paul",
      "Saumya Sen"
    ],
    "title": "On the Number of Almost Empty Monochromatic Triangles",
    "abstract": "In this paper, we consider the problem of counting almost empty monochromatic triangles in colored planar point sets, that is, triangles whose vertices are all assigned the same color and that contain only a few interior points. Specifically, we show that any $c$-coloring of a set of $n$ points in the plane in general position (that is, no three on a line) contains $Ω(n^2)$ monochromatic triangles with at most $c-1$ interior points and $Ω(n^{\\frac{4}{3}})$ monochromatic triangles with at most $c-2$ interior points, for any fixed $c \\geq 2$. The latter, in particular, generalizes the result of Pach and Tóth (2013) on the number of monochromatic empty triangles in 2-colored point sets, to the setting of multiple colors and monochromatic triangles with a few interior points. We also derive the limiting value of the expected number of triangles with $s$ interior points in random point sets, for any integer $s \\geq 0$. As a result, we obtain the expected number of monochromatic triangles with at most $s$ interior points in random colorings of random point sets.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18942v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Jimin Choi",
      "Husni R. Idris",
      "Huy T. Tran",
      "Max Z. Li"
    ],
    "title": "Collaborative Decision-Making and Optimal Utilization of Pathfinding Flights during Convective Weather",
    "abstract": "Air traffic operations are strongly influenced by convective weather, and one common response is pathfinder operations, in which a designated aircraft tests the viability of weather-impacted airspace and routes. Despite relatively routine use in practice, how pathfinder operations evolve under uncertainty and how the pathfinder decision-making process unfolds are largely treated as exogenous. Addressing this gap requires jointly modeling weather-driven system accessibility, flight responses to pathfinder offers, and the sequencing of those offers to improve outcomes. We develop a unified analytical framework that connects weather-driven system state transitions, flight acceptance decisions, and the sequencing of pathfinder offers. We first construct a four-state Markov chain to model stochastic closure and reopening of exit points, or fixes, out of the terminal departure airspace surrounding a major airport, pathfinder selection, and pathfinding execution, and analyze its steady-state behavior to characterize long-term capacity and delay implications. We introduce utility-based decision models for flights, air traffic control (ATC), and dispatchers, and analyze worst-case collective rejection to quantify system vulnerability under selfless behavior and uncertainty. Finally, we formulate optimization problems that model ATC-initiated and dispatcher-initated pathfinder offers, with the goal of optimizing the sequence of pathfinder offers. Using a discrete event simulation for a major US airport, we show that ATC- and dispatcher-driven objectives lead to distinct, near real-time sequencing strategies, providing the first formal decision models for pathfinder operations under weather uncertainty.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18853v1",
    "categories": [
      "math.HO",
      "math.PR"
    ],
    "authors": [
      "Jean-Yves Ouvrard",
      "Xavier Ouvrard"
    ],
    "title": "Probabilities",
    "abstract": "Probabilities is the English translation of the book Probabilités Tome 1 and Tome 2. At the moment only the part 1 is released. The mathematic content is authored by Prof. Jean-Yves Ouvrard. The English version has been done by his eldest son Dr. Xavier Ouvrard. For the moment only the Part 1 is released (ie the first 7 chapters out of 17), which corresponds to bachelor level.\n  The content is released in CC-BY-NC-SA.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18838v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Igor Chollet"
    ],
    "title": "Kroneckerised Particle Mesh Ewald",
    "abstract": "Particle Mesh Ewald (PME) methods accelerated through Fast Fourier Transforms (FFTs) for their reciprocal part are widely used to solve N -body problems over periodic structures with Laplace-like kernels. The FFT dependence of classical PME may mitigate its performance on parallel distributed-memory architectures. We here introduce a new variant of the reciprocal part based on Sum of Kronecker Products (SKP) instead of FFT. Moreover, our implementation of this new method is not linearithmic (as opposed to classical PME) but has an important parallel potential. We present the different approximation levels exploited in our new scheme and demonstrate to what extent it could be used on parallel distributed-memory architectures. Numerical examples supplement presented assertions.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18817v1",
    "categories": [
      "math.NA",
      "physics.flu-dyn"
    ],
    "authors": [
      "Nadim Rooholamin",
      "Kabir Bakhshaei",
      "Giovanni Stabile"
    ],
    "title": "A Hybrid Discretize-then-Project Reduced Order Model for Turbulent Flows on Collocated Grids with Data-Driven Closure",
    "abstract": "This study presents a hybrid reduced-order modeling (ROM) framework for turbulent incompressible flows on collocated finite volume grids. The methodology employs the \"discretize-then-project\" consistent flux strategy, which ensures mass conservation and pressure-velocity coupling without requiring auxiliary stabilization like boundary control or pressure stabilization techniques. However, because standard Galerkin projection fails to yield physically consistent results for the turbulent viscosity field, a hybrid strategy is adopted: velocity and pressure are resolved via intrusive projection, while the turbulent viscosity is reconstructed using a non-intrusive data-driven closure. We evaluate three neural network architectures, Multilayer Perceptron (MLP), Transformers, and Long Short-Term Memory (LSTM), to model the temporal evolution of the viscosity coefficients. Validated against a 3D Large Eddy Simulation of a lid-driven cavity, the LSTM-based closure demonstrates superior performance in capturing transient dynamics, achieving relative errors of 0.7\\% for velocity and 4\\% for turbulent viscosity. The resulting framework effectively combines the mathematical rigor of the consistent flux formulation with the adaptability of deep learning for turbulence modeling.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19379v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Yidong Wu",
      "Luo Luo"
    ],
    "title": "Optimal Asynchronous Stochastic Nonconvex Optimization under Heavy-Tailed Noise",
    "abstract": "This paper considers the problem of asynchronous stochastic nonconvex optimization with heavy-tailed gradient noise and arbitrarily heterogeneous computation times across workers. We propose an asynchronous normalized stochastic gradient descent algorithm with momentum. The analysis show that our method achieves the optimal time complexity under the assumption of bounded $p$th-order central moment with $p\\in(1,2]$. We also provide numerical experiments to show the effectiveness of proposed method.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19359v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Francesco Pagliarin"
    ],
    "title": "A sharp monomial Caffarelli-Kohn-Nirenberg inequality",
    "abstract": "We consider a monomial Caffarelli-Kohn-Nirenberg inequality, find the optimal constant and classify the optimizers under an integrated curvature dimension condition. We take advantage of the $Γ$-calculus to exploit geometrical techniques to tackle the problem and regularity results to justify some integration by parts. A symmetry-breaking result is also provided.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19327v1",
    "categories": [
      "math.CO",
      "cs.IT"
    ],
    "authors": [
      "Boon Suan Ho"
    ],
    "title": "A generalization of Boppana's entropy inequality",
    "abstract": "In recent progress on the union-closed sets conjecture, a key lemma has been Boppana's entropy inequality: $h(x^2)\\geφxh(x)$, where $φ=(1+\\sqrt5)/2$ and $h(x)=-x\\log x-(1-x)\\log(1-x)$. In this note, we prove that the generalized inequality $α_kh(x^k)\\ge x^{k-1}h(x)$, first conjectured by Yuster, holds for real $k>1$, where $α_k$ is the unique positive solution to $x(1+x)^{k-1}=1$. This implies an analogue of the union-closed sets conjecture for approximate $k$-union closed set systems. We also formalize our proof in Lean 4.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19323v1",
    "categories": [
      "math.PR",
      "math.ST"
    ],
    "authors": [
      "James Allen Fill",
      "Svante Janson"
    ],
    "title": "Positive autocorrelation at unit lag for stationary random walk Metropolis-Hastings in ${\\mathbb R}^d$",
    "abstract": "It is often asserted in the literature that one should expect positive autocorrelation for random walk Metropolis-Hastings (RWMH), especially if the typical proposal step-size is small relative to the variability in the target density. In this paper, we consider a stationary RWMH chain ${\\bf X}$ taking values in $d$-dimensional Euclidean space and (subject only to the existence of densities with respect to Lebesgue measure) with general target distribution having finite second moment and general proposal random walk step-distribution. We prove, for any nonzero vector ${\\bf c}$, strict positivity of the autocorrelation function at unit lag for the stochastic process $\\langle{\\bf c},{\\bf X}\\rangle$, that is, \\[{\\operatorname{Corr}}(\\langle{\\bf c},{\\bf X}_0\\rangle,\\langle{\\bf c},{\\bf X}_1\\rangle)>0,\\] and we establish the same result, but with weak inequality (which can in some cases be equality) when the state space for ${\\bf X}$ is changed to the integer grid ${\\mathbb Z}^d$. Further, for ${\\bf c}\\neq{\\bf 0}$ we establish the sharp lower bound \\[{\\operatorname{Corr}}(\\langle{\\bf c},{\\bf X}_0\\rangle,\\langle{\\bf c},{\\bf X}_1\\rangle)>\\tfrac19\\] on autocorrelation when we assume both that (i) the target density $π$ is spherically symmetric and unimodal in the specific sense that $π({\\bf x})=\\hatπ(\\|{\\bf x}\\|)$ for some nonincreasing function $\\hatπ$ on $[0,\\infty)$ and that (ii) the proposal step-density is symmetric about ${\\bf 0}$.\n  We study the autocorrelation indirectly, by considering the incremental variance function (or incremental second-moment function) at unit lag. The same approach allows us also for $r\\in[2,\\infty)$ to upper-bound the incremental $r$th-absolute-moment function at unit lag.\n  We give also closely related inequalities for the total variation distance between two distributions on ${\\mathbb R}^d$ differing only by a location shift.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19308v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Frédéric Bayart",
      "Anne Dorval"
    ],
    "title": "Composition operators on weighted Bergman spaces of the polydisc",
    "abstract": "We study composition operators between weighted Bergman spaces of the polydisc induced by smooth symbols. We prove a general result of continuity which only involves the behaviour of the symbol on the polytorus. We deduce from this several consequences about the automatic continuity of the induced operator. We study in depth the case of the tridisc and exhibit several examples showing that a characterization of continuity using only derivatives seems impossible.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19307v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Vincent Bansaye",
      "Ana Fernández Baranda",
      "Stéphane Giraudier",
      "Sylvie Méléard"
    ],
    "title": "Hematopoiesis as a continuum: from stochastic compartmental model to hydrodynamic limit",
    "abstract": "We consider a multiscale stochastic compartmental model with three types of cells (stem cells, immature cells and mature cells) which combines cell proliferation and cell differentiation. We derive a hydrodynamic limit when the number of immature compartments goes to infinity obtaining a partial differential equations system with boundary conditions, modelling hematopoiesis as a continuum. We assume that proliferation and differentiation are regulated and let the corresponding rates depend on the number of mature cells. This leads us to model the dynamics of the population by a Markov process in continuous time and discrete space, which does not satisfy the branching property. We prove the convergence in law of the stem and mature cells population size processes and of the empirical measures of the immature cells dynamics, conveniently rescaled, to the unique triplet involving coupled functions and a measure, which are solutions of a deterministic measure valued equation with boundary dynamics. The cell differentiation induces a transport term in space and the main difficulty comes from the boundary effects coming from stem and mature cells. We also prove that the limiting measure admits at each time a density with respect to Lebesgue measure and can be characterized as solution of a partial differential equation.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19272v1",
    "categories": [
      "math.CA",
      "math.FA"
    ],
    "authors": [
      "Andrei K. Lerner"
    ],
    "title": "On an improved restricted reverse weak-type bound for the maximal operator",
    "abstract": "We obtain an improved lower bound for the restricted reverse weak-type estimate of the Hardy-Littlewood maximal operator $M$. This result is applied to the $λ$-median maximal operator $m_λ$ acting on a Banach function space $X$. We show that under certain assumptions on $X$, the boundedness properties of $m_λ$ and $M$ are equivalent.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19242v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Yi Cai",
      "Xiu Chen",
      "Lipeng Wang"
    ],
    "title": "Intersections of Cantor sets with hyperbolas and continuous images",
    "abstract": "Given $λ\\in (0,1/2)$, let \\begin{equation*} C_λ=\\set{(1-λ)\\sum_{i=1}^\\infty d_iλ^{i-1}:d_i\\in\\set{0,1}} \\end{equation*} be the middle Cantor sets with convex hull $[0, 1]$. We are interested in the set $S_t=\\set{(x,y)\\in C_λ\\times C_λ: xy=t}$, where $t\\in[0,1]$. Since the cases where $t=0$ or $t=1$ are trivial, we assume that $t\\in(0,1)$ in what follows. We show that there exists a $λ_0=0.4302$ such that for all $λ$ satisfying $λ_0 \\le λ< 1/2$, the set $S_t$ has the cardinality of the continuum for every $t \\in (0,1)$. Besides, we further investigate the continuous image of $C_λ\\times C_λ$, that is, for any given $2\\le k\\in \\nn$, we give a sufficient condition for set $\\set{x^ky:x,y\\in C_λ}$ to be the interval $[0,1]$. Our observations reveal that the behavior exhibited by the image of the function $f_k(x,y)=x^ky$ is complex and depends on the parameters $k$ and $λ$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19230v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Dimitrios M. Thilikos",
      "Sebastian Wiederrecht"
    ],
    "title": "Excluding surfaces as minors in graphs",
    "abstract": "The Graph Minors Structure Theorem (GMST) of Robertson and Seymour states that for every graph $H,$ any $H$-minor-free graph $G$ has a tree-decomposition of bounded adhesion such that the torso of every bag embeds in a surface $Σ$ where $H$ does not embed after removing a small number of \\textsl{apex vertices} and confining some vertices into a bounded number of \\textsl{bounded depth} vortices. However, the functions involved in the original form of this statement were not explicit. In an enormous effort Kawarabayashi, Thomas, and Wollan proved a similar statement with explicit (and single-exponential in $|V(H)|$) bounds. However, their proof replaces the statement \"a surface where $H$ does not embed'' with \"a surface of Euler-genus in $\\mathcal{O}(|H|^2)$''.\n  In this paper we close this gap and prove that the bounds of Kawarabayashi, Thomas, and Wollan can be achieved with a tight bound on the Euler-genus. Moreover, we provide a more refined version of the GMST focussed exclusively on excluding, instead of a single graph, grid-like graphs that are minor-universal for a given set of surfaces. This allows us to give a description, in the style of Robertson and Seymour, of graphs excluding a graph of fixed Euler-genus as a minor, rather than focussing on the size of the graph.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19223v1",
    "categories": [
      "math.DS",
      "stat.ML"
    ],
    "authors": [
      "Yang Li",
      "Jinqiao Duan"
    ],
    "title": "Nonlocal Kramers-Moyal formulas and data-driven discovery of stochastic dynamical systems with multiplicative Lévy noise",
    "abstract": "Traditional data-driven methods, effective for deterministic systems or stochastic differential equations (SDEs) with Gaussian noise, fail to handle the discontinuous sample paths and heavy-tailed fluctuations characteristic of Lévy processes, particularly when the noise is state-dependent. To bridge this gap, we establish nonlocal Kramers-Moyal formulas, rigorously generalizing the classical Kramers-Moyal relations to SDEs with multiplicative Lévy noise. These formulas provide a direct link between short-time transition probability densities (or sample path statistics) and the underlying SDE coefficients: the drift vector, diffusion matrix, Lévy jump measure kernel, and Lévy noise intensity functions. Leveraging these theoretical foundations, we develop novel data-driven algorithms capable of simultaneously identifying all governing components from data and establish convergence results and error analysis for the algorithms. We validate the framework through extensive numerical experiments on prototypical systems. This work provides a principled and practical toolbox for discovering interpretable SDE models governing complex systems influenced by discontinuous, heavy-tailed, state-dependent fluctuations, with broad applicability in climate science, neuroscience, epidemiology, finance, and biological physics.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19215v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Claude LeBrun",
      "Tristan Ozuch"
    ],
    "title": "Desingularizations of Conformally Kaehler, Einstein Orbifolds",
    "abstract": "Let {(M,g_j)} be a sequence of smooth compact oriented Einstein 4-manifolds of fixed Einstein constant $λ> 0$ that Gromov-Hausdorff converges to a 4-dimensional Einstein orbifold X. Suppose, moreover, that the limit metric is Hermitian with respect to some complex structure on the limit orbifold X, that X has at least one singular point, and that every gravitational instanton that bubbles off from the sequence is anti-self-dual. Then, for all sufficiently large j, the given (M,g_j) are all Kaehler-Einstein. As a consequence, the limit orbifold X is also Kaehler-Einstein, and must in fact be one of the orbifold limits classified by Odaka, Spotti, and Sun.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19172v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Weiguo Gao",
      "Zhansi He",
      "Jia Yin"
    ],
    "title": "A sixth-order compact time-splitting Fourier pseudospectral method",
    "abstract": "In this paper, we propose a novel sixth-order compact time-splitting scheme, denoted as $ S_{6\\text{c}}$, for solving the Dirac equation in the absence of external magnetic potentials. This method is easy to implement, and it provides a substantial reduction in computational complexity compared to the existing sixth-order splitting schemes. By incorporating a time-ordering technique, we also extend $S_{6\\text{c}}$ to address problems with time-dependent potentials. Comprehensive comparisons with various time-splitting methods show that $S_{6\\text{c}}$ exhibits significant advantages in terms of both precision and efficiency. Moreover, numerical results indicate that $S_{6\\text{c}}$ maintains the super-resolution property for the Dirac equation in the nonrelativistic regime in the absence of external magnetic potentials.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19110v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Young-Pil Choi",
      "Jinwook Jung"
    ],
    "title": "Quantitative light-particle limit for the Vlasov-Fokker-Planck-Navier-Stokes system",
    "abstract": "We investigate the hydrodynamic limit of the Vlasov--Fokker--Planck--Navier--Stokes system in the light particle regime, where the particle relaxation takes place on a singularly fast time scale. Using a relative entropy method adapted to this scaling, we develop the first quantitative convergence theory for the light particle limit. Our analysis yields explicit rates for the convergence of both the kinetic distribution and the fluid velocity, extending the qualitative compactness-based result of Goudon, Jabin, and Vasseur [Indiana Univ. Math. J., 53, (2004), 1495--1515]. Moreover, we show that these quantitative estimates propagate in weak topologies and, in particular, lead to optimal convergence rates in the bounded Lipschitz distance. The results apply on both the torus and the whole space, providing a unified quantitative description of the light particle hydrodynamic limit.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19071v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Eitaro Kawamo",
      "Hiroki Masuda"
    ],
    "title": "Asymptotic inference for skewed stable Ornstein-Uhlenbeck process",
    "abstract": "We consider the parametric estimation of the Ornstein-Uhlenbeck process driven by a non-Gaussian $α$-stable Lévy process with the stable index $α>1$ and possibly skewed jumps, based on a discrete-time sample over a fixed period. By employing a suitable non-diagonal normalizing matrix, we present the following: the parametric family satisfies the local asymptotic mixed normality with a non-degenerate Fisher information matrix; there exists a local maximum of the log-likelihood function which is asymptotically mixed-normal; the local maximum is asymptotically efficient in the sense that it has maximal concentration around the true value over symmetric convex Borel subsets. In the proof, we prove the asymptotic equivalence between the genuine likelihood and the much simpler Euler-type quasi-likelihood. Furthermore, we propose a simple moment-based method to estimate the parameters of the driving stable Lévy process, which serves as an initial estimator for numerical search of the (quasi-)likelihood, reducing the computational burden of the optimization to a large extent. We also present simulation results, which illustrate the theoretical results and highlight the advantages and disadvantages of the genuine and quasi-likelihood approaches.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19056v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Shinobu Yokoyama"
    ],
    "title": "Relative Obstructions and Spectral Diagnostics for Sheaves on Cell Complexes",
    "abstract": "Many structured systems admit locally consistent descriptions that nevertheless fail to globalize when constrained by an ambient reference or feasibility condition. Diagnosing such failures is naturally an evaluative problem: given a fixed model and a grounding, can one determine whether they are structurally compatible, and if not, identify the nature and localization of the obstruction?\n  In this work, we introduce a sheaf-theoretic and spectral framework for evaluating structural inconsistency as a \\emph{relative} phenomenon. A model is represented by a cellular sheaf $\\mathcal F$ on a cell complex, together with a morphism into a grounding sheaf $\\mathcal W$ encoding admissible global behavior. Failure of compatibility is captured by the mapping cone of this morphism, whose cohomology computes the relative groups $H^*(K;\\mathcal F,\\mathcal W)$ and separates intrinsic obstructions from inconsistencies induced by the grounding.\n  Beyond exact cohomological classification, we develop \\emph{spectral witnesses} derived from regular and mapping-cone Laplacians. The spectra of these operators provide computable, quantitative indicators of inconsistency, encoding both robustness and spatial localization through spectral gaps, integrated energies, and eigenmode support. These witnesses enable comparison of distinct inconsistency mechanisms in fixed systems without learning, optimization, or modification of the underlying representation.\n  The proposed framework is domain-agnostic and applies to a broad class of structured models where feasibility is enforced locally but evaluated globally.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19020v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Stefano Costa"
    ],
    "title": "AAA least squares solution of Helmholtz problems",
    "abstract": "This paper presents an adaptive numerical framework for solving exterior \"sound-soft\" scattering problems governed by the Helmholtz equation. By interpreting the Method of Fundamental Solutions through the lens of rational approximation, we introduce an automated strategy for singularity placement based on the analytic continuation of boundary data. The proposed AAALS-Helmholtz algorithm leverages a \"continuum\" variant of the AAA algorithm to identify the singularities limiting analytic extension, and to ensure an optimal source distribution even for complex, non star-shaped geometries. Furthermore, we establish a formal connection between the Helmholtz and Laplace problems, providing a theoretical justification for the \"double poles\" technique. The approach offers a robust, meshless alternative to heuristic source placement.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19009v1",
    "categories": [
      "math.CA",
      "eess.SP"
    ],
    "authors": [
      "Iulia Martina Bulai",
      "Elena Cordero",
      "Edoardo Pucci",
      "Sandra Saliani"
    ],
    "title": "Beyond Single-Window Graph Fourier Analysis",
    "abstract": "We introduce a multi-windowed graph Fourier transform (MWGFT) for the joint vertex-frequency analysis of signals defined on graphs. Building on generalized translation and modulation induced by the graph Laplacian, the proposed framework extends the windowed graph Fourier transform by allowing multiple analysis and synthesis windows. Exact reconstruction formulas are derived for complex-valued graph signals, together with sufficient and computable conditions guaranteeing stable invertibility. The associated families of windowed graph Fourier atoms are shown to form frames for the space of graph signals. Numerical experiments on synthetic and real world graphs confirm exact reconstruction up to machine precision and demonstrate improved stability and vertex-frequency localization compared to single-window constructions, particularly on irregular graph topologies.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18969v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Peter Benner",
      "Michael Hinze",
      "Hamdullah Yücel"
    ],
    "title": "A Local Discontinuous Galerkin Method for Dirichlet Boundary Control Problems",
    "abstract": "In this paper, we consider control constrained $L^2-$Dirichlet boundary control of a convection-diffusion equation on a two dimensional convex polygonal domain. We discretize the control problem based on the local discontinuous Galerkin method with piecewise linear ansatz functions for the flux and potential. We derive a priori error estimates for the full as well as for the variational discrete control approximation. We present a selection of numerical results to demonstrate the performance of our approach and to underpin the theoretical findings.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19427v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "S. Fagioli",
      "M. Kamath Katapady"
    ],
    "title": "Existence of Weak Solutions to a Constrained Aggregation-Diffusion-Reaction Model for Multiple Sclerosis",
    "abstract": "We establish an existence result for weak solutions to an aggregation-diffusion-reaction equation with a constraint, arising in the modelling of multiple sclerosis. The model is derived from a general chemotaxis-type framework and describes the time evolution of the density of activated macrophages, which is subject to attraction by oligodendrocytes. The latter are governed by a constraint equation. The proof relies on a variational splitting scheme that isolates the transport (aggregation-diffusion) and reaction contributions. The structure of the constraint makes it possible to recover the oligodendrocyte density as the limit of a sequence of characteristic functions.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19381v1",
    "categories": [
      "math.OC",
      "cs.DC"
    ],
    "authors": [
      "Xinyan Chen",
      "Weiguo Gao",
      "Luo Luo"
    ],
    "title": "Decentralized Nonsmooth Nonconvex Optimization with Client Sampling",
    "abstract": "This paper considers decentralized nonsmooth nonconvex optimization problem with Lipschitz continuous local functions. We propose an efficient stochastic first-order method with client sampling, achieving the $(δ,ε)$-Goldstein stationary point with the overall sample complexity of ${\\mathcal O}(δ^{-1}ε^{-3})$, the computation rounds of ${\\mathcal O}(δ^{-1}ε^{-3})$, and the communication rounds of ${\\tilde{\\mathcal O}}(γ^{-1/2}δ^{-1}ε^{-3})$, where $γ$ is the spectral gap of the mixing matrix for the network. Our results achieve the optimal sample complexity and the sharper communication complexity than existing methods. We also extend our ideas to zeroth-order optimization. Moreover, the numerical experiments show the empirical advantage of our methods.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19370v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Kaushlendra Pandey",
      "Harpreet S. Dhillon",
      "Abhishek K. Gupta"
    ],
    "title": "On the Analysis of Platooned Vehicular Networks on Highways",
    "abstract": "Vehicular platooning refers to coordinated and close movement of vehicular users (VUs) traveling together along a common route segment, offering strategic benefits such as reduced fuel costs, lower emissions, and improved traffic flow. {Highways offer a natural setting for platooning due to extended travel distances, yet their potential remains underexplored, particularly in terms of communication and connectivity. Given that effective platooning relies on robust vehicle-to-vehicle (V2V) and vehicle-to-infrastructure (V2I) links, understanding connectivity dynamics on highways is essential.} In this paper, we analyze the dynamics of vehicular platooning on a highway and its impact on the performance of two forms of vehicular communications -- namely V2V and V2I communication -- compared to independent vehicle movement on a highway. The vehicular networks consists of road-side units (RSUs), modeled as a 1D Poisson point process (PPP), to provide the vehicular connectivity to the VUs. VUs are modeled as 1D PPP under the non-platooned traffic scenario (N-PTS) and as a 1D Matern cluster process (MCP) under the platooned traffic scenario (PTS). We evaluate the distribution on the per-RSU load, representing the number of VUs served, for the typical and tagged RSU. Additionally, we derive coverage probability (CP) and rate coverage (RC), which measures the probability of the signal-to-interference-plus-noise ratio (SINR) and achievable rate above a specified threshold at the typical VU along with their meta distribution (MD), providing a deeper understanding of the reliability and variability of these metrics across different spatial distributions of VUs and RSUs. Finally, we validate our theoretical findings through simulations and provide numerical insights into the impact of different traffic patterns on RSU load distribution, CP, and RC performance.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19358v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Swarnali Datta",
      "Arunava Mandal",
      "Ravi Tomar"
    ],
    "title": "Combination of locally quasiconvex hyperbolic TDLC groups and Cannon-Thurston maps",
    "abstract": "In this article, we study acylindrical graphs of groups, local quasiconvexity, and Cannon-Thurston maps in the setting of totally disconnected locally compact (TDLC) hyperbolic groups, extending several fundamental notions and results from discrete hyperbolic groups to this broader context. Leveraging Dahmani's technique and a topological characterization of hyperbolic TDLC groups in terms of uniform convergence groups given by Carette-Dreesen, we prove a combination theorem for an acylindrical graph of hyperbolic TDLC groups and give an explicit construction of the Gromov boundary of the fundamental group of the given graph of groups. Using the description of the Gromov boundary, we prove our main result: a combination theorem for an acylindrical graph of locally quasiconvex hyperbolic TDLC groups. Further, we generalise the work of Mosher, proving the existence of quasiisometric sections for a given short exact sequence of hyperbolic TDLC groups. This leads us to prove the existence of a Cannon-Thurston map for a normal hyperbolic subgroup of a hyperbolic TDLC group, generalising a theorem of Mj.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19317v1",
    "categories": [
      "math.AP",
      "math.FA"
    ],
    "authors": [
      "Haesung Lee"
    ],
    "title": "Remarks on well-posedness for linear elliptic equations via divergence-free transformation",
    "abstract": "This paper investigates the well-posedness of linear elliptic equations, focusing on the divergence-free transformation introduced in the author's recent work [J. Math. Anal. Appl. 548 (2025), 129425]. By comparing this approach with classical bilinear form methods, we demonstrate that while standard techniques encounter limitations in handling zero-order coefficients $c \\in L^1(U)$, the divergence-free transformation successfully establishes well-posedness in this setting. Furthermore, utilizing the Riesz-Thorin interpolation theorem between the cases $c \\in L^1(U)$ and $c \\in L^{\\frac{2d}{d+2}}(U)$, we establish the existence and uniqueness of weak solutions under the assumption $c \\in L^s(U)$ for $s \\in [1, \\frac{2d}{d+2}]$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19288v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Farahnaz Amiri"
    ],
    "title": "Computing $p$-Class Group Structure in Real Quadratic Fields: A New Approach",
    "abstract": "This article is the first in a series devoted to computing the class groups of real quadratic fields. We present a new relation between the class number and the index of unit groups. This relation generalizes Hilbert class field theory for real quadratic fields and establishes a bridge between class field theory, composition laws of binary forms of degree $p^n$, and ideal classes of order $p^n$, where p is prime and n is an arbitrary positive integer.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19283v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Tatsuya Yamada"
    ],
    "title": "Secondary terms in the distribution of genus numbers of cubic fields",
    "abstract": "We prove the existence of secondary terms of order $X^{5/6}$ in the asymptotic formulas for the average size of the genus number of cubic fields and for the number of cubic fields with a given genus number, establishing improved error estimates. These results refine the estimates obtained by McGown and Tucker. We also provide uniform estimates for the moments of the genus numbers of cubic fields.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19224v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Haohao Zhang",
      "Bowen Gu",
      "Xianhua Yu",
      "Hao Xie",
      "Liejun Wang",
      "Yongjun Xu",
      "Xiaoming Tao",
      "Haijun Zhang"
    ],
    "title": "Movable-Antenna Empowered Backscatter ISAC: Toward Geometry-Adaptive, Low-Power Networks",
    "abstract": "Backscatter-based integrated sensing and communication (B-ISAC) elevates passive tags into information-bearing scatterers, offering an ultra-low-power path toward dual-function wireless systems. However, this promise is fundamentally undermined by a cascaded backscattering link that suffers from severe double fading and is exquisitely sensitive to geometric misalignment. This article tackles this geometric bottleneck by integrating movable antenna systems (MAS) at the transceiver side. MAS provides real-time, controllable spatial degrees of freedom through sub-wavelength antenna repositioning, enabling active reconfiguration of the cascaded channel without modifying passive tags or consuming additional spectrum. We position this solution within a unified ISAC-backscatter communication-B-ISAC evolution, describe the resulting MAS-assisted B-ISAC architecture and operating principles, and demonstrate its system-level gains through comparative analysis and numerical results. Finally, we showcase the potential of this geometry-adaptive paradigm across key IoT application scenarios, pointing toward future motion-aware wireless networks.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19211v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Neetu Garg",
      "Varsha R"
    ],
    "title": "On a Class of Multi-Dimensional Non-linear Time-Fractional Fokker-Planck Equations Capturing Brownian Motion",
    "abstract": "The time-fractional Fokker-Planck equation is a key model for characterizing anomalous diffusion, stochastic transport, and non-equilibrium statistical mechanics with applications in finance, chaotic dynamics, optical physics, and biological systems. In this work, we develop a semi-analytical solution for the multi-dimensional time-fractional Fokker-Planck equation employing the Laplace residual power series method. This method blends the Laplace transform and the traditional residual power series method, guaranteeing efficient solutions incorporating the memory and nonlocal effects. To validate the accuracy and effectiveness of the approach, we address several examples, including non-linear problems in multi-dimensions, and analyze the evolution of errors. The numerical simulations are compared with existing methods to confirm the adopted method's strength. The smooth and stable error evolution promises that the suggested method is a powerful tool for analyzing time-fractional Fokker-Planck equations.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19164v1",
    "categories": [
      "math.AC",
      "math.AG"
    ],
    "authors": [
      "Ryo Ishizuka",
      "Shou Yoshikawa"
    ],
    "title": "Derived graded modules",
    "abstract": "We introduce the notion of the $\\infty$-category of (complete) derived $G$-graded modules over a $G$-graded ring $R$ for a torsion-free abelian group $G$, and we study its foundational properties. Moreover, we prove a categorical equivalence between (complete) derived $G$-graded modules over $R$ and derived (formal) comodules over a certain comonad constructed from the group ring $R[G]$ of $G$ over $R$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19163v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Paul Terwilliger",
      "Jason Williford"
    ],
    "title": "Strengthening the balanced set condition for the distance-regular graph of the bilinear forms",
    "abstract": "We consider a distance-regular graph $Γ=(X, \\mathcal R)$ called the bilinear forms graph $H_q(D,N-D)$; we assume $N>2D\\geq 6$ and $q \\not=2$. We show that $Γ$ satisfies the following strengthened version of the balanced set condition.\n  For a vertex $x \\in X$ and $0 \\leq i \\leq D$ define $Γ_i(x)=\\lbrace y \\in X\\vert \\partial(x,y)=i\\rbrace$, where $\\partial$ denotes the path-length distance function.\n  Abbreviate $Γ(x)=Γ_1(x)$.\n  Let $V={\\mathbb R}^X$ denote the standard module for ${\\rm Mat}_X(\\mathbb R)$.\n  For $x\\in X$ let $\\hat x \\in V$ have $x$-coordinate 1 and all other coordinates 0.\n  Let $E \\in {\\rm Mat}_X(\\mathbb R)$ denote the primitive idempotent that corresponds to the second largest eigenvalue of the adjacency matrix of $Γ$.\n  For a subset $Ω\\subseteq X$ define $\\widehat Ω= \\sum_{x \\in Ω} \\hat x$.\n  We fix two vertices $x,y \\in X$ and write $k=\\partial(x,y)$. To avoid degenerate situations, we assume\n  $2 \\leq k \\leq D-1$. Using $y$ we obtain an equitable partition $\\lbrace O_i \\rbrace_{i=1}^6$ of the local graph $Γ(x)$.\n  By construction $O_1 = Γ(x) \\cap Γ_{k-1}(y)$ and $O_6 = Γ(x) \\cap Γ_{k+1}(y)$.\n  We call $\\lbrace O_i \\rbrace_{i=1}^6$ the $y$-partition of $Γ(x)$. Let $\\lbrace O'_i \\rbrace_{i=1}^6$ denote the $x$-partition of $Γ(y)$.\n  According to the original balanced set condition, for $i \\in \\lbrace 1,6\\rbrace$ the vector $ E \\widehat O_i - E \\widehat O'_i$ is a scalar multiple of $E{\\hat x}-E{\\hat y}$. We show that for $1 \\leq i \\leq 6$ the vector $ E \\widehat O_i - E \\widehat O'_i$ is a scalar multiple of $E{\\hat x}-E{\\hat y}$. We investigate the consequences of this result.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19145v1",
    "categories": [
      "math.PR",
      "math.AP"
    ],
    "authors": [
      "Juraj Foldes",
      "Declan Stacy"
    ],
    "title": "Stochastic Persistence in Infinite Dimensions",
    "abstract": "Motivated by infinite-dimensional ecological and biological models such as reaction-diffusion SPDEs and stochastic functional differential equations, we develop a general criteria for stochastic persistence (coexistence) in terms of an average lyapunov function, which was previously known only in finite dimensions. To apply our results to SPDEs we analyze the projective process, and we employ a combination of mild (stochastic convolution) and variational (lyapunov function) techniques. Our analysis also requires some nontrivial well-posedness and nonnegativity results for reaction-diffusion SPDEs, which we state and prove in great generality, extending the known results in the literature. Finally, we present several examples including ecological models (Lotka-Volterra), an epidemic model (SIR), and a model for turbulence. Notably we show that, as in the SDE case, coexistence in the Lotka-Volterra model is determined by the invasion rates.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19083v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Chunlin Li",
      "Erxiao Wang",
      "Jie Wu",
      "Min Yan"
    ],
    "title": "Tiling of Hyperbolic Surface by a Single Tile",
    "abstract": "Tilings of a surface of negative Euler characteristic by n-gons with n\\ge 7 is a finite problem. One extreme of the finite problem is single tile tilings. We develop the algorithm for finding all the single tile tilings and present the results for surfaces of small genus.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19046v1",
    "categories": [
      "math.LO",
      "math.CO"
    ],
    "authors": [
      "Felix Weilacher"
    ],
    "title": "LCLs in the Borel Hierarchy",
    "abstract": "A locally checkable labeling problem (LCL) on a group $Γ$ asks one to find a labeling of the Cayley graph of $Γ$ satisfying a fixed, finite set of \"local\" constraints. Typical examples include proper coloring and perfect matching problems. In descriptive combinatorics, one often considers the existence of solutions to LCLs in the setting of descriptive set theory. For example, given a free action of $Γ$ on a Polish space $X$, we might be interested in solving a given LCL on each orbit in a continuous, Borel, measurable, etc. way.\n  In an attempt to understand more finely the gap between Borel and continuous combinatorics, we consider the existence of Baire class $m$ solutions to LCLs. For all $n > 1$ and $m \\in ω$, we produce an LCL on $\\mathbb{F}_n$ which always admits Baire class $m+1$ solutions, but not necessarily Baire class $m$ solutions.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19031v1",
    "categories": [
      "math.AP",
      "math.SP"
    ],
    "authors": [
      "Greyson Meares",
      "Sage Meiling",
      "Charis Tsikkou"
    ],
    "title": "Dynamic Response of a Finite Circular Plate on an Elastic Half-Space Using the Truncated Lamb Kernel",
    "abstract": "We develop an exact operator formulation for the dynamic interaction between a finite circular elastic plate and an elastic half-space. Classical analyses, beginning with Lamb's representation of the half-space response, typically assume an infinite plate and rely on diagonalization of the soil operator via the continuous Hankel transform. For a plate of finite radius $R$, however, both traction and displacement are supported only on $0 \\le r \\le R$, leading to the spatially truncated Lamb operator \\[ \\mathscr{M}(ω) = χ_{[0,R]} \\, T(ω)\\, χ_{[0,R]}, \\] where $T(ω)$ is the Hankel multiplier involving the Rayleigh denominator $Ω(ξ,ω)$. Truncation destroys the diagonal structure of $T(ω)$ and introduces real-axis singularities associated with the Rayleigh pole, in addition to square-root branch points at $ξ= k_T$ and $ξ= k_L$. We represent the action of $\\mathscr{M}(ω)$ on a finite-disk Bessel basis $\\{ φ_n(r) = A_{1,n} J_0(λ_n r) + A_{2,n} I_0(λ_n r)\\},$ which satisfies the free-edge boundary conditions of the plate, and derive explicit expressions for the resulting matrix elements. These involve integrals of the Lamb kernel evaluated as Cauchy principal values, with residue contributions corresponding to radiation damping in the half-space. The resulting operator matrix is dense but spectrally convergent. Its inversion yields a complete frequency-domain solution for finite-radius plates. The analysis reproduces Chen et al.'s finite-radius experiments for small $R$, approaches the infinite-radius limit as $R \\to \\infty$, and quantifies finite-radius corrections. To our knowledge, this is the first exact operator-level treatment of finite-radius plate-half-space interaction that retains the full nonlocal Lamb kernel.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19013v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Zeyi Xu",
      "Long Chen"
    ],
    "title": "Adaptive Accelerated Gradient Descent Methods for Convex Optimization",
    "abstract": "This work proposes A$^2$GD, a novel adaptive accelerated gradient descent method for convex and composite optimization. Smoothness and convexity constants are updated via Lyapunov analysis. Inspired by stability analysis in ODE solvers, the method triggers line search only when accumulated perturbations become positive, thereby reducing gradient evaluations while preserving strong convergence guarantees. By integrating adaptive step size and momentum acceleration, A$^2$GD outperforms existing first-order methods across a range of problem settings.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18978v1",
    "categories": [
      "math.NT",
      "math.FA",
      "math.OC"
    ],
    "authors": [
      "José Burgos Gil",
      "Ricardo Menares",
      "Binggang Qu",
      "Martín Sombra"
    ],
    "title": "Closing the gap around the essential minimum of height functions with linear programming",
    "abstract": "For many common height functions, the explicit determination of the essential minimum is an open problem. We consider a classical method to obtain lower bounds that goes back at least to C.J. Smyth, and a method to obtain upper bounds based on the knowledge of the limit distribution of integral points. We use an infinite dimensional linear programming scheme to show that that both methods agree in the limit, by showing that the principle of strong duality holds in our situation. As a corollary we prove that the essential minimum can be attained by sequences of algebraic integers.\n  Recent results by A. Smith and B. Orloski--N. Sardari, furnish a characterization of compactly supported measures that can be approximated by complete sets of conjugates of algebraic integers, in terms of infinitely many nonnegativity conditions. We establish an extension of this characterization to measures with non necessarily compact support. As an application of this result and of strong duality, we show that the essential minimum is a computable real number when the Green function used to define the height is computable. We systematically use potential theory for measures that can integrate functions with logarithmic growth.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18977v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Teng Zhang"
    ],
    "title": "Johnson's determinantal identity for contiguous minors of Toeplitz matrices, with an accretive extension",
    "abstract": "Let $A$ be an $n\\times n$ real Toeplitz matrix satisfying $A+A^{\\top}=2\\mathbb J_n$, where $\\mathbb J_n$ is the all-ones matrix.If $A_r(i,j)$ denotes the $r\\times r$ contiguous submatrix of $A$ consisting of rows $i,i+1,\\dots,i+r-1$ and columns $j,j+1,\\dots,j+r-1$, then for every $n\\ge 2$ one has $$\\det A_{n-1}(1,2)+\\det A_{n-1}(2,1)=2\\det A_{n-1}(1,1).$$ This confirms a conjecture of Charles R.~Johnson (2003). The proof combines a rank-one determinant expansion with Dodgson's condensation formula, and then invokes a polynomial-identity argument in the Toeplitz parameters: after obtaining an equality of squares in the integral domain $\\mathbb{Z}[b_1,\\dots,b_{n-1}]$, we factor it to deduce an identity up to sign and determine the sign by a suitable specialization.We also give an extension of the Bayat--Teimoori arithmetic--geometric mean identity: for every real accretive matrix $A$, one has the sharp inequality $$\n  \\sqrt{\\det A_{n-1}(1,1)\\ \\det A_{n-1}(2,2)}\n  \\ \\ge\\\n  \\left|\\frac{\\det A_{n-1}(1,2)+\\det A_{n-1}(2,1)}{2}\\right|,$$ with equality whenever the symmetric part has rank one, i.e.\\ $A+A^{\\top}=α\\,ww^{\\top}$ for some $α\\in\\mathbb R$ and $w\\in\\mathbb R^n\\setminus\\{0\\}$,recovering the Bayat--Teimoori equality as a special case.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18947v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Mohammad R. Najafian",
      "Brian C. Vermeire"
    ],
    "title": "On the Strong Stability Preserving Property of Runge-Kutta Methods for Hyperbolic Problems",
    "abstract": "Strong Stability Preserving (SSP) time integration schemes maintain stability of the forward Euler method for any initial value problem. However, only a small subset of Runge-Kutta (RK) methods are SSP, and many efficient high-order time integration schemes do not formally belong to this class. In this work, we introduce a mathematical strategy to analyze the nonlinear stability of RK schemes that may not necessarily belong to the SSP class. With this approach, we mathematically demonstrate that there are time integration schemes outside the class of SSP schemes that can maintain entropy stability and positivity of density and pressure for the Lax-Friedrichs discretization, and Total Variation Diminishing stability for the first-order upwind and the second-order MUSCL schemes. As a result, for these problems, a broader range of RK methods, including the classical fourth-order, four-stage RK scheme, can be used while the numerical integration remains stable. Numerical experiments confirm these theoretical findings, and additional experiments demonstrate similar observations for a wider class of space discretizatins.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18931v1",
    "categories": [
      "math.DG",
      "math.AP"
    ],
    "authors": [
      "Frederick Tsz-Ho Fong",
      "Hung Tran"
    ],
    "title": "Ricci Flow on CP1-bundles over a Product of Kähler-Einstein Manifolds",
    "abstract": "In this paper, we study the Ricci flow on CP1-bundles over a product of Kähler-Einstein manifolds whose initial metric is constructed by the ansatz used in works by M. Wang et. al. We prove that the ansatz is preserved along the Ricci flow. Furthermore, in the Kähler case, we proved that Type I finite-time singularity must occur under such an ansatz.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18928v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Andrés Rubiano"
    ],
    "title": "Center of double extension regular algebras of type (14641)",
    "abstract": "In this paper we compute the center and, in several cases, central subalgebras of double Ore extensions of type (14641) under suitable restrictions on the defining parameters. Part of the analysis is supported by computations in SageMath. As an application, we provide new examples related to the Zariski cancellation problem.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18920v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Aria Nouri"
    ],
    "title": "Belief-Combining Framework for Multi-Trace Reconstruction over Channels with Insertions, Deletions, and Substitutions",
    "abstract": "Optimal reconstruction of a source sequence from multiple noisy traces corrupted by random insertions, deletions, and substitutions typically requires joint processing of all traces, leading to computational complexity that grows exponentially with the number of traces. In this work, we propose an iterative belief-combining procedure that computes symbol-wise a posteriori probabilities by propagating trace-wise inferences via message passing. We prove that, upon convergence, our method achieves the same reconstruction performance as joint maximum a posteriori estimation, while reducing the complexity to quadratic in the number of traces. This performance equivalence is validated using a real-world dataset of clustered short-strand DNA reads.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18854v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Chandana Pati",
      "S. M. Mallikarjunaiah"
    ],
    "title": "Learning constitutive laws under explicit strain limits: An interpretable strain-limiting elasticity--Kolmogorov Arnold neural network framework",
    "abstract": "A physically consistent framework for modeling materials with saturating deformation, such as elastomers and biological tissues, is provided by strain-limiting elasticity. Fundamental limitations of classical elasticity are addressed through the enforcement of bounded strains; however, significant challenges for data-driven learning are posed by the strong nonlinearity of these laws. In this work, an interpretable hybrid constitutive modeling framework integrating strain-limiting elasticity (SLE) with Kolmogorov-Arnold Networks (KANs) is proposed to balance mechanical admissibility with data-driven flexibility. The dominant nonlinear response is captured by the SLE backbone, while smooth residual corrections are learned exclusively via a KAN. Essential mechanical principles-including symmetry, monotonicity, and bounded strain-are embedded directly into the model structure to ensure physical admissibility. The framework is assessed on synthetic benchmarks, where near-exact recovery is achieved in smooth regimes and consistency is retained under sharp transitions. Application to Treloar's rubber elasticity data demonstrates systematic improvement in stress-stretch agreement while preserving explicit strain limits. A regime-based analysis reveals a transparent trade-off between data fidelity and mechanical admissibility, demonstrating that deviations arise from deliberately imposed physical restrictions rather than unconstrained model expressivity. This SLE-KAN framework offers a robust, physics-consistent alternative to black-box neural networks for constitutive modeling.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18816v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Jean-Christophe Pain"
    ],
    "title": "Three expressions of the $n$-th prime number: discrete sieving, spectral analysis and probabilistic dynamics",
    "abstract": "The search for a closed-form expression of the $n$-th prime number, $p_n$, has long oscillated between the rigid determinism of analytic functions and the apparent randomness of local distributions. This paper explores three different approaches to $p_n$. The first one formalizes an analytical identity for $p_{n}$ based on a harmonic summation filtered by a Möbius-derived coprimality indicator. Unlike Gandhi's 1971 identity, which employs a geometric density and logarithmic extraction, this formula operates through a discrete summation over the range defined by Bertrand's postulate. In the second one, we refine the ``harmonic resonance'' model, which posits that primes emerge as spectral nodes from von Mangoldt oscillations. Third, we adopt a ``survival dynamics'' approach, inspired by Mertens' theorems, treating prime spacing as an evolutionary growth process. By bridging these perspectives, we offer a comprehensive framework for understanding the transition from asymptotic trends to discrete arithmetic realities.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18918v1",
    "categories": [
      "math.DS",
      "math.FA"
    ],
    "authors": [
      "Bram Lentjes",
      "Seppe Daniëls",
      "Meinder Follon",
      "Yuri A. Kuznetsov"
    ],
    "title": "Center Manifolds and Normal Forms for Nonlinearly Periodically Forced DDEs",
    "abstract": "The aim of this paper is to provide an effective framework for analysing bifurcations of equilibria in nonlinearly periodically forced delay differential equations. First, we establish the existence of a periodic smooth finite-dimensional center manifold near a nonhyperbolic equilibrium using the rigorous functional analytic framework of dual semigroups (sun-star calculus). Second, we construct a center manifold parametrization that allows us to describe the local dynamics on the center manifold near the equilibrium in terms of periodically forced normal forms. Third, we present a normalization method to derive explicit computational formulas for the critical normal form coefficients at a bifurcation of interest. In particular, we obtain such formulas for the periodically forced fold and nonresonant Hopf bifurcation. Several examples and indications from the literature confirm the validity and effectiveness of our approach.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18855v1",
    "categories": [
      "math.HO",
      "math.NT"
    ],
    "authors": [
      "José L. Cereceda"
    ],
    "title": "The most concise recurrence formula for the sums of integer powers",
    "abstract": "For integers $n,k \\geq 1$, let $S_k(n)$ denote the power sum $1^k +2^k + \\cdots + n^k$. In this note, we first recall the minimal recurrence relation connecting $S_k(n)$ and $S_{k-1}(n)$ established by Abramovich (1973). We then discuss an odd algorithm to determine the coefficients of the power sum polynomial $S_k(n)$ in terms of the coefficients of $S_{k-1}(n)$ (see, e.g., Bloom (1993) and Owens (1992)). Moreover, we bring to light an explicit relationship between $S_k(n)$ and $S_{k+1}(n)$ put forward by Budin and Cantor (1972). We conclude that these procedures (including the integration formula expressing $S_k(n)$ in terms of $S_{k-1}(n)$) all constitute equivalent methods to determine $S_k(n)$ starting from $S_{k-1}(n)$. In addition, as a by-product, we provide a determinantal formula for the Bernoulli numbers involving the binomial coefficients.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18831v1",
    "categories": [
      "math.CO",
      "math.MG"
    ],
    "authors": [
      "Lucas Aloisio"
    ],
    "title": "Rigidity-Induced Scaling Laws in Unit Distance Graphs: The Algebraic Collapse of Dense Substructures",
    "abstract": "We revisit the classical Unit Distance Problem posed by Erdős in 1946. While the upper bound of $O(n^{4/3})$ established by Spencer, Szemer'edi, and Trotter (1984) is tight for systems of pseudo-circles, it fails to account for the algebraic rigidity inherent to the Euclidean metric. By integrating structural rigidity decomposition with the theory of Cayley-Menger varieties, we demonstrate that unit distance graphs exceeding a critical density must contain rigid bipartite subgraphs. We prove a \"Flatness Lemma,\" supported by symbolic computation of the elimination ideal, showing that the configuration variety of a unit-distance $K_{3,3}$ (and by extension $K_{4,4}$) in $\\mathbb{R}^2$ is algebraically singular and collapses to a lower-dimensional locus. This dimensional reduction precludes the existence of the amorphous, high-incidence structures required to sustain the $n^{4/3}$ scaling, effectively improving the upper bound for non-degenerate Euclidean configurations.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19200v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Dipti Paik",
      "Divya Ahuja",
      "Surjeet Kour"
    ],
    "title": "Characterizations of higher derivations and higher differential torsion theories in Eilenberg-Moore categories of monads",
    "abstract": "Let $T$ be a monad on a category $\\mathscr{C}$. In this paper, we introduce the notion of higher derivations on the monad $T$ and characterize them in terms of ordinary derivations on $T$. We also define higher derivations on modules over the monad $T$ in the Eilenberg-Moore category $EM_T$ and establish their characterization in a similar manner. We provide several examples that illustrate and support our results. Furthermore, we examine the conditions under which a torsion theory on $EM_T$ is higher differential, and show that this holds if and only if every higher derivation on a module $M \\in EM_T$ extends uniquely to its module of quotients $Q_τ(M)$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19196v1",
    "categories": [
      "math.DG",
      "math.SP"
    ],
    "authors": [
      "Egor Morozov"
    ],
    "title": "Rotationally symmetric critical metrics for Laplace eigenvalues on tori in a conformal class",
    "abstract": "We study the problem of maximizing the first Laplace-Beltrami eigenvalue normalized by area in a conformal class on a torus. By a result of Nadirashvili, El Soufi, and Ilias, critical metrics for the $k$-th normalized Laplace-Beltrami eigenvalue functional $\\barλ_k$ in a conformal class correspond to harmonic maps to spheres. In this paper we construct certain $\\mathbb S^1$-equivariant harmonic maps $\\mathbb T^2\\to\\mathbb S^3$. For each non-rhombic conformal class on a torus, one of these maps corresponds to a rotationally symmetric critical metric for $\\barλ_1$ in this conformal class with the value of $\\barλ_1$ being greater than that of the flat metric. This refines a recent result by Karpukhin that answers a question by El Soufi, Ilias, and Ros. Also, we are able to show that if a rotationally invariant metric on a rectangular torus is maximal for $\\barλ_1$ in its conformal class, then it is $\\mathbb S^1$-equivariant and coincides (up to a scalar factor) with the above metric. Finally, we show that a family of minimal tori in $\\mathbb S^3$ called Otsuki tori fits naturally into our family. This gives an explicit parametrization of Otsuki tori in terms of elliptic integrals.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19177v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Zhaoyan Chen"
    ],
    "title": "Integral moment of the Riemann zeta function and Hecke $L$-functions, II",
    "abstract": "In this paper, let $f$ be a Hecke cusp form for $SL(2,\\mathbb{Z})$. We establish an asymptotic formula for the mixed moment of $ζ^{2}(s)$ and $L(s,f)$ on the critical line, valid for both holomorphic and Maass forms.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19101v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Juan C. Muñoz-Sánchez",
      "J. Tomás Lázaro",
      "Josep Sardanyés",
      "Santiago F. Elena"
    ],
    "title": "Multiscale feedback drives viral evolution and epidemic dynamics",
    "abstract": "We introduce a minimal multiscale framework that links within-host virus dynamics to population-level SIRS epidemiology through explicit, bidirectional coupling. At the microscopic layer, a two variant quasispecies (master and mutant genomes with packaged virions) evolves on a fast timescale. At the macroscopic layer, two infectious classes (master- and mutant-infected), susceptible, recovered, and deceased individuals evolve slowly. The two scales are connected through transmission rates that depend on instantaneous virion abundance and through prevalence-weighted effective replication rates. Exploiting the timescale separation, we formalize a coarse-grained slow-fast closure: the genome-virion subsystem rapidly relaxes to quasi-steady states that parameterize time-varying transmission in the slow epidemiological system. This yields an integrated expression for the basic reproduction number and sharp inequalities that delineate coexistence versus exclusion. A key prediction is a context-dependent error threshold that shifts with the prevalence ratio, enabling transient pseudo-error catastrophes driven by epidemic composition rather than intrinsic fidelity. Linearization reveals parameter regions with damped oscillations arising solely from the microscopic-macroscopic feedback. Two illustrative extremes bracket the model's behavior: an avirulent strongly immunizing strain that benignly replaces the master, and a hypervirulent weakly immunizing that self-limits via host depletion and collapses transmission. This framework yields testable signatures linking viral load, incidence, and within-host composition.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19097v1",
    "categories": [
      "math-ph",
      "gr-qc",
      "hep-th",
      "math.PR"
    ],
    "authors": [
      "Sourav Chatterjee"
    ],
    "title": "Exact calculations beyond charge neutrality in timelike Liouville field theory",
    "abstract": "Timelike Liouville field theory (also known as imaginary Liouville theory or imaginary Gaussian multiplicative chaos) is expected to describe two-dimensional quantum gravity in a positive-curvature regime, but its path integral is not a probability measure and rigorous exact computations are currently available only in the charge-neutral (integer screening) case. In this paper we show that at the special coupling $b=1/\\sqrt{2}$, the Coulomb-gas expansion of the timelike path integral becomes explicitly computable beyond charge neutrality. The reason is that the $n$-fold integrals generated by the interaction acquire a Vandermonde/determinantal structure at $b=1/\\sqrt{2}$, which allows exact evaluation in terms of classical special functions. We derive Mellin-Barnes type representations (involving the Barnes $G$-function and, in a three-point case, Gauss hypergeometric functions) for the zero- and one-point functions, for an antipodal two-point function, and for a three-point function with a resonant insertion $α_2=b$. We then address the subtle zero-mode integration: after a Gaussian regularization we obtain an explicit renormalized partition function $C(1/\\sqrt{2},μ)=e(4π\\sqrt2 μ)^{-1}$, identify distributional limits in the physically relevant regime $α_j=\\frac{1}{2}Q+\\mathrm{i} P_j$, and compare with the Hankel-contour prescription recently proposed in the physics literature. These results provide the first rigorously controlled family of exact calculations in timelike Liouville theory outside charge neutrality.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19050v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Everett W. Howe"
    ],
    "title": "Curves of genus two with maps of every degree to a fixed elliptic curve",
    "abstract": "We show that up to isomorphism there are exactly twenty pairs $(C,E)$, where $C$ is a genus-$2$ curve over ${\\mathbf C}$, where $E$ is an elliptic curve over ${\\mathbf C}$, and where for every integer $n>1$ there is a map of degree $n$ from $C$ to $E$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19043v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Gabriela Araujo-Pardo",
      "Leonardo Martínez-Sandoval"
    ],
    "title": "The arc chromatic number for Galois projective planes, affine planes and Euclidean grids",
    "abstract": "We establish that the minimum number of arcs required to partition the Galois projective plane $\\text{PG}(2,q)$ is $q+1$. Furthermore, we determine the exact value for a fractional variant of this problem.\n  We extend our analysis to affine planes $\\text{AG}(2,q)$, proving that they can be partitioned into $q$ arcs. In particular, we show that this partition is tight when $q$ is an odd prime power, and that a $(q-1)$-partition is attainable for $q=2^k$ with $k \\in \\{1,2,3\\}$. For $q=2^k$ with $k \\geq 4$, we provide bounds between two possible values.\n  Finally, we apply these results to Euclidean grids, demonstrating that a partition into $(1+ε)n$ sets in general position exists for any $ε> 0$ and sufficiently large $n$. We also present exact minimal partitions for small Euclidean grids.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19024v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Pablo Groisman",
      "Alejandro F. Ramírez",
      "Santiago Saglietti",
      "Sebastián Zaninovich"
    ],
    "title": "A universality property for large deviations of RWRE close to the axis",
    "abstract": "We establish a general version of the strong KPZ universality conjecture near the axis for random walks in a random environment (RWRE) on $\\mathbb{Z}^2$. For an i.i.d. elliptic random environment, we consider the quenched large deviations probabilities for trajectories starting at the origin and arriving at time $n+[n^a]$ to the position $(n,[n^a])$ and show that, if the logarithm of the right-jump probability has a finite moment of order $p>2$, then for $a < \\frac{3}{7}(1-\\frac{2}{p})$ the fluctuations of these propabilities are asymptotically governed by the GUE Tracy-Widom distribution. Our results are based on a comparison between RWRE and a last passage percolation model, whose asymptotic fluctuations near the axis were previously established independently by Bodineau-Martin and Baik-Suidan. Furthermore, we obtain also the full convergence to the directed landscape in this regime based on the extension of the aforementioned results to this setting by McKeown and Zhang.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19023v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Matt Visser"
    ],
    "title": "Explicit formulae for stochastic equilibria",
    "abstract": "Finding the stochastic equilibria for finite-state stochastic matrices amounts to solving an eigen\\-vector problem $π= πP$. Various techniques for doing so are known, some extremely computationally intensive. Herein we shall aim to extract a number of relatively simple analytic results that shed light on this problem. It is very easy to find an explicit general formula for the equilibrium vector (when it is unique) of a $2\\times 2$ stochastic matrix. The corresponding explicit general formula for the equilibrium vector (when it is unique) of a $3\\times 3$ stochastic matrix is a somewhat messier four-line result. (Though with a bit of work you can shoe-horn it into one line of text.) An explicit general formula for the equilibrium vector (when it is unique) of a $4\\times 4$ stochastic matrix requires a paragraph of text. Ultimately, for $n\\times n$ stochastic matrices a general and fully explicit construction of the equilibrium vector (when it is unique) can be developed in terms of a suitable adjugate (classical adjoint) matrix, and can subsequently be reduced to the computation of $n$ principal matrix minors. Finally, an application to random walks on graphs is presented.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19012v1",
    "categories": [
      "math.FA",
      "math.CA",
      "math.NA"
    ],
    "authors": [
      "Yurii Kolomoitsev"
    ],
    "title": "Approximation by linear sampling operators in Banach spaces",
    "abstract": "This paper studies approximation properties of linear sampling operators in general Banach lattices $X$. We obtain matching direct and inverse approximation estimates, convergence criteria, equivalence results involving special $K$-functionals and their realizations by sampling operators, as well as strong converse inequalities, which, to the best of our knowledge, have not been previously established for sampling operators even in the classical spaces $L_p$. The results extend several classical theorems previously known mainly in $L_p$ and apply to all functions $f\\in X$ for which the corresponding sampling operator is well defined, thereby substantially enlarging the class of functions that can be considered in this framework.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19299v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Minghui Zhang",
      "Xun Li",
      "Xin Zhang"
    ],
    "title": "Continuous-time q-learning for Markov regime switching system under Tsallis entropy",
    "abstract": "This paper studies the continuous-time q-learning (the continuous time counterpart of Q-learing) for Markov switching system under Tsallis entropy regularization. We address the difficulty in traditional RL algorithms where the Tsallis entropy regularization leads to an optimal policy distribution not necessarily a Gibbs measure, which often complicates algorithm design. Furthermore, to address the limited universality of current continuous time regime-switching RL algorithms (often restricted to the EMV framework), this study focuses on continuous-time q-learning for Markov regime-switching systems based on Tsallis entropy, aiming for a more universally applicable continuous-time RL method. We establish the martingale characterization of the q-function under Tsallis entropy for continuous-time Markov regime-switching systems. Based on this, we design two q-learning algorithms, distinguished by whether the Lagrange multiplier can be explicitly derived. We apply these algorithms to the continuous-time exploratory Mean-Variance (EMV) portfolio optimization problem in a regime-switching market. Numerical experiments demonstrate the satisfactory performance of our q-learning algorithms.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19274v1",
    "categories": [
      "math.CV",
      "math.AP"
    ],
    "authors": [
      "Daniel Alayón-Solarz"
    ],
    "title": "Variable Elliptic Structures on the Plane: Transport Dynamics, Rigidity, and Function Theory",
    "abstract": "We study variable elliptic structures in the plane defined by a smoothly varying quadratic relation i^2 + beta(x,y) i + alpha(x,y) = 0, and the associated first order operator dbar = 1/2 (dx + i dy). Differentiating the structure relation yields explicit expressions for the derivatives of i(x,y) in terms of the coefficient functions alpha and beta, leading to a universal transport system governing their admissible variations. In the elliptic regime this system reduces to a forced complex Burgers equation for a scalar spectral parameter encoding the structure coefficients. We identify a rigidity condition under which the transport becomes conservative, and show that in this regime the generalized Cauchy Riemann operator satisfies a Leibniz rule and admits a factorization of the associated second order operator into first order components. As a consequence, classical tools of planar complex analysis, including Cauchy Pompeiu type formulas, integral representations, and elliptic second order operators, reappear in a variable coefficient setting with explicit structure. The theory is developed at the level of direct computation, emphasizing transparency of the integrability mechanism and the interplay between transport dynamics, rigidity, and function theory.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19250v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Weiwei Xu",
      "Weijie Shen",
      "Zhengjian Bai",
      "Chen Xu"
    ],
    "title": "Precision-induced Adaptive Randomized Low-Rank Approximation for SVD and Matrix Inversion",
    "abstract": "Singular value decomposition (SVD) and matrix inversion are ubiquitous in scientific computing. Both tasks are computationally demanding for large scale matrices. Existing algorithms can approximatively solve these problems with a given rank, which however is unknown in practice and requires considerable cost for tuning. In this paper, we tackle the SVD and matrix inversion problems from a new angle, where the optimal rank for the approximate solution is explicitly guided by the distribution of the singular values. Under the framework, we propose a precision-induced random re-normalization procedure for the considered problems without the need of guessing a good rank. The new algorithms built upon the procedure simultaneously calculate the optimal rank for the task at a desired precision level and lead to the corresponding approximate solution with a substantially reduced computational cost. The promising performance of the new algorithms is supported by both theory and numerical examples.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19226v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Masashi Mizuno",
      "Ayumi Sakiyama",
      "Keisuke Takasao"
    ],
    "title": "The Łojasiewicz-Simon inequality related to grain boundary motion and its applications",
    "abstract": "In this paper, we study the Łojasiewicz-Simon gradient inequality for the mathematical model of grain boundary motion. We first derive a curve shortening equation with time-dependent mobility, which guarantees the energy dissipation law for the grain boundary energy, including the difference between orientations of the constituent grains as a state variable. Next, we discuss the Łojasiewicz-Simon gradient inequality for the grain boundary energy. Finally, we give applications of the inequality to the energy.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18935v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Bernard Bercu",
      "Claudia Contardi",
      "Emanuele Dolera",
      "Stefano Favaro"
    ],
    "title": "A Central Limit Theorem for the Ewens-Pitman random partition in the large-$θ$ regime via a martingale approach",
    "abstract": "The Ewens-Pitman model defines a distribution on random partitions of $\\{1,\\ldots,n\\}$, with parameters $α\\in [0,1)$ and $θ> -α$; the case $α=0$ reduces to the classical Ewens model from population genetics. We investigate the large-$n$ asymptotic behaviour of the Ewens-Pitman random partition in the nonstandard regime $θ=λn$ with $λ>0$, establishing joint fluctuation results for the total number of blocks $K_n^{\\{n\\}}$ and the counts $K_{r,n}^{\\{n\\}}$ of blocks of sizes $r=1,\\dots,d$, for fixed $d\\in\\mathbb{N}$. In particular, for $α\\in[0,1)$ and $θ=λn$, our main result provides a strong law of large numbers and a central limit theorem for the $(d+1)$-dimensional vector $\\mathbf{K}_{d,n}^{\\{n\\}} = \\bigl(K_n^{\\{n\\}}, K_{1,n}^{\\{n\\}}, \\dots, K_{d,n}^{\\{n\\}}\\bigr)^T$ as $n \\to \\infty$. The proof exploits the Chinese restaurant sequential construction under $θ=λn$ and a central limit theorem for triangular arrays of martingales, extending techniques previously developed for the classical regime with fixed $θ$. As corollaries of our results, we recover known asymptotics for $K_n^{\\{n\\}}$ and derive new strong laws and central limit theorems for each fixed $K_{r,n}^{\\{n\\}}$, thereby completing earlier weak-law results and providing a comprehensive asymptotic description of the Ewens-Pitman partition structure in the large-$θ$ setting.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18906v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Vittorio Colao",
      "Katherine Rossella Foglia"
    ],
    "title": "On the Convergence of HalpernSGD",
    "abstract": "HalpernSGD is a gradient-type optimizer obtained by combining the classical Halpern fixed-point iteration with a stochastic gradient step. While its empirical advantages have already been observed in \\cite{colao2025optimizer,foglia2024halpernsgd}, this paper provides a theoretical analysis of the method. Assuming a convex $L$-smooth objective and standard stochastic-approximation conditions, we prove almost sure convergence of the iterates to a minimizer, characterized as the metric projection of the anchor onto the solution set. These results fill a gap in the literature on HalpernSGD and lay the groundwork for future extensions to adaptive schemes.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18807v1",
    "categories": [
      "math.AC",
      "math.FA"
    ],
    "authors": [
      "G. Bezhanishvili",
      "P. J. Morandi"
    ],
    "title": "Generalizing Gelfand duality to Nachbin spaces",
    "abstract": "We introduce the notion of a Nachbin proximity on a bounded archimedean $\\ell$-algebra (bal-algebra), and show that Gelfand duality lifts to yield a dual equivalence between the category of uniformly complete bal-algebras equipped with a closed Nachbin proximity and that of Nachbin spaces (compact ordered spaces). The key ingredients of the proof include appropriate generalizations of the Stone-Weierstrass theorem and Dieudonné's lemma. We also develop an alternate approach by means of bounded archimedean $\\ell$-semialgebras (sbal-algebras), from which we derive De Rudder--Hansoul duality.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19183v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Xiang Zhang",
      "Zhou Li",
      "Han Yu",
      "Kai Wan",
      "Hua Sun",
      "Mingyue Ji",
      "Giuseppe Caire"
    ],
    "title": "Information-Theoretic Secure Aggregation over Regular Graphs",
    "abstract": "Large-scale decentralized learning frameworks such as federated learning (FL), require both communication efficiency and strong data security, motivating the study of secure aggregation (SA). While information-theoretic SA is well understood in centralized and fully connected networks, its extension to decentralized networks with limited local connectivity remains largely unexplored. This paper introduces \\emph{topological secure aggregation} (TSA), which studies one-shot, information-theoretically secure aggregation of neighboring users' inputs over arbitrary network topologies. We develop a unified linear design framework that characterizes TSA achievability through the spectral properties of the communication graph, specifically the kernel of a diagonally modulated adjacency matrix. For several representative classes of $d$-regular graphs including ring, prism and complete topologies, we establish the optimal communication and secret key rate region. In particular, to securely compute one symbol of the neighborhood sum, each user must (i) store at least one key symbol, (ii) broadcast at least one message symbol, and (iii) collectively, all users must hold at least $d$ i.i.d. key symbols. Notably, this total key requirement depends only on the \\emph{neighborhood size} $d$, independent of the network size, revealing a fundamental limit of SA in decentralized networks with limited local connectivity.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19126v1",
    "categories": [
      "cs.IT",
      "quant-ph"
    ],
    "authors": [
      "Xi Wang",
      "Parastoo Sadeghi",
      "Guodong Shi"
    ],
    "title": "How Entanglement Reshapes the Geometry of Quantum Differential Privacy",
    "abstract": "Quantum differential privacy provides a rigorous framework for quantifying privacy guarantees in quantum information processing. While classical correlations are typically regarded as adversarial to privacy, the role of their quantum analogue, entanglement, is not well understood. In this work, we investigate how quantum entanglement fundamentally shapes quantum local differential privacy (QLDP). We consider a bipartite quantum system whose input state has a prescribed level of entanglement, characterized by a lower bound on the entanglement entropy. Each subsystem is then processed by a local quantum mechanism and measured using local operations only, ensuring that no additional entanglement is generated during the process. Our main result reveals a sharp phase-transition phenomenon in the relation between entanglement and QLDP: below a mechanism-dependent entropy threshold, the optimal privacy leakage level mirrors that of unentangled inputs; beyond this threshold, the privacy leakage level decreases with the entropy, which strictly improves privacy guarantees and can even turn some non-private mechanisms into private ones. The phase-transition phenomenon gives rise to a nonlinear dependence of the privacy leakage level on the entanglement entropy, even though the underlying quantum mechanisms and measurements are linear. We show that the transition is governed by the intrinsic non-convex geometry of the set of entanglement-constrained quantum states, which we parametrize as a smooth manifold and analyze via Riemannian optimization. Our findings demonstrate that entanglement serves as a genuine privacy-enhancing resource, offering a geometric and operational foundation for designing robust privacy-preserving quantum protocols.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19084v1",
    "categories": [
      "math.PR",
      "math.OC"
    ],
    "authors": [
      "Jiusheng Liu",
      "Jing Zhang"
    ],
    "title": "A Probabilistic Interpretation of the Master Equation Arising from Mean Field Games with Jump Diffusion",
    "abstract": "In this paper we study the classical solution to the master equation arising from mean-field games (MFGs) driven by jump-diffusion processes. The master equation, a nonlinear partial differential equation on Wasserstein space, characterizes the value function of MFGs and is challenging to analyze directly due to its measure-valued derivatives. We propose a probabilistic interpretation using coupled McKean-Vlasov forward-backward stochastic differential equations (MV-FBSDEs) with jumps. Under suitable Lipschitz and differentiability assumptions on the coefficients, we first establish the well-posedness of the MV-FBSDEs on a small time interval via a contraction mapping argument. We then prove the existence and regularity of the first- and second-order derivatives of the solutions with respect to the spatial and measure variables, relying on careful estimates involving jump terms and measure derivatives. Finally, we show that the decoupling field of the MV-FBSDEs satisfies the master equation in the classical sense, providing both existence and uniqueness of the solution. Our work extends earlier results on diffusion-driven MFGs to the jump-diffusion setting and offers a probabilistic framework for analyzing and numerically solving such kind of master equations.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19058v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Arantha Ranu"
    ],
    "title": "Failure of the Gibbs inequality for continuous potentials",
    "abstract": "It is well known that the Gibbs inequality, which says that the Gibbs ratio is bounded above and below by positive constants, holds for the unique equilibrium states of Hölder continuous potentials on shift spaces, but it can fail for continuous potentials. In this article, we study the validity of a weaker form of the Gibbs inequality in this broader setting.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19038v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Long Chen",
      "Hao Luo",
      "Jingrong Wei",
      "Zeyi Xu",
      "Yuan Yao"
    ],
    "title": "Accelerated Mirror Descent Method through Variable and Operator Splitting",
    "abstract": "Mirror descent uses the mirror function to encode geometry and constraints, improving convergence while preserving feasibility. Accelerated Mirror Descent Methods (Acc-MD) are derived from a discretization of an accelerated mirror ODE system using a variable--operator splitting framework. A geometric assumption, termed the Generalized Cauchy-Schwarz (GCS) condition, is introduced to quantify the compatibility between the objective and the mirror geometry, under which the first accelerated linear convergence for Acc-MD on a broad class of problems is established. Numerical experiments on smooth and composite optimization tasks demonstrate that Acc-MD consistently outperforms existing accelerated variants, both theoretically and empirically.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19003v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Santanu S Dey",
      "Jingye Xu"
    ],
    "title": "Asymptotically tight Lagrangian dual of smooth nonconvex problems via improved error bound of Shapley-Folkman Lemma",
    "abstract": "In convex geometry, the Shapley-Folkman Lemma asserts that the nonconvexity of a Minkowski sum of $n$ dimensional bounded nonconvex sets does not accumulate once the number of summands exceeds the dimension $n$, and thus the sum becomes approximately convex. Originally published by Starr in the context of quasi-equilibrium in nonconvex market models in economics, the lemma has since found widespread use in optimization, particularly for estimating the duality gap of the Lagrangian dual of separable nonconvex problems. Given its foundational nature, we pose the following geometric question: Is it possible for the nonconvexity of the Minkowski sum of $n$-dimensional nonconvex sets to even diminish instead of just not accumulating as the number of summands increases, under some general conditions? We answer this affirmatively. First, we provide an elementary geometric proof of the Shapley-Folkman Lemma based on the facial structure of the convex hull of each set. This leads to refinement of the classical error bound derived from the lemma. Building on this new geometric perspective, we further show that when most of the sets satisfy a certain local smoothness condition which naturally arises in the epigraphs of smooth functions, their Minkowski sum converges directly to a convex set, with a vanishing nonconvexity measure. In optimization, this implies that the Lagrangian dual of block-structured smooth nonconvex problems with potentially additional sparsity constraints is asymptotically tight under mild assumptions, which contracts nonvanishing duality gap obtained via classical Shapley-Folkman Lemma.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18994v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Michael Borinsky",
      "Chiara Meroni",
      "Maximilian Wiesmann"
    ],
    "title": "Asymptotic number of edge-colored regular graphs",
    "abstract": "We prove a formula for the asymptotic number of edge-colored regular graphs with a prescribed set of allowed vertex-incidence structures. The formula depends on specific critical points of a polynomial encoding the vertex-incidences. As an application, we compute the expected number of proper $c$-edge-colorings of a large random $k$-regular graph.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18990v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Eran Assaf",
      "Victor Chen",
      "Rohan Garg",
      "Benny Wang"
    ],
    "title": "Efficient enumeration of quadratic lattices",
    "abstract": "We present an algorithm to enumerate isometry classes of integral quadratic lattices of a given rank and determinant, and analyze its running time by giving bounds on the number of genus symbols for a fixed rank and determinant. We build on previous work of Brandhorst, Hanke, and Dubey and Holenstein. We analyze the running times of their respective algorithms and compare the practical performance of their implementations with our own. Our implementations are publicly available.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18985v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Chad M. Topaz"
    ],
    "title": "Reliable Topology for Dynamic Data: Mathematical Foundations and Applications",
    "abstract": "Across many scientific domains, practitioners rely on coarse, discretized summaries to track the evolving structure of complex systems under noise, measurement error, and changing system size. Understanding when such summaries are reliable -- and when apparent robustness is illusory -- remains a fundamental challenge. Topological data analysis (TDA) provides a case study: Crocker diagrams track the number of topological features across spatial scale and time, and because they are computationally efficient and easy to interpret, they have been widely used for exploratory analysis, bifurcation detection, model selection, and parameter inference. Despite their popularity, Crocker diagrams have lacked rigorous stability guarantees ensuring robustness to small data distortions. We develop a conditional stability theory for Crocker diagrams constructed from evolving point clouds. Our main results include deterministic conditions guaranteeing exact invariance when pairwise distances are well separated from the diagram's discretization thresholds, together with bounds on how much the diagrams can change when these conditions fail. We also establish probabilistic stability guarantees under Gaussian noise and bounds on topological change caused by adding or removing points, scaling linearly with the number of modified points. We illustrate these results using two complementary examples: an analytically tractable breathing polygon model that reveals how stability thresholds depend on geometry, and a feasibility analysis of epithelial cell imaging data showing when bounded-change guarantees provide the appropriate robustness framework. Together, these results reveal a two-tier stability structure for coarse, discretized topological summaries: exact invariance under verifiable geometric separation conditions, and geometry-controlled bounded change otherwise.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18982v1",
    "categories": [
      "math.GR",
      "math.CO"
    ],
    "authors": [
      "Kirwin Hampshire",
      "Florian Lehner",
      "Andrew Wood"
    ],
    "title": "Edge Inversions in $(P_k)$-closed Groups",
    "abstract": "We construct $(P_2)$-closed groups acting on $T_3$ in which all edge inversions have infinite order. This provides a negative answer to a question posed by Tornier. We also construct a family of $(P_2)$-closed groups for which the smallest order of an edge inversion is an arbitrarily high finite number.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19418v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Martin Dietzfelbinger"
    ],
    "title": "Dismantling the Surprise Test \"Paradox\"",
    "abstract": "Consider the following story: A teacher announces to her students a test for the following week, such that the test will be ``surprising''. The students use this as the basis for a ``logical derivation'' and reach a contradiction, which they (falsely) interpret as saying that there cannot be a test. The teacher gives a test e.g. on Wednesday, ``surprising'' the students. Its curious turns give the story the flavor of a paradox. Alternative names are the {\\it unexpected hanging paradox\\/} and the {\\it prediction paradox}. Discussions and analyses of the story in the philosophical and mathematical literature are abundant, spanning 80 years until today. Apparently, none of the known explanations has been generally accepted as conclusive. We offer a fresh view, in propositional logic. ``Surprise'' is captured as unprovability of a certain formula from some axiom system. ``Knowledge'' corresponds to axiom systems and can be gained by mathematical proofs. The notorious property of self-reference in the announcement is cleanly accommodated. All errors made by the students are identified. A general analysis shows that the students cannot learn anything from the announcement. This is the first mathematically precise analysis of the story that shows that self-reference, full power of mathematical proofs, and truthfulness of the teacher can consistently coexist. The ``paradox'' vanishes. In order to facilitate comparisons with treatments using modal logic a version based on system S5 is also given. A formula $σ$ is identified that formalizes ``there will be a surprising test'', and it is shown that the students take the announcement to mean $\\squareσ$ while in fact the information conveyed by it is not stronger than $\\diamondσ$. This dissolves all contradictions or ``paradoxical'' issues.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19417v1",
    "categories": [
      "math.PR",
      "math.GR"
    ],
    "authors": [
      "Jérémie Brieussel",
      "Romain Tessera",
      "Tianyi Zheng"
    ],
    "title": "Concentration inequalities for maximal displacement of random walks on groups of polynomial growth",
    "abstract": "We prove Gaussian concentration inequalities for maximal displacement of compactly supported random walks on a compactly generated locally compact group with polynomial growth. Concentration inequalities with different exponents hold for non-centred random walks as well, after correction by the drift.\n  When the support of the measure generates a virtually nilpotent group, we provide an effective version of this result. These more refined estimates rely on the existence of a ``quantitative splitting'' of a virtually simply connected nilpotent group, a result which may be of independent interest.\n  As applications, we deduce that the same concentration inequalities hold for centred random walks on the following classes of groups: amenable connected Lie groups (including non-unimodular ones), polycyclic and more generally finitely generated solvable groups with finite Prüfer rank. This shows in particular that centred random walk are diffusive on such groups. For polycyclic groups, this strengthens and completes partial results previously obtained by Russ Thompson in 2011.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19389v1",
    "categories": [
      "math.ST",
      "math.PR"
    ],
    "authors": [
      "F. Belzunce",
      "C. Martínez-Riquelme",
      "M. Pereda"
    ],
    "title": "Sufficient Conditions for Some Stochastic Orders of Discrete Random Variables with Applications in Reliability",
    "abstract": "In this paper we focus on providing sufficient conditions for some well-known stochastic orders in reliability but dealing with the discrete versions of them, filling a gap in the literature. In particular, we find conditions based on the unimodality of the likelihood ratio for the comparison in some stochastic orders of two discrete random variables. These results have interest in comparing discrete random variables because the sufficient conditions are easy to check when there are no closed expressions for the survival functions, which occurs in many cases. In addition, the results are applied to compare several parametric families of discrete distributions.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19357v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Yang Yang",
      "Mingjiao Yan",
      "Zongliang Zhang",
      "Yinpeng Yin",
      "Qiang Liu",
      "You-liang Li"
    ],
    "title": "Seepage analysis using a polygonal cell-based smoothed finite element method",
    "abstract": "This work develops a polygonal cell-based smoothed finite element method for steady-state, transient, and free-surface seepage in saturated porous media. Wachspress interpolation on convex polygonal elements is combined with cell-based gradient smoothing, so that element matrices are assembled using boundary integrals without in-element derivatives. Polygonal, quadtree, and hybrid quadtree--polygonal meshes are employed to accommodate local refinement and hanging nodes, and a solution-driven adaptive strategy further concentrates resolution near steep gradients and wet--dry transitions. Free-surface seepage is solved using a fixed-mesh iterative scheme that updates the wetted region, permeability field, and boundary conditions. Benchmark tests demonstrate accurate hydraulic-head and free-surface predictions, and show that adaptivity attains similar accuracy with substantially fewer degrees of freedom and CPU time.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19301v1",
    "categories": [
      "math.RA",
      "math.CO"
    ],
    "authors": [
      "David Dolžan"
    ],
    "title": "Eigenvalues of the product matrices of finite commutative rings",
    "abstract": "The product matrix of a finite commutative ring $R=\\{x_1,x_2,\\ldots,x_n\\}$ and an element $u \\in R$ is the matrix $A_u(R)=[a_{ij}]$, where $a_{ij}=1$ if $x_ix_j=u$, and $a_{ij}=0$ otherwise. This provides a natural extension of the concept of the adjacency matrix of the zero-divisor graph of a ring, which has been studied extensively. In this paper, we find the characteristic polynomial of $A_u(R)$ for a local ring $R$ of odd order and a unit $u$. By studying the structure of a finite local ring, we find the characteristic polynomial of $A_u(R)$ for a local ring $R$ and any $u \\in R$ in two cases: when the Jacobson radical of $R$ has either the maximal or the minimal possible index of nilpotency.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19253v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Pascual Lucas",
      "José Antonio Ortega-Yagües"
    ],
    "title": "A property that characterizes the Enneper surface and helix surfaces",
    "abstract": "The main goal of this paper is to show that helix surfaces and the Enneper surface are the only surfaces in the 3-dimensional Euclidean space $R^3$ whose isogonal lines are generalized helices and pseudo-geodesic lines.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19416v1",
    "categories": [
      "math.CA",
      "math.NA"
    ],
    "authors": [
      "Lidia Fernández",
      "Ana Foulquié-Moreno",
      "Juan Antonio Villegas"
    ],
    "title": "Jacobi-Piñeiro Multiple Orthogonal Polynomials on the simplex",
    "abstract": "It is known that Rodrigues formulas provide a very powerful tool to compute orthogonal polynomials with respect to classical weights. We provide an example of bivariate multiple polynomials on the simplex defined via a Rodrigues formula. This approach offers a natural generalization of Jacobi--Piñeiro polynomials to the multivariate setting. Moreover, we apply these polynomials to the study of the bivariate Hermite--Padé problem on the triangle.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19415v1",
    "categories": [
      "math.QA",
      "math.RT"
    ],
    "authors": [
      "Ivana Baranović",
      "Miroslav Jerkovic",
      "Goran Trupčević"
    ],
    "title": "Generating sets of standard modules for $D_4^{(1)}$",
    "abstract": "Let $\\widetilde{\\mathfrak g}$ be an affine Lie algebra of type $D_4^{(1)}$ and $L(Λ)$ its standard module of level $k$ with highest weight vector $v_Λ$. We define Feigin--Stoyanovsky's type subspace as $W(Λ)=U(\\widetilde{\\mathfrak g}_{1})\\,v_Λ$, where $\\widetilde{\\mathfrak g}=\\widetilde{\\mathfrak g}_{-1}\\oplus\\widetilde{\\mathfrak g}_{0}\\oplus\\widetilde{\\mathfrak g}_{1}$ is a $\\mathbb{Z}$-gradation of $\\widetilde{\\mathfrak g}$ associated with a $\\mathbb{Z}$-gradation $\\mathfrak g=\\mathfrak g_{-1}\\oplus\\mathfrak g_{0}\\oplus\\mathfrak g_{1}$. Using vertex operator relations, we reduce the Poincaré--Birkhoff--Witt spanning set of $W(Λ)$, and describe it in terms of difference and initial conditions. The spanning set of the whole standard module $L(Λ)$ can be obtained as a limit of the spanning set for $W(Λ)$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19414v1",
    "categories": [
      "math.NT",
      "math.GR"
    ],
    "authors": [
      "Jorge Fariña-Asategui"
    ],
    "title": "Arboreal Galois representations of rational functions: fixed-point proportion and the extension problem",
    "abstract": "We give an explicit description of the arithmetic-geometric extension of iterated Galois groups of rational functions. This yields a complete solution to the extension problem when either the arithmetic or the geometric iterated Galois group is branch, answering a question of Adams and Hyde.\n  Furthermore, we obtain a sufficient condition for the arithmetic iterated Galois group of a rational function to have positive fixed-point proportion, which further applies in many instances to the specialization to non strictly post-critical points. In particular, this holds for all unicritical polynomials of odd degree, which greatly generalizes a result of Radi for the polynomial $z^d+1$.\n  Lastly, we obtain the first family of groups acting on the $d$-adic tree whose fixed-point process becomes eventually $d$ for any $d\\ge 2$ with positive probability. What is more, these groups are fractal and branch and thus positive-dimensional; hence they yield the first family of counterexamples to a conjecture of Jones for every $d$-adic tree.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19400v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Shuntaro Nagashima",
      "Hideaki Iiduka"
    ],
    "title": "Improved Convergence Rates of Muon Optimizer for Nonconvex Optimization",
    "abstract": "The Muon optimizer has recently attracted attention due to its orthogonalized first-order updates, and a deeper theoretical understanding of its convergence behavior is essential for guiding practical applications; however, existing convergence guarantees are either coarse or obtained under restrictive analytical settings. In this work, we establish sharper convergence guarantees for the Muon optimizer through a direct and simplified analysis that does not rely on restrictive assumptions on the update rule. Our results improve upon existing bounds by achieving faster convergence rates while covering a broader class of problem settings. These findings provide a more accurate theoretical characterization of Muon and offer insights applicable to a broader class of orthogonalized first-order methods.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19355v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Mathis Lemay"
    ],
    "title": "Equivalences between certain properties of weighted Lipschitz operators",
    "abstract": "We show that for a weighted Lipschitz operator $ω\\widehat{f}$, certain linear properties are equivalent. Specifically, we prove that compactness, strict singularity, and strict cosingularity are all equivalent to the property of not fixing any complemented copy of $\\ell^1$. Then we generalize this result to operators between Lipschitz-free spaces that preserve finitely supported elements, a larger class of operators.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19330v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Chenjie Fan",
      "Junzhe Wang"
    ],
    "title": "On blow up NLS with a multiplicative noise",
    "abstract": "It is of significant interest to understand whether a noise will speed up or prevent blow up. Under certain nondegenerate conditions, \\cite{dD2005Blowup} proved a multiplicative noise will speed up blow up of NLS, in the sense that, blow up can happen in any short time with positive probability. We prove that such probability is indeed quite small, and provide a large deviation type upper bound.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19319v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Efthymios Sofos"
    ],
    "title": "Counting square-free values of random polynomials",
    "abstract": "We prove that the average error term when counting square-free values of polynomials is the quartic root of the main term.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19282v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Benoît Perthame",
      "Clément Rieutord",
      "Delphine Salort"
    ],
    "title": "A Fokker-Planck equation with superlinear drift at infinity for Integrate-and-Fire model",
    "abstract": "The Integrate-and-Fire model is a Fokker-Planck equation arising in neuroscience. It describes the evolution of the probability density of the neuronal membrane potential and fitting has shown that the inclusion of a em superlinear drift provides the most realistic description. To make sense of this, we propose to set the equation on the full line, the neural activity being described by the flux at infinity. This framework serves as a model extension of the classical Noisy Integrate-and-Fire model, with a fixed firing potential. We first establish the well-posedness of the solution, establish the boundary condition at infinity which is the major difficulty. Then, state rigorously the entropy dissipation property. Finally, using Doeblin's method, we prove the exponential convergence of the solution toward the unique stationary state in full generality.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19252v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Pascual Lucas",
      "José Antonio Ortega-Yagües"
    ],
    "title": "Concircular helices and concircular surfaces in Euclidean 3-space R3",
    "abstract": "In this paper we characterize concircular helices in $R^3$ by means of a differential equation involving their curvature and torsion. We find a full description of concircular surfaces in $R^3$ as a special family of ruled surfaces, and we show that $M$ in $R^3$ is a proper concircular surface if and only if either $M$ is parallel to a conical surface or $M$ is the normal surface to a spherical curve. Finally, we characterize the concircular helices as geodesics of concircular surfaces.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19229v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Benling Li",
      "Wei Zhao"
    ],
    "title": "Unexpected Analytic Phenomena on Finsler Manifolds",
    "abstract": "In the Riemannian setting, every flat Cartan--Hadamard manifold is isometric to Euclidean space, the canonical model that underlies the theory of Sobolev spaces and guarantees the sharpness/rigidity of the Hardy inequality, the uncertainty principle, and the Caffarelli--Kohn--Nirenberg (CKN) inequality. In this paper, we show that on a flat Finsler Cartan--Hadamard manifold -- Berwald's metric space -- the classical picture alters radically: the Nash embedding theorem fails, the Sobolev space becomes nonlinear, and the Hardy and uncertainty inequalities break down completely, whereas the CKN inequality exhibits a sharp threshold in its validity depending on a parameter. By contrast, on Funk metric spaces -- another class of Finsler Cartan--Hadamard manifolds -- this threshold behavior disappears, although all the other non-Riemannian features persist. We trace this divergence to the lower bound of the $S$-curvature. As a consequence, the failure of the aforementioned functional inequalities is established for a broad class of Finsler manifolds.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19195v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Yi Xu",
      "Chufeng Cui",
      "Liqun Qi"
    ],
    "title": "On the SOS Rank of Simple and Diagonal Biquadratic Forms",
    "abstract": "We study the sum-of-squares (SOS) rank of simple and diagonal biquadratic forms. For simple biquadratic forms in $3 \\times 3$ variables, we show that the maximum SOS rank is exactly $6$, attained by a specific six-term form. We further prove that for any $m \\ge 3$, there exists an $m \\times m$ simple biquadratic form whose SOS rank is exactly $2m$, providing a general lower bound that extends the $3\\times3$ case. For diagonal biquadratic forms with nonnegative coefficients, we prove an SOS rank upper bound of $7$, improving the general bound of $8$ for $3 \\times 3$ forms. In addition, we extend the techniques to a broader class of \\textbf{sparse biquadratic forms}, obtaining combinatorial upper bounds and constructing explicit families whose SOS rank grows linearly with the number of terms. These results provide new lower and upper bounds on the worst-case SOS rank of biquadratic forms and highlight the role of structure in reducing the required number of squares.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19075v1",
    "categories": [
      "math.FA",
      "math.AP"
    ],
    "authors": [
      "Nikolaos Roidos"
    ],
    "title": "Strip-type operators and abstract Cauchy problems",
    "abstract": "We consider the non-homogeneous abstract linear Schrödinger and wave equations with zero initial conditions, defined by operators of strip-type and parabola-type in Banach spaces, respectively, and establish the well-posedness of classical solutions in appropriate vector-valued Sobolev-Slobodetskii spaces. We obtain analogous results for two extensions of these equations by replacing the previously mentioned boundedness properties of the associated operators with $R$-boundedness. As an application, we consider an abstract semilinear wave equation and establish the existence and uniqueness of classical solutions to this problem for short times.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19068v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Chaoliang Tang",
      "Hehui Wu",
      "Junchi Zhang"
    ],
    "title": "The linear Turán number of the 3-graph $P_5$",
    "abstract": "We prove that for any linear 3-graph on $n$ vertices without a path of length 5, the number of edges is at most $\\frac{15}{11}n$, and the equality holds if and only if the graph is the disjoint union of $G_0$, a graph with 11 vertices and 15 edges. Thus, $ex_L(n,P_5)\\leq \\frac{15}{11}n$, and the equality holds if and only if $11|n$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19045v1",
    "categories": [
      "math.LO",
      "math.CO"
    ],
    "authors": [
      "Felix Weilacher"
    ],
    "title": "Borel Homomorphisms from Forests to Kneser Graphs",
    "abstract": "We answer a recent question of Csóka and Vidnyánszky [arXiv:2407.10006] and give an alternate proof of one of their results. The subject of both is which finite graphs admit factor of i.i.d. homomorphisms from the 3-regular tree. We then give yet another proof of the result in the Borel setting which leads to the following: For each $d > 2$ and $k \\in \\mathbb{N}$, there is a Borel hyperfinite $d$-regular forest $G$ and a finite graph with chromatic number $k$, $H$, so that $G$ does not admit a Borel homomorphism to $H$. All of this is tied together by a focus on the case when the target graph $H$ is a (subgraph of a) Kneser graph.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19039v1",
    "categories": [
      "math.LO",
      "math.CO",
      "math.MG"
    ],
    "authors": [
      "Spencer Unger",
      "Narmada Varadarajan",
      "Felix Weilacher"
    ],
    "title": "$G_δ$ Circle Squaring",
    "abstract": "We show that a circle and square of the same area in $\\mathbb{R}^2$ are equidecomposable by translations using $\\mathbfΔ^0_2$ pieces. That is, pieces which are simultaneously $F_σ$ and $G_δ$ sets. This improves a result of Máthé-Noel-Pikhurko and is the best possible complexity in terms of the Borel hierarchy. More generally we show that bounded sets $A,B \\subseteq \\mathbb{R}^n$ with small enough boundaries and the same nonzero Lebesgue measure are equidecomposable with pieces that are countable unions of finite Boolean combinations of translates of $A,B$, and open sets. The improvement comes from constructions of low complexity toasts and related objects which should be independently useful within Borel combinatorics.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19032v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Carlos Garzón",
      "José Madrid"
    ],
    "title": "On the frequency function of Hardy-Littlewood maximal functions",
    "abstract": "We study the frequency function (introduced by Temur) in both the discrete and continuous settings. More precisely, we extend the definition of the frequency function to the higher-dimensional continuous setting and to the uncentered Hardy-Littlewood maximal function. We analyze the asymptotic behavior of the frequency function and the density of its small values for functions in $\\ell^1(\\mathbb{Z)}$ and $L^1(\\mathbb{R}^d)$ answering some questions posed by Temur. Finally, we study the size of the frequency function for functions in $\\ell^p(\\mathbb{Z})$ with $p>1$, showing that this case differs significantly from the case $p=1$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.18964v1",
    "categories": [
      "math.CO",
      "quant-ph"
    ],
    "authors": [
      "Karen Meagher",
      "Hermie Monterde"
    ],
    "title": "Sedentary quantum walks on bipartite graphs",
    "abstract": "If a quantum walk starting on a vertex tends to stay at home, then that vertex is said to be sedentary. We prove that almost all planar graphs and almost all trees contain at least two sedentary vertices for any assignment of edge weights -- a result that suggests vertex sedentariness is a common phenomenon in trees and planar graphs. For weighted bipartite graphs, we show that a vertex is not sedentary whenever 0 does not belong to its eigenvalue support. Consequently, each vertex in a nonsingular weighted bipartite graph is not sedentary, a stark contrast to weighted trees and weighted planar graphs. A corollary of this result is that every vertex in a bipartite graph with a unique perfect matching is not sedentary for any assignment of edge weights. We also construct new families of weighted bipartite graphs with sedentary vertices using the bipartite double and subdivision operations. Finally, we show that unweighted paths and unweighted even cycles contain no sedentary vertices.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19803v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Nikola Adžaga",
      "Alan Filipin",
      "Ana Jurasić"
    ],
    "title": "The extensibility of the Diophantine triple $\\{2, b, c\\}$",
    "abstract": "The aim of this paper is to consider the extensibility of the Diophantine triple $\\{2,b,c\\}$, where $2<b<c$, and to prove that such a set cannot be extended to an irregular Diophantine quadruple. We succeed in that for some families of $c$'s (depending on $b$). As corollary, for example, we prove that for $b/2-1$ prime, all Diophantine quadruples $\\{2,b,c,d\\}$ with $2<b<c<d$ are regular.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19797v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "J. C. Bellido",
      "G. García-Sáez"
    ],
    "title": "A general theory of nonlocal elasticity based on nonlocal gradients and connections with Eringen's model",
    "abstract": "We develop a general theory of nonlocal linear elasticity based on nonlocal gradients with general radial kernels. Starting from a nonlocal hyperelastic energy functional, we perform a formal linearization around the identity deformation to obtain a system of nonlocal linear elasticity equations. We establish the existence and uniqueness of weak solutions for both Dirichlet and Neumann boundary conditions, proving a general Korn-type inequality for nonlocal gradients. We show that this framework encompasses Eringen's nonlocal elasticity model as a particular case, establishing an explicit connection between the two formulations. Finally, we prove localization results demonstrating that solutions to the nonlocal problems converge to their classical local counterparts in two different regimes: as the interaction horizon vanishes and, in the fractional case, as the fractional parameter approaches one. These results provide a comprehensive and unified mathematical foundation for nonlocal elasticity theories.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19759v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "A. R. M.",
      "Wolfert"
    ],
    "title": "Unique Preference Aggregation in Design and Decision Making",
    "abstract": "Preference aggregation is a core operation in multi-objective design optimisation and group decision-making, as it determines the best-fit-for-common-purpose alternative within complex socio-technical contexts. Therefore, their aggregation requires a rigorous measurement-theoretic foundation to ensure mathematical validity, interpretability, and uniqueness. PFM establishes the principal axioms of unique preference aggregation, providing a rigorous basis on which aggregation can be demonstrated.\n  In this paper, it is shown that commonly used aggregation approaches in MCDM - such as weighted arithmetic and geometric means, as well as weighted distance-based optimisation methods - often fail to produce consistent rankings and are therefore unsuitable for pure MCDM. In contrast, the unique preference aggregation presented here clarifies the mathematical limits of valid aggregation and provides a principled, implementable foundation for robust multi-criteria decision analysis (MCDA) and multi-objective design optimisation (MODO) in multi-faceted problems.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19757v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Robin de Jong",
      "Nicole Looper",
      "Farbod Shokrieh"
    ],
    "title": "Integral torsion points on abelian varieties over function fields",
    "abstract": "We prove an analogue, over global function fields, of a conjecture due to Su-Ion Ih concerning the non-Zariski density of torsion points on abelian varieties that are integral with respect to a given non-special divisor. Along the way, we establish a Tate--Voloch type theorem for abelian varieties over completions of global function fields, which allows us to obtain a logarithmic equidistribution result for Galois orbits of torsion points.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19736v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Nayandeep Deka Baruah",
      "Pankaj Jyoti Mahanta"
    ],
    "title": "Combinatorial proofs of some identities on overpartitions with repeated smallest non-overlined part",
    "abstract": "Let $\\overline{\\mathrm{spt}}k(n)$ denote the number of overpartitions of $n$ where the smallest non-overlined part, say $s(π)$, appears $k$ times and every overlined part is bigger than $s(π)$. Let $\\overline{\\mathrm{spt}}k_o(n)$ denote the number of overpartitions of $n$ where the smallest non-overlined part appears $k$ times, every overlined part is bigger than $s(π)$ and all parts other than $s(π)$ are incongruent modulo $2$ with $s(π)$. Also, let $b_e(k,n)$ (resp., $b_o(k,n)$) denote the number of overpartitions of $n$ counted by $\\overline{\\mathrm{spt}}k_o(n)$ where the number of parts greater than $s(π)$ is even (resp., odd), and let $$\\overline{\\mathrm{spt}}k_o'(n)=b_e(k,n)-b_o(k,n).$$ Recently, Malik and Sharma (arXiv:2601.15601v1) expressed the generating functions of these partition functions in terms of linear combinations of $q$-series with polynomials in $q$ as coefficients. As corollaries, they derived some partition identities involving the functions for $k=1$ and sought for combinatorial proofs of their results. In this paper, we present some desired proofs.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19429v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Takumi Noda"
    ],
    "title": "On Dirichlet Series Involving $ζ(s)$ and Extensions of the Euler-Mascheroni Constant",
    "abstract": "In this paper, we introduce a class of Dirichlet series defined in terms of the Riemann zeta-function, motivated by the study of their special values, and establish integral representations for these series. We also define an extension of the Euler--Mascheroni constant and express certain special values explicitly in terms of the Bendersky constants. These results provide a unified framework for evaluating Dirichlet series involving the Riemann zeta-function at integer arguments, together with the associated number-theoretic constants.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19701v1",
    "categories": [
      "math.SP"
    ],
    "authors": [
      "Santiago Verdasco"
    ],
    "title": "High-energy eigenfunctions of point perturbations of the Laplacian on the spheres $\\mathbb{S}^{2}$ and $\\mathbb{S}^{3}$",
    "abstract": "We study the set of Quantum Limits, and more generally, of semiclassical measures of sequences of eigenfunctions of perturbations of the Laplacian on the spheres $\\mathbb{S}^{2}$ and $\\mathbb{S}^{3}$ by point-scatterers. In the unperturbed case, it is known that the set of semiclassical measures coincides with the set of measures that are invariant under the geodesic flow; on the other hand, when the Laplacian is perturbed by a generic smooth potential, the set of semiclassical measures turns out to be strictly contained within that of invariant measures. In this article, we prove that the addition of a perturbation by a finite set of point-scatterers has a different effect: (i) all invariant measures are semiclassical measures for some sequence of eigenstates of the perturbed operator, and (ii) as soon as the set of scatterers contains a pair of antipodal points, it is possible to construct a sequence of eigenfunctions whose semiclassical measure is not invariant under the geodesic flow. We also show that this geometric condition is sharp: if the set of scatterers does not contain a pair of antipodal points, then the sets of invariant and semiclassical measures coincide.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19698v1",
    "categories": [
      "math.RA",
      "math.AG",
      "math.AT"
    ],
    "authors": [
      "Marco Manetti",
      "Gabriele Rossetti"
    ],
    "title": "Some examples of DG-Lie formality transfer",
    "abstract": "We give a convenient reformulation, a slight generalization and some applications of the formality transfer theorem for DG-Lie algebras.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19631v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Tuomas Orponen",
      "Hrit Roy"
    ],
    "title": "Nikodým maximal function with restricted directions",
    "abstract": "We study the planar Nikodým maximal operator $\\mathcal{N}_{Θ;δ}$ associated to a direction set $Θ\\subset \\mathbb{S}^{1}$. We show that the quasi-Assouad dimension $s := \\dim_{\\mathrm{qA}} Θ$ characterises the essential $L^{p}$-boundedness of $\\mathcal{N}_{Θ;δ}$ in the following sense. If $s \\in [\\tfrac{1}{2},1]$, then $\\mathcal{N}_{Θ;δ}$ is essentially bounded on $L^{p}(\\mathbb{R}^{2})$ for $p \\geq 1 + s$, and essentially unbounded for $p < 1 + s$. Here essential boundedness means $L^{p}$-boundedness with constant $O_ε(δ^{-ε})$. We also show that the characterisation described above fails for $s < \\tfrac{1}{2}$. More precisely, there exists a set $Θ\\subset \\mathbb{S}^{1}$ with $\\dim_{\\mathrm{qA}} Θ= \\tfrac{1}{3}$ such that $\\mathcal{N}_{Θ;δ}$ is essentially unbounded on $L^{p}(\\mathbb{R}^{2})$ for all $p < \\tfrac{3}{2}$.\n  As an application, we show there exists a convex domain with affine dimension $\\tfrac{1}{6}$ such that the $α$-order Bochner-Riesz means converge in $L^6$ for all $α>0$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19596v1",
    "categories": [
      "math.FA",
      "math.CV"
    ],
    "authors": [
      "Preeti Kumari",
      "P. Muthukumar",
      "Antti Rasila"
    ],
    "title": "Applications of Reproducing Kernels in composition operators",
    "abstract": "In this paper, we illustrate the effectiveness of reproducing kernel Hilbert space techniques in the study of composition operators. For weighted Hardy spaces on the unit disk, we characterize the composition operators whose adjoint is again a composition operator. Using reproducing kernel methods, we obtain a classification of bounded weighted composition operators acting between reproducing kernel Hilbert spaces. We also show that the reproducing kernel techniques yield simpler proofs of several known results, highlighting the role of reproducing kernels as a unifying structural tool in the analysis of composition operators.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19558v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Weronika Buczyńska",
      "Jarosław Buczyński"
    ],
    "title": "Apolarity for border cactus decompositions",
    "abstract": "The border apolarity technique was introduced in our earlier work for secant varieties over complex numbers. We extend the theory to cactus varieties of toric varieties over any algebraically closed field. A border cactus decomposition is a mulithomogeneous ideal in the Cox ring (also called the total coordinate ring) of the toric variety that witnesses that a given point is in a specific cactus variety. The definition of such witness uses apolarity and we describe the set of ideals that are credible witnesses for this purpose in terms of a correspondence between the usual Hilbert scheme (parametrising all closed subschemes of the toric variety) and the multigraded Hilbert scheme (parametrising all multihomogeneous ideals in the Cox ring). We also take this opportunity to extend the border apolarity to linear subspaces (in non-border setting, this is equivalent to simultaneous decompositions).",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19537v1",
    "categories": [
      "math.RT",
      "math.CO"
    ],
    "authors": [
      "Samuel Creedon",
      "Volodymyr Mazorchuk"
    ],
    "title": "Kostant's problem for permutations of shape $(n-2,1,1)$ and $(n-3,2,1)$",
    "abstract": "For a permutation $z$ in the symmetric group $\\mathrm{S}_{n}$, denote by $L_{z}$ the corresponding simple highest weight module in the principal block of the BGG category $\\mathcal{O}$ for the Lie algebra $\\mathfrak{sl}_{n}(\\mathbb{C})$. In this paper, we provide a combinatorial answer to Kostant's problem for the modules $L_{z}$ when $z$ has shape (associated Young diagram/integer partition via Robinson-Schensted correspondence) equal to $(n-2,1,1)$ or $(n-3,2,1)$. Moreover, we verify that certain closely related conjectures hold for such permutations, including the Indecomposability Conjecture, which states that applying any indecomposable projective functor to the corresponding simple highest weight module outputs either an indecomposable module or zero.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19478v1",
    "categories": [
      "math.AP",
      "math.NA"
    ],
    "authors": [
      "M. M. Chipot",
      "A. Luthra",
      "S. A. Sauter"
    ],
    "title": "On some nonlocal, nonlinear diffusion problems",
    "abstract": "This note is devoted to some nonlocal, nonlinear elliptic problems with an emphasis on the computation of the solution of such problems, reducing it in particular to a fixed point argument in R. Errors estimates and numerical experiments are provided.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19471v1",
    "categories": [
      "math.RT",
      "math.DS",
      "math.PR"
    ],
    "authors": [
      "Abdelhamid Amroun"
    ],
    "title": "On the distribution of the periods of convex representations II",
    "abstract": "Let $ρ: Γ\\longrightarrow G$ be a Zariski dense irreducible convex representation of the hyperbolic group $Γ$, where G is a connected real semisimple algebraic Lie group. We establish a central limit type theorem for the periods of the representation $ρ$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19733v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Nicholas Biglin",
      "Joseph Crachiola",
      "Jack Curtis",
      "Thomas Kunz",
      "Omkar Maralappanavar",
      "Adrian Tudorascu"
    ],
    "title": "On the asymptotic behavior of the Repulsive Pressureless Euler-Poisson System",
    "abstract": "The main objective of this paper is a study of the asymptotic behavior of distributional solutions to the one-dimensional repulsive pressureless Euler-Poisson system. The system is a model for the dynamics of a mass distribution evolving on \\mathbb{R} whose masses exert outward forces on one another. A discrete (describing the evolution of finitely many particles) solution is called sticky if, upon collision, particles stick together and move as one for all subsequent time, according to the conservation of mass and momentum principles. We prove results on the total energy (Hamiltonian) of the system and demonstrate the existence and uniqueness of so-called \"perfect\" states, where the Hamiltonian is constant over all time and the solution converges to equilibrium, a single stationary particle. We provide a necessary and a sufficient condition for finite-time collapse, and present a quadratic envelope within which a solution must remain in order to collapse. We demonstrate various (counter)examples that illustrate the unique behavior of the repulsive scheme with the sticky condition, analytically and with a computer simulation.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19442v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Didier Bresch",
      "Christophe Lacave",
      "Maja Szlenk"
    ],
    "title": "Dissipative Solutions to a Compressible Non-Newtonian Korteweg System with Density-Dependent Viscous Stress Tensor",
    "abstract": "The main objective of this paper is to prove that if capillarity effect is taken into account then there exist dissipative solutions to a system describing viscoplastic compressible flows with density dependent viscosities in a periodic domain $\\T^d$ with $d=2,3$. We calculate the relative entropy inequality and in consequence show existence of dissipative solutions and the weak-strong uniqueness for this system. Our result extends the recent result concerning the link between Euler--Korteweg and Navier--Stokes--Korteweg systems for Newtonian flows (when the viscosity depends on the density) [See D.~Bresch, M. Gisclon, I. Lacroix-Violet, {\\it Arch. Rational Mech. Anal.} (2019)] to non-Newtonian flows.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19689v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Shuai Hou",
      "Zohreh Ravanpak",
      "Yunhe Sheng"
    ],
    "title": "Equivariant Nijenhuis Lie Algebras: Extensions to Classical Lie-Theoretic Structures",
    "abstract": "We develop a structural theory of equivariant Nijenhuis Lie algebras (ENL algebras), namely, Lie algebras equipped with Nijenhuis operators satisfying an equivariance condition with respect to the adjoint representation. This rigidity allows classical Lie bialgebra constructions to extend systematically to the operator-equipped setting. Within this framework, we define ENL bialgebras and establish the associated notions of matched pairs, Manin triples, and Drinfel'd doubles. We show that coboundary ENL bialgebras are characterized by EN $r$-matrices satisfying an equivariant classical Yang-Baxter equation. We further introduce EN-relative Rota-Baxter operators and prove that they provide an operator-theoretic realization of such $r$-matrices, leading to descendent ENL algebras and to solutions of the classical Yang--Baxter equation on semidirect ENL algebras. In the quadratic case, this construction reduces to Rota-Baxter operators of weight zero. Finally, we extend the EN framework to pre-Lie algebras and show that pre-ENL algebras naturally induce associated ENL structures.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19658v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Mark Giroux"
    ],
    "title": "A Lower Bound for Kruskal's Weak Tree Function tree(3)",
    "abstract": "We establish an explicit lower bound for Kruskal's weak tree function at n=3, proving that tree(3) >= 844,424,930,131,960 = 3 * 2^48 - 8. This is achieved by constructing an explicit sequence of unlabeled rooted trees satisfying the constraints of the weak tree function and carefully analyzing the combinatorics of the \"leg elimination\" process. Our bound significantly exceeds previous estimates and demonstrates that even for small arguments, the weak tree function exhibits rapid growth.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19655v1",
    "categories": [
      "math.AG",
      "math.NT"
    ],
    "authors": [
      "Yuntong Cui",
      "Guo Li",
      "Shuhan Jiang",
      "Jiahong Yu"
    ],
    "title": "Almost Vector Bundles over Perfectoid Spaces",
    "abstract": "In this paper, we define vector bundles within the framework of almost mathematics (referred to as almost vector bundles) and establish the $v$-descent theorem together with a structure theorem for these bundles over perfectoid spaces. The proof yields several interesting intermediate results.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19649v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Fadoua Balabdaoui",
      "Jinyu Chen"
    ],
    "title": "Semi-supervised learning in unmatched linear regression using an empirical likelihood approach",
    "abstract": "Knowing the link between observed predictive variables and outcomes is crucial for making inference in any regression model. When this link is missing, partially or completely, classical estimation methods fail in recovering the true regression function. Deconvolution approaches have been proposed and studied in detail in the unmatched setting where the predictive variables and responses are allowed to be independent. In this work, we consider linear regression in a semi-supervised learning setting where, beside a small sample of matched data, we have access to a relatively large unmatched sample. Using maximum likelihood estimation, we show that under some mild assumptions the semi-supervised learning empirical maximum likelihood estimator (SSLEMLE) is asymptotically normal and give explicitly its asymptotic covariance matrix as a function of the ratio of the matched/unmatched sample sizes and other parameters. Furthermore, we quantify the statistical gain achieved by having the additional large unmatched sample over having only the small matched sample. To illustrate the theory, we present the results of an extensive simulation study and apply our methodology to the \"combined cycle power plant\" data set.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19639v1",
    "categories": [
      "math.PR",
      "math.AP",
      "math.FA"
    ],
    "authors": [
      "Antonio Agresti",
      "Fabian Germ",
      "Mark Veraar"
    ],
    "title": "Sharp bounds for non-trace class noise and applications to SPDEs",
    "abstract": "In the study of stochastic PDEs with colored, non-trace class space-time noise, one frequently encounters Gaussian series of the form $$ \\sum_{n\\geq 1} γ_n μ_n f_n, $$ where $(γ_n)_{n}$ is a sequence of standard independent Gaussian variables, $g$ is an $L^η(\\mathcal{O})$ function, $(μ_n)_{n}$ is a sequence of scalars, and $(f_n)_n$ is an orthonormal system in $L^2(\\mathcal{O})$ where $\\mathcal{O} \\subseteq \\mathbb{R}^d$ is an open set. In this manuscript, we establish necessary and sufficient conditions for the above sum to converge in Bessel potential spaces $H^{-s,q}(\\mathcal{O})$. The latter can be interpreted as a Sobolev embedding for Gaussian series. Our main theorem is formulated using weighted sequence spaces that encode the $L^\\infty$-growth of the orthonormal system $(f_n)_{n}$, a feature that is crucial for obtaining sharp estimates. We apply our results to the stochastic heat equation with additive non-trace class noise. In this case, our conditions capture the scaling relationship between the heat operator and the coloring of the noise.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19589v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Susovan Pal"
    ],
    "title": "Identifiability of the Unnormalized Graph Laplace Operators",
    "abstract": "In this short note, we show that the continuous intrinsic graph Laplace operator with Gaussian kernel on a compact Riemannian manifold without boundary uniquely determines both the Riemannian metric and the sampling density, provided the latter is positive. In contrast, the corresponding continuous extrinsic graph Laplace operator uniquely determines the sampling measure; moreover, when the operator is defined via an embedding into Euclidean space, it also uniquely determines the induced Riemannian metric and the sampling density.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19511v1",
    "categories": [
      "math.PR",
      "math.FA",
      "math.OC",
      "q-fin.MF"
    ],
    "authors": [
      "Johannes Langner",
      "Gregor Svindland"
    ],
    "title": "P-Sensitive Functions and Localizations",
    "abstract": "This paper assumes a robust stochastic model where a set $\\mathcal{P}$ of probability measures replaces the single probability measure of dominated models. We introduce and study $\\mathcal{P}$-sensitive functions defined on robust function spaces of random variables. We show that $\\mathcal{P}$-sensitive functions are precisely those that admit a representation via so-called functional localization. The theory is applied to solving robust optimization problems, to convex risk measures, and to the study of no arbitrage in robust one-period financial models.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19485v1",
    "categories": [
      "math.QA",
      "math.GT",
      "math.RA"
    ],
    "authors": [
      "Liang Chang",
      "Yilong Wang",
      "Saifei Zhai"
    ],
    "title": "On the gauge invariance of the Kuperberg invariant of certain high genus framed 3-manifolds",
    "abstract": "We show that the Kuperberg invariant of the Weeks manifold with any framing is a gauge invariant of finite-dimensional Hopf algebras, which provides the first example of gauge invariants of general finite-dimensional Hopf algebras via hyperbolic 3-manifolds. We also show that the Kuperberg invariant of the 3-torus is gauge invariant, which further supports the idea of systematically producing gauge invariants of Hopf algebras via topological methods proposed in \\cite{CNW25}.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19873v1",
    "categories": [
      "math.FA",
      "math.GN"
    ],
    "authors": [
      "Jerzy Kakol",
      "Manuel Lopez-Pellicer",
      "Wieslaw Sliwa"
    ],
    "title": "On weak*-basic sequences in duals and biduals of spaces C(X) and Quojections",
    "abstract": "We show that for infinite Tychonoff spaces X and Y the weak*-dual of Ck(X x Y) contains a basic sequence; moreover, the weak*-bidual of Ck(X) contains such a sequence as well. When X and Y are infinite compact spaces, we single out a concrete sequence (μn) of finitely supported signed measures on X x Y with quantitative small-rectangle estimates, and we prove that every subsequence of (μn) admits a further subsequence which is strongly normal and forms a weak*-basic sequence in the dual C(X x Y)* of the Banach space C(X x Y). We also study the weak*-basic sequence problem for Frechet locally convex spaces in the class of quojections, and prove that for every quojection E the bidual E** admits a weak*-basic sequence, while a long-standing open problem asks whether the dual of every infinite-dimensional Banach space admits a basic sequence in the weak*-topology. Several examples and open questions are included, in particular for spaces C(X) and for inductive limits of Frechet spaces.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19864v1",
    "categories": [
      "math.AP",
      "math.DG",
      "math.MG"
    ],
    "authors": [
      "Thomas Bieske",
      "Frederic Bowen"
    ],
    "title": "Viscosity Solutions in Martinet Spaces",
    "abstract": "In this paper, we establish the properties of viscosity solutions in Martinet spaces, which lack both the algebraic group law of Carnot groups and the triangular vector fields of Grushin-type spaces. We then prove the uniqueness of viscosity solutions to strictly monotone elliptic PDEs and to the infinite Laplace equation.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19841v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Armando M. V. Corro",
      "Carlos M. C. Riveros",
      "José L. Teruel"
    ],
    "title": "Surfaces with quadratic support function of harmonic type",
    "abstract": "In this paper, we study oriented surfaces S in $\\mathbb{R}^3$, called Surfaces with quadratic support function of harmonic type (in short HQSF-surfaces), these surfaces generalize the QSF-surfaces. We obtain a Weierstrass type representation for the HQSF-surfaces which depends on three holomorphic functions. Moreover, we classify the HQSF-surfaces of rotation.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19840v1",
    "categories": [
      "math.GT",
      "math.QA"
    ],
    "authors": [
      "Jorge Becerra"
    ],
    "title": "Knot invariants from XC-structures on the Sweedler algebra are trivial",
    "abstract": "An XC-algebra is the minimum algebraic structure needed to define a framed, oriented knot invariant and generalises Lawrence's invariant obtained from ribbon Hopf algebras. In this note, we show that the knot invariant produced by any XC-structure on the Sweedler algebra is completely determined by the framing of the knot. Furthermore, we also exhibit explicit families of XC-structures on the Sweedler algebra that do not have a ribbon Hopf-algebraic origin.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19838v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Mechthild Thalhammer",
      "Gregor Thalhammer-Thurner"
    ],
    "title": "Modified splitting methods for Gross-Pitaevskii systems modelling Bose-Einstein condensates: Time evolution and ground state computation",
    "abstract": "The year 2025 marks the 100 and 30 years anniversaries of the discovery of Bose--Einstein condensation and its successful experimental realisation. Inspired by these important research achievements, a conceptually simple approach is proposed to facilitate reliable and efficient numerical simulations. The structure of the underlying systems of coupled Gross--Pitaevskii equations suggests the use of optimised high-order operator splitting methods for dynamical evolution and ground state computation. A second-order barrier, however, prevents the applicability of standard operator splitting methods for both, time evolution as well as imaginary time propagation. An innovative alternative approach accomplishes the design of novel modified operator splitting methods that remain stable under moderate smallness assumptions on the time increments. The core idea is to incorporate commutators of the defining differential and nonlinear multiplication operators, since this permits to fulfill the basic stability requirement of positive method coefficients. Further improvements with respect to convergence at the targeted precision arise from automatic adjustments of the time stepsizes by an inexpensive local error control. The presented numerical experiments confirm the favourable performance of a specific fourth-order modified operator splitting method. Amongst others, it is demonstrated that the excellent mass and energy conservation in long-term evolutions, intrinsic attributes of geometric numerical integrators for Hamiltonian systems, is maintained for a sensible variation of the time stepsizes. Moreover, the benefits of adaptive higher-order approximations in ground state computations are illustrated.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19801v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "J. Silverio Martínez-Baena"
    ],
    "title": "A priori estimates of stable and finite Morse index solutions to elliptic equations that arise in Physics",
    "abstract": "This thesis studies qualitative properties of solutions to nonlinear elliptic equations of Poisson type with Dirichlet boundary conditions that arise from some physical phenomena, with a particular focus on regularity, stability, and multiplicity of solutions. Building on the modern framework of solution stability and Morse index theory, the work investigates how these notions influence regularity in nonlinear elliptic problems. A central contribution is the construction of a counterexample showing that bounded radial Morse index does not prevent singular behavior of solutions in dimensions three through nine, challenging a natural extension of the Brezis-Vázquez regularity conjecture. In addition, optimal regularity results are established for radial solutions of a non-autonomous Hardy-Hénon equation, identifying the precise range of dimensions for which regularity holds. The thesis also addresses existence and multiplicity results for elliptic equations involving nonlinearities with spatially vanishing coefficients. Under suitable assumptions, the existence of multiple distinct solutions is proved using variational and topological methods. Finally, the thesis outlines several directions for future research, including extensions of stability-based regularity techniques to non-autonomous problems and potential applications of these techniques to field theories arising in theoretical physics.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19783v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Wenxiong Chen",
      "Yahong Guo",
      "Congming Li"
    ],
    "title": "Methods in studying qualitative properties of fractional equations",
    "abstract": "In this paper, we systematically review a series of effective methods for studying the qualitative properties of solutions to fractional equations. Beginning with the pioneering extension method and the method of moving planes in integral forms, we introduce a variety of direct methods, including the direct method of moving planes, the method of moving spheres, blow-up and rescaling techniques, the sliding method, regularity lifting, and approaches for interior and boundary regularity estimates.\n  To elucidate the core ideas behind these methods, we employ simple examples that demonstrate how they can be applied to investigate qualitative properties of solutions. We also provide a comparative discussion of their respective strengths and limitations. It is our hope that this paper will serve as a useful handbook for researchers engaged in the study of fractional equations.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19775v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Beth Morrison",
      "Sean English",
      "Johnathan Koch"
    ],
    "title": "Cost-Benefit Analysis for PMU Placement in Power Grids",
    "abstract": "Power domination is a graph-theoretic model for the observance of a power grid using phasor measurement units (PMUs). There are many costs associated with the installation of a PMU, but also costs associated with not observing the entire power grid. In this work, we propose and study a power domination cost function, which balances these two costs. Given a graph $G$, a set of sensor locations $S$, and a parameter $β$ (which is the ratio of the cost of a PMU to the cost of non-observance of any given vertex), we define the cost function\n  \\[ \\mathrm{C}(G;S,β)=|S|+β\\cdot (|V(G)|-|\\mathrm{Obs}(G;S)|) \\] where $|\\mathrm{Obs}(G;S)|$ is the number of vertices observed by sensors placed at $S\\subseteq V(G)$ in the power domination process. We explore the values of $k$ for which there is a set $S$ of size $k$ that minimizes this cost function, and explore which values of $β$ guarantee that it is optimal to observe the entire power grid to minimize cost. We also introduce notions of marginal cost and marginal observance, providing tools to analyze how many PMUs one should install on a given power grid.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19754v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Élie Casbi"
    ],
    "title": "Triangulated monoidal categorifications of finite type cluster algebras",
    "abstract": "We propose a framework of monoidal categorification of finite type cluster algebras involving triangulated monoidal categories. Namely, given a Dynkin quiver $Q$, we consider the bounded homotopy category $\\mathcal{K}_Q^{(1)}$ of a symmetric monoidal category $\\mathcal{H}_Q^{(1)}$ that we define in terms of the Auslander-Reiten theory of $Q$. Using some iterated mapping cone procedure, we construct a distinguished family $\\{ C_{\\bullet}[β] \\}_{β\\in Δ_+}$ of chain complexes in $\\mathcal{K}_Q^{(1)}$ characterized (up to isomorphism) by homological conditions similar to those of higher exact sequences appearing in the context of higher homological algebra. We then prove that the distinguished triangle in $\\mathcal{K}_Q^{(1)}$ given by each mapping cone categorifies an exchange relation in the finite type cluster algebra $\\mathcal{A}_Q$ with initial exchange quiver $Q$ (for a suitable choice of frozen variables). As a consequence, we obtain that for each positive root $β$, the Euler characteristic of $C_{\\bullet}[β]$ coincides with the truncated $q$-character of the simple module $L[β]$ in the HL category $\\mathcal{C}_ξ^{(1)}$ categorifying the cluster variable $x[β]$ of $\\mathcal{A}_Q$ via Hernandez-Leclerc's monoidal categorification. Along the way, we establish a uniform formula for the dominant monomial of $L[β]$ in all types $A_n$ and $D_n$ for arbitrary orientations (agreeing with Brito-Chari's results in type $A_n$).",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19748v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Oliver Bachtler",
      "Sven O. Krumke",
      "Helena Weiß"
    ],
    "title": "A dual view of Roman Domination: The two neighbour packing problem",
    "abstract": "We introduce the two neighbour packing problem: For a graph \\(G=(V,E)\\) one seeks to find a maximum cardinality subset \\(A \\subseteq V\\), such that, for all \\(v\\in V\\), the closed neighbourhood of~\\(v\\) contains at most two vertices in~\\(A\\). This packing problem occurs naturally as the (integer) dual of the LP-relaxation of the Roman domination problem. As such, these two problems are weakly dual.\n  We show that the two neighbour packing problem is NP-hard in general, but can be solved in linear time on graphs of bounded tree-width, so on trees, in particular. We show that for trees, the two problems are strongly dual, letting us solve the Roman domination problem by computing an optimal solution to the two neighbour packing problem.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19705v1",
    "categories": [
      "math.SP"
    ],
    "authors": [
      "Santiago Verdasco"
    ],
    "title": "High-energy eigenfunctions of point perturbations of the Laplacian",
    "abstract": "In this paper, we explore the high-frequency properties of eigenfunctions of point perturbations of the Laplacian on a compact Riemannian manifold. More specifically, we are interested in understanding to what extent the high-frequency behavior of eigenfunctions depends on the global dynamics of the geodesic flow in the manifold, as is the case when smooth perturbations are present. Our main result proves that as soon as the Laplacian is perturbed by a finite family of Dirac masses placed at points whose set of looping directions has zero measure, semiclassical measures corresponding to high-frequency sequences of eigenfunctions are supported on the unit cosphere bundle and invariant under the geodesic flow. The main difficulty in establishing this result relies on the fact that point perturbations are unbounded operators that cannot be written as pseudodifferential operators, and therefore, the corresponding perturbed Laplacian does not have an unambiguously defined classical flow.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19704v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Hao Feng",
      "Ming Zeng",
      "Xingwang Li",
      "Wenwu Xie",
      "Nian Xia",
      "Octavia A. Dobre"
    ],
    "title": "Joint Power Allocation and Antenna Placement for Pinching-Antenna Systems under User Location Uncertainty",
    "abstract": "Pinching antenna systems have attracted much attention recently owing to its capability to maintain reliable line-of-sight (LoS) communication in high-frequency bands. By guiding signals through a waveguide and emitting them via a movable pinching antenna, these systems enable dynamic control of signal propagation and spatial adaptability. However, their performance heavily depends on effective resource allocation-encompassing power, bandwidth, and antenna positioning-which becomes challenging under imperfect channel state information (CSI) and user localization uncertainty. Existing studies largely assume perfect CSI or ideal user positioning, while our prior work considered uniform localization errors, an oversimplified assumption. In this paper, we develop a robust resource allocation framework for multiuser downlink pinching antenna systems under Gaussian-distributed localization uncertainty, which more accurately models real-world positioning errors. An energy efficiency (EE) maximization problem is formulated subject to probabilistic outage constraints, and an analytical power allocation strategy is derived under given antenna positions. On this basis, the heuristic particle swarm optimization (PSO) algorithm is employed to identify the antenna position that achieves the global EE configuration. Simulation results illustrate that the proposed scheme greatly enhances both EE and system reliability compared with fixed-antenna benchmark, validating its effectiveness for practical high-frequency wireless deployments.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19633v1",
    "categories": [
      "math.PR",
      "math.NA"
    ],
    "authors": [
      "Alice Cortinovis",
      "Sophie Hautphenne",
      "Stefano Massei"
    ],
    "title": "Computing the density of the Kesten-Stigum limit in supercritical Galton-Watson processes",
    "abstract": "This paper proposes a novel numerical method for computing the density of the limit random variable associated with a supercritical Galton-Watson process. This random variable captures the effect of early demographic fluctuations and determines the random amplitude of long-term exponential population growth. While the existence of a non-trivial limit is ensured by the Kesten-Stigum theorem, computing its density in a stable and efficient manner for arbitrary offspring laws remains a significant challenge. The proposed approach leverages a functional equation that characterizes the Laplace-Stieltjes transform of the limit distribution and combines it with a moment-matching method to obtain accurate approximations within a class of linear combinations of Laguerre polynomials with exponential damping. The effectiveness of the approach is validated on several examples in which the offspring generating function is a polynomial of bounded degree.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19614v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Antoine Jego"
    ],
    "title": "Derivatives of Gaussian multiplicative chaos",
    "abstract": "Consider a logarithmically-correlated Gaussian field $X$ in $d$ dimensions. For all $γ\\in (-\\sqrt{2d},\\sqrt{2d})$, we show that the derivatives $\\frac{\\partial^k}{\\partialγ^k} :e^{γX_ε}:$ of the regularised Gaussian multiplicative chaos $:e^{γX_ε}:$ converge as $ε\\to 0$. By deriving optimal bounds on their growth as $k\\to\\infty$, we control the power expansion of $:e^{γX_ε}:$ about each $γ\\in(-\\sqrt{2d},\\sqrt{2d})$. This yields an alternative approach to complex Gaussian multiplicative chaos in the whole subcritical regime, based entirely on real-valued quantities.\n  One of our key technical contributions is to provide a truncated second moment approach to the uniform integrability of the derivatives of multiplicative chaos and its associated complex variant.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19599v1",
    "categories": [
      "math.FA",
      "math.CV"
    ],
    "authors": [
      "Nikolaos Chalmoukis",
      "Giovanni Marano"
    ],
    "title": "Generalized Foguel-Hankel Operators",
    "abstract": "In this paper we introduce a more general class of Foguel-Hankel operators, where the unilateral shift on $\\ell^2(\\mathbb{N}) $ is replaced by a general multiplication operator on the Hardy space $H^2$ . We prove that Peller's condition is sufficient for the operator to be power bounded, but in general it is not necessary. When the Hankel matrix is the Hilbert matrix, we prove that being similar to a contraction is equivalent to the (a priori) weaker Kreiss condition.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19572v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Basil Paul",
      "Pradeep Boggarapu"
    ],
    "title": "Characterization of eigenfunctions of Laplacian having exponential growth using Fourier multipliers",
    "abstract": "In 1993, Robert Strichartz established a characterization for bounded eigenfunctions of the Laplacian on $\\mathbb{R}^d$. Let $\\left\\{f_k \\right\\}_{k\\in \\mathbb{Z}}$ be a doubly infinite sequence of functions on $\\mathbb{R}^d$ satisfying $Δf_k= f_{k+1}$ for all $k \\in \\mathbb{Z}$. If $\\left\\{f_k \\right\\}$'s are uniformly bounded, then Strichartz proved that $Δf_0= f_0$, thus generalizing a classical result of Roe on the real line. Recognizing that many physically significant eigenfunctions exhibit unbounded behavior, Howard and Reese extended this result to include functions of polynomial growth. Building upon a refined functional-analytic framework, we recently established a broader extension of Strichartz's theorem encompassing eigenfunctions of exponential growth. In the present article, we further investigate the spectral geometry of the Laplacian by replacing the differential operator with a broader class of Fourier multipliers. Specifically, we focus on radial convolution operators, including the spherical average, the ball average, and the heat operator. The central problem addressed is as follows: For a fixed multiplier $Θ$, we consider a doubly infinite sequence of exponentially growing functions $\\{f_k\\}_{k \\in \\mathbb{Z}}$ satisfying the recurrence relation $Θf_k = A f_{k+1}$ for a complex constant $A$. We demonstrate that under specific spectral conditions, the functions $f_k$ correspond precisely to the eigenfunctions of the Laplacian $Δ$ on $\\mathbb{R}^d$. This result provides a unified approach to characterization theorems, linking the growth rate of eigenfunctions to the symbol of the associated multiplier.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19555v1",
    "categories": [
      "math.FA",
      "math.CA"
    ],
    "authors": [
      "Chuhan Sun"
    ],
    "title": "Strong maximal function revisit on Heisenberg group",
    "abstract": "We prove the $L^p$-boundedness of the strong maximal operator defined on a Heisenberg group w.r.t an absolutely continuous measure satisfying the product $A_\\infty$-property.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19547v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Hiroshi Fukuda",
      "Hiroshi Ozaki"
    ],
    "title": "Fold of a bifurcation solution from the figure-eight choreography in the three body problem",
    "abstract": "In the figure-eight choreography in the classical three-body problem, both side bifurcation solutions sometimes fold at one side of the bifurcation point with cusp of action. Three numerical examples of such fold for figure-eight choreography under the Lennard-Jones-type potential and one under the homogeneous potential are introduced. Up to the forth order of representation variable of the Lyapunov-Schmidt reduced action in two dimension with three-fold symmetry, the fold is analyzed.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19542v1",
    "categories": [
      "math.NA",
      "physics.comp-ph"
    ],
    "authors": [
      "Yao Luo"
    ],
    "title": "Unified Regularization of 2D Singular Integrals for Axisymmetric Galerkin BEM in Eddy-Current Evaluation",
    "abstract": "This paper presents an axisymmetric Galerkin boundary element method (BEM) for modeling eddy-current interactions between excitation coils and conductive objects. The formulation derives boundary integral equations from the Stratton-Chu representation for the azimuthal component of the vector potential in both air and conductive regions. The central contribution is a unified regularization framework for the two-dimensional (2D) singular integrals arising in Galerkin BEM. This framework handles both logarithmic and Cauchy singularities through a common set of integral transformations, eliminating the need for case-by-case analytical singularity extraction and enabling straightforward numerical quadrature. The regularization and quadrature stability are proved and verified numerically. The method is validated on several representative axisymmetric geometries, including cylindrical, conical, and spherical shells. Numerical experiments demonstrate consistently high accuracy and computational efficiency across broad frequency ranges and coil lift-off distances. The results confirm that the proposed axisymmetric Galerkin BEM, combined with the integral transformation technique, provides a robust and efficient framework for axisymmetric eddy-current nondestructive evaluation.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19443v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Patricia Medina Capilla",
      "Luca Sabatini"
    ],
    "title": "On the maximal subgroups of almost simple and primitive perfect groups",
    "abstract": "We prove that, if $G$ is a finite almost simple group and $H$ is a maximal subgroup of $G$, then the $10$th term of the derived series of $H$ is perfect. The same is true if $G$ is perfect and $H$ is core-free. The constant $10$ is best possible.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19441v1",
    "categories": [
      "math.NT",
      "math.CO"
    ],
    "authors": [
      "Kathrin Bringmann",
      "Badri Vishal Pandey",
      "Jan-Willem van Ittersum"
    ],
    "title": "False and partial Eisenstein series related to unimodal sequences",
    "abstract": "Motivated by the fact that the classical Jacobi theta function $\\vartheta$ is the exponential generating function of the Eisenstein series, we study the exponential Taylor coefficients (in the elliptic variable) of a related natural partial theta function, as well as a false theta function related to the Dedekind eta function. We prove that the space spanned by these objects is closed under differentiation, analogous to the space of quasimodular forms, and that it contains the quasimodular forms themselves. We further provide their Fourier expansions, establish quasimodular completions, and derive a recursive formula for the Taylor coefficients of the logarithm of the unimodal rank generating function, expressed as partition traces of the false and partial objects.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19860v1",
    "categories": [
      "math.RA",
      "math.NT"
    ],
    "authors": [
      "Ben Forrás"
    ],
    "title": "On the Wedderburn decomposition of the total ring of quotients of certain Iwasawa algebras II",
    "abstract": "Let $\\mathcal G\\simeq H\\rtimesΓ$ be the semidirect product of a finite group $H$ and $Γ\\simeq\\mathbb Z_p$. Let $ F/\\mathbb Q_p$ be a finite extension with ring of integers $\\mathcal O_F$. Then the total ring of quotients $\\mathcal Q^F(\\mathcal G)$ of the completed group ring $\\mathcal O_F[[\\mathcal G]]$ is semisimple artinian. We determine its Wedderburn decomposition in full generality in terms of the Wedderburn decomposition of the group ring $ F[H]$. Such a description was previously available only for those simple components for which a certain associated field extension is totally ramified.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19845v1",
    "categories": [
      "math.CO",
      "math.NT"
    ],
    "authors": [
      "Shane Chern",
      "Chun Wang"
    ],
    "title": "Proof of the Andrews-El Bachraoui positivity conjecture",
    "abstract": "We prove that for $k\\ge 1$, all coefficients in the expansion of the series $$\\sum_{n\\ge 0} \\frac{(q^{2n+2}, q^{2n+2k}; q^2)_\\infty}{(q^{2n+1};q^2)_\\infty^2} q^{2n}$$ are positive, by $q$-hypergeometric means. This confirms a recent conjecture of Andrews and El Bachraoui.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19817v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Bowman Hall"
    ],
    "title": "U-Bit Collapse in Arnault Composites:Probing the Boundary of Strong Lucas Pseudoprimes",
    "abstract": "We present a computational study of 200 composite integers of approximately 350 bits, engineered using the Arnault framework to pass all Miller-Rabin tests up to base 11. Generated at a rate of approximately 20 per hour from a high-throughput construction process producing ~7,700 Carmichael numbers per minute, all samples fail the strong Lucas probable prime test. We introduce the U-bit collapse metric delta = log_2(n) - log_2(U_d mod n) to quantify deviation from the expected uniform distribution of Lucas sequence terms. Analysis reveals minimal collapse values: mean delta = 1.61 bits, median delta = 1.0 bits, maximum delta = 8 bits, with 26% showing no measurable collapse. We analyze correlations with prime residue classes modulo 35, Arnault construction parameters (k,M), and composite bit-sizes. Our results demonstrate that composites engineered for Miller-Rabin resistance exhibit negligible Lucas sequence degeneracy, providing strong empirical evidence for the statistical independence of these two primality test components and supporting the continued robustness of Baillie-PSW-type tests.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19813v1",
    "categories": [
      "math.NA",
      "eess.SY",
      "math.DS",
      "math.OC"
    ],
    "authors": [
      "Michael S. Ackermann",
      "Linus Balicki",
      "Serkan Gugercin",
      "Steffen W. R. Werner"
    ],
    "title": "A refined nonlinear least-squares method for the rational approximation problem",
    "abstract": "The adaptive Antoulas-Anderson (AAA) algorithm for rational approximation is a widely used method for the efficient construction of highly accurate rational approximations to given data. While AAA can often produce rational approximations accurate to any prescribed tolerance, these approximations may have degrees larger than what is actually required to meet the given tolerance. In this work, we consider the adaptive construction of interpolating rational approximations while aiming for the smallest feasible degree to satisfy a given error tolerance. To this end, we introduce refinement approaches to the linear least-squares step of the classical AAA algorithm that aim to minimize the true nonlinear least-squares error with respect to the given data. Furthermore, we theoretically analyze the derived approaches in terms of the corresponding gradients from the resulting minimization problems and use these insights to propose a new greedy framework that ensures monotonic error convergence. Numerical examples from function approximation and model order reduction verify the effectiveness of the proposed algorithm to construct accurate rational approximations of small degrees.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19805v1",
    "categories": [
      "math.CO",
      "math.AG",
      "math.OC"
    ],
    "authors": [
      "Sofía Garzón Mora",
      "Christian Haase"
    ],
    "title": "Containments of Tensor Network Varieties",
    "abstract": "Building upon the work of Buczyńska et al., we study here tensor formats and their corresponding encoding of tensors via two-fold tensor products determined by the combinatorics of a binary tree. The set of all tensors representable by a given network forms the corresponding tensor network variety. A very basic question asks whether every tensor representable by one network is representable by another network, namely, when one tensor network variety is contained in another. Specific instances of this question became known as the Hackbusch Conjecture. Here, we propose a general framework for this question and take first steps, theoretical as well as experimental, towards a better understanding. In particular, given any two binary trees on $n$ leaves, we define (and prove existence of) a new measure, the containment exponent, which gauges how much one has to boost the parameters of one network for the containment to hold. We present an algorithm for bounding these containment exponents of tensor network varieties and report on an exhaustive search among trees on up to $n=8$ leaves.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19800v1",
    "categories": [
      "math.PR",
      "math.ST"
    ],
    "authors": [
      "Xavier Emery",
      "Christian Lantuéjoul",
      "Nadia Mery",
      "Mohammad Maleki"
    ],
    "title": "Towards a complete characterization of indicator variograms and madograms",
    "abstract": "Indicator variograms and madograms are structural tools used in many disciplines of the natural sciences and engineering to describe random sets and random fields. To date, several necessary conditions are known for a function to be a valid indicator variogram but, except for intractable corner-positive inequalities, a complete characterization of indicator variograms is missing. Likewise, only partial characterizations of madograms are known. This paper provides novel necessary and sufficient conditions for a given function to be the variogram of an indicator random field with constant mean value or to be the madogram of a random field, and establishes under which conditions these two families of functions coincide. Our results apply to any set of points where the random field is defined and rely on distance geometry and Gaussian random field theory.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19790v1",
    "categories": [
      "math.NT",
      "math.CO"
    ],
    "authors": [
      "Russelle Guadalupe"
    ],
    "title": "A note on restricted partition functions of Pushpa and Vasuki",
    "abstract": "We establish infinite families of congruences modulo arbitrary powers of $2$ for three restricted partition functions $M(n), T^\\ast(n)$, and $P^\\ast(n)$ recently introduced by Pushpa and Vasuki by employing elementary $q$-series techniques.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19780v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Gaëtan Chenevier",
      "Olivier Taïbi"
    ],
    "title": "Unimodular lattices of rank 29 and related even genera of small determinant",
    "abstract": "We classify the unimodular Euclidean integral lattices of rank 29 by developing an elementary, yet very efficient, inductive method. As an application, we determine the isometry classes of even lattices of rank at most 28 and prime (half-)determinant at most 7. We also provide new isometry invariants allowing for independent verification of the completeness of our lists, and we give conceptual explanations of some unique orbit phenomena discovered during our computations. Some of the genera classified here are orders of magnitude larger than any genus previously classified. In a forthcoming companion paper, we use these computations to study the cohomology of GL_n(Z).",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19769v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Haritha S.",
      "Ullas Chandran S."
    ],
    "title": "General position and mutual-visibility in shadow graphs",
    "abstract": "The \\emph{general position problem} in graphs asks for a largest set of vertices in which no three lie on a common shortest path. The \\emph{mutual-visibility problem} seeks a largest set of vertices such that every pair is connected by a shortest path whose internal vertices lie outside the set. In this paper, we investigate the general position and mutual-visibility problems for shadow graphs. Sharp general bounds are established for both the general position number and the mutual-visibility number of shadow graphs, and classes of graphs attaining these extremal values are characterized. Furthermore, these invariants are determined for several standard classes of shadow graphs, including shadow graphs of cycles, multipartite graphs, and trees.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19746v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Nahid Sultana",
      "M M Rizvi",
      "Indu Wadhawan"
    ],
    "title": "A Multiobjective Water Allocation Model for Economic Efficiency and Environmental Sustainability: Case Study",
    "abstract": "The management of irrigation water systems has become increasingly complex due to competing demands for agricultural production, groundwater sustainability, and environmental flow requirements, particularly under hydrologic variability and climate uncertainty. Addressing these challenges requires optimization frameworks that can jointly determine optimal crop allocation, groundwater pumping, and environmental flow releases while maintaining economic and hydrological feasibility. However, existing hydro-economic models, including the widely used Lewis and Randall formulation, may overestimate net benefits by allowing infeasible negative pumping and surface water allocations. We extend the Lewis and Randall framework by reformulating groundwater pumping and surface water use as non-negative, demand-driven decision variables and by explicitly incorporating environmental flow and canal capacity constraints. Three models are developed to maximize economic benefit, minimize environmental deficits, and a multiobjective model that evaluates the trade-offs between these two objectives. An illustrative test case examining optimal crop area allocation and environmental flow management across dry, average, and wet years, using data from the Rajshahi Barind Tract in northwestern Bangladesh, is presented. The results show that the proposed formulation produces economically and hydrologically consistent solutions, identifying optimal strategies when either net benefits or environmental protection is prioritized, as well as Pareto-optimal trade-offs when both objectives are considered together. These findings provide practical insights for balancing farm income, groundwater sustainability, and ecological protection, offering a robust decision-support tool for irrigation management in water-limited river basins.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19715v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Poulami Paul",
      "Chanchal Kundu"
    ],
    "title": "Normalized Fractional Order Entropy-Based Decision-Making Models under Risk",
    "abstract": "Constructing efficient portfolios requires balancing expected returns with risk through optimal stock selection, while accounting for investor preferences. In a recent work by Paul and Kundu (2026), the fractional-order entropy due to Ubriaco was introduced as an uncertainty measure to capture varying investor attitudes toward risk. Building on this foundation, we introduce a novel normalized fractional order entropy aligned with investors' risk preferences that combines normalized fractional entropy with expected utility and variance. Risk sensitivity is modeled through the fractional parameter, interpolating between conservative or risk aversion and adventurous or high risk tolerance attitudes. Furthermore, the robustness and statistical significance of the fractional order entropy-based risk measure, termed normalized expected utility-fractional entropy (NEU-FE) and normalized expected utility-fractional entropy-variance (NEU-FEV) risk measures are explained with the help of machine learning tools, including Random forest, Ridge regression, Lasso Regression and artificial neural networks by using Indian stock market (NIFTY50). The results confirm that the proposed decision models support investors in making high-quality portfolio investments.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19685v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Mark Adler",
      "Pierre van Moerbeke"
    ],
    "title": "Transversal Cusp-Airy versus Cusp-Airy for Lozenge Tilings",
    "abstract": "The fluctuations of lozenge tilings of hexagons with one or several cuts (nonconvexities) along opposite sides are governed by the (discrete-continuous) tacnode kernel ${\\mathbb L}^{\\mbox{\\tiny dTac}}$, upon letting\n  the hexagon become very large (or in other terms, keeping the hexagon fixed, with the tiles becoming very small). This is a point process with a finite number $r$ of (continuous) points along a discrete set of parallel lines within a specific region (see \\cite{AJvM1,AJvM2}). Letting $r\\to\\infty$, one finds a liquid phase inscribed in the polygon, whose boundary (arctic curve) has a cusp near each cut, with two solid phases descending into the cusp (split-cusp). Duse-Johansson-Metcalfe \\cite{DJM} show that in this situation the tile-fluctuations should obey the cusp-Airy statistics. It would have seem natural to expect to see the same cusp-Airy kernel in the neighborhood of the cut, for the limit ($r\\to \\infty$) of the tacnode kernel ${\\mathbb L}^{\\mbox{\\tiny dTac}}$. As it turns out, another statistics appears: the {\\em transversal cusp-Airy} statistics, which was a puzzling fact to all of us. This statistics is derived and fully explained in this paper.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19678v1",
    "categories": [
      "math.DS",
      "math.FA"
    ],
    "authors": [
      "Udayan B. Darji",
      "Daniel Gomes",
      "Régis Varão"
    ],
    "title": "Dynamics of composition operators induced by odometers",
    "abstract": "We study the linear dynamics of composition operators induced by measurable transformations on finite measure spaces, with particular emphasis on operators induced by odometers. Our first main result shows that, on a finite measure space, supercyclicity of a composition operator implies hypercyclicity. This phenomenon has no analogue in several classical settings and highlights a rigidity specific to the finite-measure context.\n  We then focus on composition operators induced by odometers and show that many dynamical properties that are distinct for weighted backward shifts collapse in this setting. In particular, for such operators, supercyclicity, Li-Yorke chaos, hypercyclicity, weak mixing, and Devaney chaos are all equivalent.\n  In contrast to this collapse, we show that the classical equivalence between Devaney chaos and the Frequent Hypercyclicity Criterion for weighted backward shifts fails for odometers. Specifically, we construct a mixing, chaotic, and distributionally chaotic composition operator that does not satisfy the Frequent Hypercyclicity Criterion. This combination of rigidity and separation demonstrates that the dynamical behavior of composition operators induced by odometers differs sharply from that of weighted backward shifts.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19663v1",
    "categories": [
      "math.CA",
      "math.AP",
      "math.GT",
      "math.SP"
    ],
    "authors": [
      "Long Jin",
      "An Zhang",
      "Hong Zhang"
    ],
    "title": "Quantitative FUP and spectral gap for quasi-Fuchsian group",
    "abstract": "We derive an explicit formula for the exponent $β$ in the higher-dimensional fractal uncertainty principle (FUP) established by Cohen 2023, quantifying its dependence on the porosity parameter $ν$ of the Fourier support. This quantitative version of FUP yields an explicit essential spectral gap for convex co-compact hyperbolic 3-manifolds arising from quasi-Fuchsian groups, thereby refining the result of Tao 2025. Our result extends the earlier work of Jin-Zhang 2020 to higher dimensions.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19608v1",
    "categories": [
      "math.DG",
      "math.AG"
    ],
    "authors": [
      "Louis Dailly"
    ],
    "title": "Stability properties of adapted tangent sheaves on Kähler--Einstein log Fano pairs",
    "abstract": "Let $(X, Δ)$ be a log Fano pair with standard coefficients endowed with a singular Kähler--Einstein metric. We show that the adapted tangent sheaf $\\mathcal{T}_{X, Δ, f}$ and the adapted canonical extension $\\mathcal{E}_{X, Δ, f}$ are polystable with respect to $f^*c_1(X, Δ)$ for any strictly $Δ$-adapted morphism $f: Y \\to X$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19591v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Gianni Dal Maso",
      "Davide Donati"
    ],
    "title": "$Γ$-convergence and homogenisation for free discontinuity functionals with linear growth in the space of functions with bounded deformation",
    "abstract": "We study the $Γ$-convergence of sequences of free discontinuity functionals with linear growth defined in the space ${\\rm BD}$ of functions with bounded deformation. We prove a compactness result with respect to $Γ$-convergence and outline the main properties of the $Γ$-limits, which lead to an integral representation result. The corresponding integrands are obtained by taking limits of suitable minimisation problems on small cubes. These results are then used to study the deterministic and stochastic homogenisation problem for a large class of free discontinuity functionals defined in ${\\rm BD}$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19571v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Antonio Lei",
      "Katharina Müller"
    ],
    "title": "Iwasawa theory for abelian towers of digraphs",
    "abstract": "Let $p$ and $\\ell$ be prime numbers, and $d\\ge1$ an integer. We formulate and prove Iwasawa main conjectures of the Picard groups and Bowen--Franks groups in $\\mathbb{Z}_p^d$-towers of digraphs. In particular, we relate the $\\ell$ parts of these groups to certain $p$-adic $L$-functions defined using a voltage assignment. In the case where $\\ell$ is not equal to $p$, we make use of the recent work of Bandini--Longhi to define the appropriate characteristic ideals. We also prove the growth of the $\\ell$-part of these groups, generalizing classical results of Sinnott and Washington on ideal class groups of number fields. Finally, we introduce the concept of defect, which compare certain algebraic and analytic ranks related to Bowen--Franks groups and study their asymptotic behaviour in a $\\mathbb{Z}_p^d$-tower.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19569v1",
    "categories": [
      "math.GR",
      "math.CO"
    ],
    "authors": [
      "Surbhi",
      "Geetha Venkataraman"
    ],
    "title": "On the Symmetric Normaliser Graph of a Group",
    "abstract": "In this paper we introduce the symmetric normaliser graph of a group $G$. The vertex set of this graph consists of elements of the group. Vertices $x$ and $y$ are adjacent if $x$ lies in the normaliser of $\\langle y \\rangle$ and $y$ lies in the normaliser of $\\langle x \\rangle$. We investigate the hierarchical position this graph occupies in the hierarchy of graphs defined on groups. We show that the existing hierarchy is further refined by this graph and that the edges of this graph lie between the edges of the commuting graph and the nilpotent graph. For finite groups, we prove a necessary and sufficient condition for the symmetric normaliser graph to be equal to the commuting graph and similarly, for equality with the nilpotent graph. The edge set of the symmetric normaliser graph is also a subset of the edge set of the Engel graph of a group and has connections to the non-generating graph of a group.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19549v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Fengling Li",
      "Andrei Vesnin",
      "Xuan Yang"
    ],
    "title": "The unknotting numbers for plus-welded knotoids",
    "abstract": "Knotoid theory is a generalization of knot theory introduced by Turaev in 2012. In recent years, various invariants of knotoids have been studied. In this paper, we mainly discuss unknotting moves and unknotting numbers of plus-welded knotoids. Firstly, we prove that a descending diagram of a plus-welded knotoid can be transformed into a trivial one through a finite sequence of $Ω_1$, $VΩ_1 - VΩ_4$, $Ω_v$, $Φ_{\\text{over}}$, and $Φ_+$-moves. Secondly, we extend the warping degree of knots to plus-welded knotoids and discuss its properties. Finally, by utilizing the descending diagram and the warping degree, we obtain two unknotting operations for plus-welded knotoids, referred as a crossing change and a crossing virtualization. For both operations, we find upper bounds for corresponding unknotting numbers of plus-welded knotoids.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19546v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Augusto Teixeira",
      "Daniel Ungaretti"
    ],
    "title": "Holder continuity of interfaces for scale-invariant Poisson stick soup",
    "abstract": "We study the interface of covered and vacant sets in the subcritical phase of a scale-invariant Poisson stick soup on the plane. This model is a natural candidate for scaling limit of some planar models and has connections with long-range percolation on the plane with critical parameter $s=4$. We analyze a family of exploration paths on boxes and prove tightness for this family and Holder continuity for its limiting measures.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19516v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Roland Donninger",
      "Frederick Moscatelli"
    ],
    "title": "Blowup stability of wave maps without symmetry",
    "abstract": "We study wave maps from $(1+d)$-dimensional Minkowski space into the $d$-sphere without any symmetry assumptions. There exists an explicit self-similar blowup solution and we prove that this solution is asymptotically stable under small perturbations of the initial data. The proof is fully rigorous and requires no numerical input whatsoever.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19515v1",
    "categories": [
      "math.AP",
      "math-ph",
      "math.SP"
    ],
    "authors": [
      "Roland Donninger",
      "Frederick Moscatelli"
    ],
    "title": "Mode stability of self-similar wave maps without symmetry in higher dimensions",
    "abstract": "We consider wave maps from $(1+d)$-dimensional Minkowski space into the $d$-sphere. For every $d \\geq 3$, there exists an explicit self-similar solution that exhibits finite time blowup. This solution is corotational and its mode stability in the class of corotational functions is known. Recently, Weissenbacher, Koch, and the first author proved mode stability without symmetry assumptions in $d =3$. In this paper we extend this result to all $d \\geq 4$. On a technical level, this is the first successful implementation of the quasi-solution method where two additional parameters are present.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19512v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Mauro Sanchiz"
    ],
    "title": "Weak compactness in nice Musielak-Orlicz spaces",
    "abstract": "We prove two weak compactness criteria in Musielak-Orlicz spaces for $N$-functions satisfying the $Δ_2$-condition. They extend criteria from Andô for Orlicz spaces to this setting of non-symmetrical Banach function spaces. As consequences, we prove criteria for a sequence in a Musielak-Orlicz space to be weakly convergent, and show that Musielak-Orlicz spaces with the subsequence splitting property are weakly Banach-Saks. The study includes the case of Musielak-Orlicz sequence spaces.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19460v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Sean Dewar"
    ],
    "title": "A counter-example to Baranyai's combinatorial characterisation for 3-rigidity",
    "abstract": "Recently Baranyai described a necessary combinatorial characterisation of graph rigidity for dimension 3. In this short note we provide a counter-example to the converse of the condition. Additionally, we provide an alternative proof to the Baranyai's necessary condition.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19459v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Abdelhamid Amroun"
    ],
    "title": "On the distribution of the periods of convex representations I",
    "abstract": "We prove a central limit theorem for a class of Hölder continuous cocycles with an application to stricly convex and irreducible rational representations of hyperbolic groups, introduced by Sambarino [Quantitative properties of convexe representations. Comment. Math. Helv 89 (2014), 443-488].",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19456v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Simon N. Chandler-Wilde",
      "Siavash Sadeghi"
    ],
    "title": "Integral equation methods for scattering by general compact obstacles: wavenumber-explicit estimates",
    "abstract": "There has been significant recent interest in understanding the dependence on the wavenumber, $k$, of boundary integral operators (BIOs), supported on some set $Γ\\subset \\mathbb{R}^n$, that arise in the solution of BVPs for the Helmholtz equation, $Δu + k^2 u=0$. Recently, for the Dirichlet BVP with data $g$, Caetano et al (2025) have proposed an integral equation (IE) $A_kφ=g$ that applies for arbitrary compact $Γ$. This formulation is a generalisation of standard first kind IEs, where the BIO is $S_k$, the single-layer BIO on a surface $Γ$, that apply when $Γ$ is the boundary of a Lipschitz domain or a screen.\n  In this paper we study the dependence of $A_k$ on $k$, showing that, for $k\\geq k_0>0$, $\\|A_k\\|\\leq ck$ while $\\|A_k^{-1}\\| \\leq c'k$ if $Γ$ is star-shaped, where $c, c'>0$ depend only on $k_0$ and $Γ$. Amongst other bounds we also show that: (i) on the one hand, given any mildly increasing unbounded positive sequence $(k_m)$ and any unbounded sequence $(a_m)$, there exists $Γ$, with connected complement, such that $\\|A_{k_m}^{-1}\\|\\geq a_m$ for every $m$; (ii) on the other hand, for every $Γ\\subset \\mathbb{R}^n$ and $k_0,\\varepsilon, δ>0$, there exists $c>0$ and $E\\subset [k_0,\\infty)$, with Lebesgue measure $m(E)\\leq \\varepsilon$, such that $\\|A_{k}^{-1}\\|\\leq c k^{2n+2+δ}$ on $[k_0,\\infty)\\setminus E$, i.e., the growth of $\\|A_{k}^{-1}\\|$ is at worst polynomial in $k$ if one avoids a set $E$ of arbitrarily small measure.\n  As a corollary of these results we obtain the first $k$-explicit bounds on $\\|S_k^{-1}\\|$ and the condition number of $S_k$ for the case that $Γ$ is the boundary of a Lipschitz domain, or a screen not contained in a hyperplane, and analogous estimates for the case that $Γ$ is a $d$-set (and so of Hausdorff dimension $d$), for non-integer values of $d$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19455v1",
    "categories": [
      "math.QA"
    ],
    "authors": [
      "Anton Alekseev",
      "Megan Howarth",
      "Florian Naef",
      "Muze Ren",
      "Pavol Ševera"
    ],
    "title": "The kernel of formal polylogarithms",
    "abstract": "Polylogarithmic functions (polylogs) in $n$ variables can be viewed as elements of $(U\\mathfrak{p}_{m})^*$, the dual of the universal enveloping algebra of the Lie algebra $\\mathfrak{p}_{m}$ of infinitesimal spherical pure braids with $m=n+3$ strands. Polylogs with $m=4,5$ are used in the theory relating double shuffle relations and Drinfeld associators \\cite{furusho_double_2011}. We give explicit formulas for elements of $(U\\mathfrak{p}_{m})^*$ representing polylogs, and compute the left ideal $J_{m} \\subset U\\mathfrak{p}_{m}$ given by their joint kernel. We introduce Lie subalgebras $\\mathfrak{k}_{m}=\\mathfrak{p}_{m} \\cap J_{m}$, and we compute them for $m=4, 5$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19828v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Sergio Gómez"
    ],
    "title": "Galerkin-type time discretizations for parabolic and hyperbolic problems: stability and a priori error analysis",
    "abstract": "We present a unified framework for the analysis of space-time methods based on Galerkin-type time discretizations for parabolic and hyperbolic problems. Crucially, the stability analysis relies on a suitable choice of test functions to establish the continuous dependence of the discrete solution on the data in $L^{\\infty}(0, T; X)$ norms, which is then used to derive a priori error estimates. This approach closes the gap in the analysis of some methods in this class caused by the limitation of standard energy arguments, and is characterized by the absence of Grönwall estimates, applicability to arbitrary approximation degrees, reduced regularity assumptions, and robustness with respect to the model parameters.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19807v1",
    "categories": [
      "math.NT",
      "math.CO",
      "math.GN"
    ],
    "authors": [
      "Sayan Dutta"
    ],
    "title": "On the Sidon tails of $\\left\\{\\lfloor x^n\\rfloor\\right\\}$",
    "abstract": "We prove that the tail of the sets $$\\mathbf S_x := \\big\\{\\left\\lfloor x^n\\right\\rfloor : n\\in \\mathbb N\\big\\}$$ are Sidon for almost all $x\\in (1,2)$. Then we prove that for all $\\varepsilon>0$, there exists $x\\in (1,\\, 1+\\varepsilon)$ and $r\\in (2-\\varepsilon,\\, 2)$ such that $\\mathbf S_x$ and $\\mathbf S_r$ have a Sidon tail.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19764v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Guram Donadze",
      "Manuel Ladra",
      "Pilar Páez-Guillán"
    ],
    "title": "Schur's theorem and its relation to the closure properties of the non-abelian tensor product",
    "abstract": "We show that the Schur multiplier of a Noetherian group need not be finitely generated. We prove that the non-abelian tensor product of a polycyclic (resp. polycyclic-by-finite) group and a Noetherian group, is a polycyclic (resp. polycyclic-by-finite) group. We also prove new versions of Schur's theorem.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19758v1",
    "categories": [
      "math.OA",
      "math.FA",
      "math.GR"
    ],
    "authors": [
      "Felipe Flores",
      "Mario Klisse",
      "Mícheál Ó Cobhthaigh",
      "Matteo Pagliero"
    ],
    "title": "Pureness and stable rank one for reduced twisted group $\\mathrm{C}^\\ast$-algebras of certain group extensions",
    "abstract": "The purpose of this note is to prove two results. First, we observe that discrete groups with property $\\mathrm{P}_{\\mathrm{PHP}}$ in the sense of Ozawa give rise to completely selfless reduced twisted group $\\mathrm{C}^\\ast$-algebras, thereby extending a theorem of Ozawa from the untwisted to the twisted case. Second, we show that reduced (twisted) $\\mathrm{C}^\\ast$-algebras of some group extensions of the form finite-by-$G$, with $G$ having the property $\\mathrm{P}_{\\mathrm{PHP}}$, have stable rank one and are pure, which implies strict comparison. Our results do not assume rapid decay, and extend a theorem of Raum-Thiel-Vilalta. Examples covered by our results include reduced twisted group $\\mathrm{C}^\\ast$-algebras of all acylindrically hyperbolic groups and all lattices in ${\\rm SL}(n,\\mathbb R)$ for $n\\geq2$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19682v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Kazuaki Tanaka",
      "Ryoga Iwanami",
      "Kaname Matsue",
      "Hiroyuki Ochiai"
    ],
    "title": "A Green's Function-Based Enclosure Framework for Poisson's Equation and Generalized Sub- and Super-Solutions",
    "abstract": "This paper presents a novel framework for enclosing solutions of Poisson's equation based on generalized sub- and super-solutions constructed using fundamental solutions. The conventional definition of sub- and super-solutions based on variational inequalities often fails for natural function classes such as piecewise linear functions and encounters theoretical difficulties in non-convex polygonal domains, where H^2 regularity is lost because of corner singularities. To overcome these limitations, we introduce the concept of ``Green-representable solutions'' utilizing test functions constructed from fundamental solutions. This framework enables a new formulation of sub- and super-solutions that permits rigorous pointwise evaluation. For one-dimensional problems, we derive explicit constructions of the test functions. For two-dimensional polygonal domains, we employ the Method of Fundamental Solutions to generate test functions. The approach is validated through numerical experiments in both settings, including non-convex polygons. The results demonstrate that the proposed method yields strict and accurate pointwise enclosures of the true solution, even for problems with discontinuous source terms or geometric singularities.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19670v1",
    "categories": [
      "math.RT",
      "math.QA"
    ],
    "authors": [
      "Jinfeng Song",
      "Weinan Zhang"
    ],
    "title": "Representations of quantum symmetric pairs at roots of unity",
    "abstract": "Let $θ$ be an involution of a complex semisimple Lie algebra $\\mathfrak{g}$ and $(\\mathrm{U}_v,\\mathrm{U}^\\imath_v)$ be the associated quantum symmetric pair at an odd root of unity $v$. In this paper, generalizing the approach of De Concini-Kac-Procesi for quantum groups, we study the structures and irreducible representations of the iquantum group $\\mathrm{U}^\\imath_v$.\n  We establish a Frobenius center of $\\mathrm{U}^\\imath_v$ as a coideal subalgebra of the Frobenius center of the quantum group $\\mathrm{U}_v$. Via a quantum Frobenius map, we show that the Frobenius center of $\\mathrm{U}^\\imath_v$ is isomorphic to the coordinate algebra of a Poisson homogeneous space $\\mathcal{X}$ of the dual Poisson-Lie group $G^*$. We define a filtration on $\\mathrm{U}^\\imath_v$ such that the associated graded algebra is $q$-commutative. Using this filtration, we show that the full center of $\\mathrm{U}^\\imath_v$ is generated by the Frobenius center and the Kolb-Letzter center, and we determine the degree of $\\mathrm{U}^\\imath_v$. We show that irreducible representations of $\\mathrm{U}^\\imath_v$ are parametrized by $θ$-twisted conjugacy classes. We determine the maximal dimension of those irreducible representations, and show that the dimension of an irreducible representation is maximal if the corresponding twisted conjugacy class has maximal dimension. We also study the branching problem for irreducible $\\mathrm{U}_v$-modules when restricting to $\\mathrm{U}^\\imath_v$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19661v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Omid Zabeti"
    ],
    "title": "A topology on the Fremlin tensor product between locally solid vector lattices with applications",
    "abstract": "Let $E$ and $F$ be locally solid vector lattices. We introduce a locally solid topology on the Fremlin tensor product $E\\overline{\\otimes}F$ and we denote it by $τ_{E\\overline{\\otimes}F}$. It extends the Fremlin projective tensor product in the setting of Banach lattices. The main purpose of the paper is to determine conditions under which, the canonical bilinear mapping \\[E\\times F\\to (E\\overline{\\otimes}F,τ_{E\\overline{\\otimes}F}),\\hspace{0.50cm} (x,y)\\mapsto x\\otimes y,\\] is uniformly continuous when $E$ and $F$ are equipped with appropriate unbounded convergences whose associated topologies make the corresponding spaces locally solid vector lattices. By means of an inequality for tensor products in vector lattices and by exploiting the structure of the topology $τ_{E\\overline{\\otimes}F}$, we show, in particular, that\n  the Fremlin tensor product between Banach lattices preserves several important classes of unbounded convergences.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19642v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Takeshi Miura",
      "Natsumi Shibata"
    ],
    "title": "Additive and multiplicative maps in norm on the positive cone of continuous function algebras",
    "abstract": "Let $X$ and $Y$ be locally compact Hausdorff spaces. We denote by $C_0^+(X)$ the positive cone of all real-valued continuous functions on $X$ vanishing at infinity. In this paper, we consider a bijection $T\\colon C_0^+(X) \\to C_0^+(Y)$ satisfying the following two norm conditions for all $f, g \\in C_0^+(X)$: \\[\n  \\|T(f+g)\\| = \\|T(f)+T(g)\\|,\\qquad\n  \\|T(f \\cdot g)\\| = \\|T(f) \\cdot T(g)\\|. \\] The main result of this paper is that such a map $T$ is a composition operator of the form $T(f) = f \\circ τ$, induced by a homeomorphism $τ\\colon Y \\to X$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19630v1",
    "categories": [
      "math.PR",
      "math-ph",
      "math.AP"
    ],
    "authors": [
      "Matías G. Delgadino",
      "Scott A. Smith"
    ],
    "title": "Mass generation for the two dimensional O(N) Linear Sigma Model in the large N limit",
    "abstract": "This work studies the $O(N)$ Linear Sigma Model on $\\mathbb{R}^{2}$ under a scaling dictated by the formal $1/N$ expansion. We show that in the large $N$ limit, correlations decay exponentially fast, where the acquired mass decays exponentially in the inverse temperature. In fact, each marginal converges to a massive Gaussian Free Field (GFF) on $\\mathbb{R}^{2}$, quantified in the $2$-Wasserstein distance with a weighted $H^{1}(\\mathbb{R}^{2})$ cost function. In contrast to prior work on the torus via parabolic stochastic quantization, our results hold without restrictions on the coupling constants, allowing us to also obtain a massive GFF in a suitable double scaling limit. Our proof combines the Feyel/Üstünel extension of Talagrand's inequality with some classical tools in Euclidean Quantum Field Theory.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19629v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Dumitru I. Stamate",
      "Francesco Strazzanti"
    ],
    "title": "Nearly Gorenstein and almost symmetric properties in shifted numerical semigroups",
    "abstract": "Given the integers $0<r_1<\\dots<r_k$, we consider the shifted family of semigroups $M_n=\\langle n, n+r_1,\\dots, n+r_k\\rangle$, where $n>0$. For sufficiently large $n$, we prove that if $M_n$ is nearly Gorenstein or almost symmetric, then so is $M_{n+r_k}$. A key ingredient is to relate the pseudo-Frobenius elements of $M_n$ and $M_{n+r_k}$, correcting a wrong claim in the literature. Moreover, we derive explicit formulas for the Frobenius and pseudo-Frobenius numbers of $M_{n+r_k}$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19615v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Oliver Bachtler",
      "Felix Fritz",
      "Stefan Ruzika"
    ],
    "title": "An adjacency-based algorithm for computing all extreme-supported non-dominated points of a bi-objective combinatorial optimisation problem",
    "abstract": "Generally, multi-objective optimisation problems are solved exactly or approximated by solving a series of scalarisations, for example by dichotomic search. In this paper, we take a different approach and attempt to compute the set of all extreme-supported non-dominated points of a bi-objective combinatorial optimisation problem by using a neighbourhood-based approach. Whether or not this works depends on the definition of adjacency and we provide sufficient conditions that guarantee its success. The resulting generic algorithm is an alternative to dichotomic search in our setting.\n  We then apply our generic algorithm to a specific example: the bi-objective minimum weight basis problem, in which we are given a matroid and want to find bases of minimum weight. We use the natural definition of adjacency, in which two bases are adjacent if they differ in exactly one element. Since this satisfies our sufficient condition on the adjacency relation, our generic algorithm works in this case and we analyse its running time, showing that it is polynomial. By tailoring this algorithm specifically to matroids, we obtain one that is faster but no longer transitions between adjacent solutions, instead swapping directly from one extreme-supported point to the next in a combinatorial fashion.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19601v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Bharti Bharti",
      "René Bekker",
      "Nikki Levering",
      "Michel Mandjes"
    ],
    "title": "A framework for window design in delivery schedules",
    "abstract": "This paper develops a structured framework for the design and dynamic updating of service time windows in delivery and appointment-based systems. We consider a single-server setting with stochastic service and travel times, where customers are promised a time window in which the provider will arrive. The first part of the paper introduces a static window construction method based on a probabilistic threshold criterion, using an analytical approximation of residual travel and service time distributions. Building on this, we develop a dynamic update mechanism that monitors residual system uncertainty, where time windows are revised during execution only when the remaining time until the window's start falls below a predefined threshold. This threshold-based approach enables communication-efficient scheduling while substantially improving delivery accuracy. Numerical experiments demonstrate significant performance gains of the dynamic approach in both stylized and real-world settings.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19592v1",
    "categories": [
      "math.GR",
      "math.CO",
      "math.RA"
    ],
    "authors": [
      "Salvatore Tringali",
      "Weihao Yan"
    ],
    "title": "Torsion groups and the Bienvenu--Geroldinger conjecture",
    "abstract": "Let $M$ be a monoid (written multiplicatively). Equipped with the operation of setwise multiplication induced by $M$ on its parts, the collection of all finite subsets of $M$ containing the identity element is itself a monoid, denoted by $\\mathcal P_{{\\rm fin}, 1}(M)$ and called the reduced finitary power monoid of $M$.\n  One is naturally led to ask whether, for all $H$ and $K$ in a given class of monoids, $\\mathcal P_{\\fin,1}(H)$ and $\\mathcal P_{\\fin,1}(K)$ are isomorphic if and only if $H$ and $K$ are. The problem originates from a conjecture of Bienvenu and Geroldinger [Israel J. Math., 2025] that was recently settled by the authors [Proc. AMS, 2025]. Here, we provide a positive answer to the problem in the case where $H$ and $K$ are cancellative monoids, one of which is torsion. In particular, the answer is in the affirmative when $H$ and $K$ are torsion groups. Whether the conclusion extends to arbitrary groups remains open.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19576v1",
    "categories": [
      "math.KT",
      "math.OA"
    ],
    "authors": [
      "Florian Thiry"
    ],
    "title": "Geometric obstructions to fully ellipticity for families of manifolds with corners",
    "abstract": "In the present paper we study index theory for families of manifold with corners. In particular the K-theoretical obstruction for an elliptic operator to have a family (Fredholm) index. For codimension 1 corners (families with boundary) it gives an expected condition on indices associated to codimension 1 faces. The main theorem of this paper concern the codimension 2 case: in addition to the expected condition on indices associated to codimension 2 faces, there is an extra combinatoric condition implying the topology of the family base. This new condition is expressed in terms of conormal homology cycles with K-theoretical coefficients.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19544v1",
    "categories": [
      "math.OC",
      "math.AP"
    ],
    "authors": [
      "Karine Beauchard",
      "Thomas Perrin",
      "Eugenio Pozzoli"
    ],
    "title": "Approximate controllability of a bilinear wave equation and minimum time",
    "abstract": "We study the global approximate controllability (GAC) of a Klein-Gordon wave equation, posed on the torus $\\mathbb{T}^d$ of arbitrary dimension $d\\in \\mathbb{N}^*$, with bilinear control potentials supported on the first $(2d+1)$-Fourier modes. Let $Z(W_0)\\subset \\mathbb{T}^d$ be the set of essential zeroes of the initial state $W_0\\in H^1\\times L^2(\\mathbb{T}^d)$, and $r(W_0)\\geq 0$ be the maximum radius of a ball of $\\mathbb{T}^d$ contained in $Z(W_0)$. Due to finite speed of propagation, the minimum control time starting from $W_0$ is necessarily larger than or equal to $r(W_0)$. We prove the following three facts.\n  In low dimensions $d \\in \\{1,2\\}$: the minimum time for GAC from $W_0 \\neq 0$ is equal to $r(W_0)$.\n  In any dimensions $d\\geq 3$: the minimum time for GAC from $W_0$ is zero if $Z(W_0)$ has zero Lebesgue measure; and the GAC in sufficiently large time from all $W_0\\neq 0$.\n  The proof strategy consists in combining Lie bracket techniques \\emph{à la Agrachev-Sarychev} with the propagation of well-prepared positive states.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19465v1",
    "categories": [
      "math.HO"
    ],
    "authors": [
      "Urtzi Buijs"
    ],
    "title": "Higher dimensional visual proofs, Nicomachus' 4D Theorem and the mysterious irreducible factor $(3n^2+3n-1)$ in the sum of fourth powers",
    "abstract": "Sums of powers $S_p(n)=\\sum_{k=1}^n k^p$ can be described by Faulhaber's formula in terms of the Bernoulli numbers. The first cases of this formula admit visual proofs of various kinds, which lead to factorized Faulhaber polynomials.\n  In this article we present a technique that yields higher-dimensional visual proofs for these factorized formulas, providing a geometric interpretation of the roots that appear.\n  In particular, we prove Nicomachus's Theorem in four dimensions, and we visually explain the appearance, in dimension five, of the irreducible factor $(3n^2 +3n-1)$ in the polynomial ring over the rational numbers.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19872v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Leonhard Frerick",
      "Julia Huschens",
      "Michael Vu"
    ],
    "title": "Nonlocal Boundary Value Problems Governed by Symmetric Nonlocal Operators",
    "abstract": "Nonlocal boundary value problems with Dirichlet or Neumann boundary are well-studied for nonlocal operators of the type $\\mathcal{L}_γu = \\operatorname{PV} \\int_{\\mathbb{R}^d} \\big(u(\\cdot)-u(y)\\big) γ(\\cdot,y) \\, \\mathrm{d}y$ where the underlying kernel function $γ: \\mathbb{R}^d \\times \\mathbb{R}^d \\rightarrow [0,\\infty)$ is assumed to be measurable and symmetric. In this paper, a theory is introduced for problems whose governing operator is of the more general type \\[\\mathcal{L}u:= \\operatorname{PV} \\int_{\\mathbb{R}^d}\\big(u(\\cdot)-u(y)\\big) \\, K(\\cdot, \\mathrm{d}y)\\] where ${K: \\mathbb{R}^d \\times \\mathcal{B}(\\mathbb{R}^d) \\rightarrow [0,\\infty]}$ is a symmetric transition kernel. Our main focus is on nonlocal Dirichlet and Neumann problems and a classical Hilbert space approach is developed for solving designated weak formulations. As an example, the discrete Poisson problem on $Ω=(0,1)^d$ is discussed.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19868v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Shrajal Bajpai",
      "Lakshmi Kanta Patra"
    ],
    "title": "Estimating ordered variance of two scale mixture of normal distributions",
    "abstract": "This study investigates component wise estimation of ordered variances of scale mixture of two normal distributions. For this study two special loss functions are considered namely squared error loss function and entropy loss function. We have derived the general improvement results and based on these results the estimators that outperform BAEE are obtained. Moreover under certain sufficient conditions a class of improved estimators is proposed for both loss functions. As a special case of scale mixture of normal distribution the results are applied to the multivariate t-distribution and obtained the improvement results. For this case a detailed numerical comparison is carried out which validates our theoretical findings.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19855v1",
    "categories": [
      "math-ph",
      "math.AP",
      "physics.optics"
    ],
    "authors": [
      "Habib Ammari",
      "Erik Orvehed Hiltunen",
      "Bowen Li",
      "Ping Liu",
      "Jiayu Qiu",
      "Yingjie Shao",
      "Alexander Uhlmann"
    ],
    "title": "Non-Hermitian Fabry-Pérot Resonances",
    "abstract": "We characterise non-Hermitian Fabry-Pérot resonances in high-contrast resonator systems and study the properties of their associated resonant modes from continuous differential models. We consider two non-Hermitian effects: the exceptional point degeneracy and the skin effect induced by imaginary gauge potentials. Using the propagation matrix formalism, we characterise these two non-Hermitian effects beyond the subwavelength regime. This analysis allows us to (i) establish the existence of exceptional points purely from radiation conditions and to (ii) prove that the non-Hermitian skin effect applies uniformly across resonant modes, yielding broadband edge localisation.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19846v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Qian Huang",
      "Christian Rohde",
      "Ruixi Zhang"
    ],
    "title": "Convergence of a two-parameter hyperbolic relaxation system toward the incompressible Navier-Stokes equations",
    "abstract": "We investigate a two-parameter hyperbolic relaxation approximation to the incompressible Navier-Stokes equations, incorporating a first-order relaxation and the artificial compressibility method. With vanishingly small perturbations of initial velocity, we rigorously prove the simultaneous convergence of fluid velocity and pressure toward the Navier-Stokes limit in the three-dimensional case by constructing an intermediate affine system to obtain the necessary error estimates for the pressure. Furthermore, we extend the velocity convergence analysis to the case of $\\mathcal O(1)$ initial velocity perturbations, and establish the global-in-time recovery of the velocity field using a modulated energy structure and delicate bootstrap arguments in both two- and three-dimensional settings.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19830v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Changxin Ding",
      "Donggyu Kim"
    ],
    "title": "Grassmann--Plücker functions for orthogonal matroids",
    "abstract": "We present a new cryptomorphic definition of orthogonal matroids with coefficients using Grassmann--Plücker functions. The equivalence is motivated by Cayley's identities expressing principal and almost-principal minors of a skew-symmetric matrix in terms of its Pfaffians. As a corollary of the new cryptomorphism, we deduce that each component of the orthogonal Grassmannian is parameterized by certain part of the Plücker coordinates.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19808v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Antonio Segatti",
      "Roman Taranets"
    ],
    "title": "On $α$-entropy solutions of a nonlocal thin film equation: existence and finite speed of propagation",
    "abstract": "We consider an initial-boundary value problem for a class of nonlocal thin film equations governed by the spectral fractional Laplacian with homogeneous Neumann boundary conditions. We were the first to establish an $α$-entropy estimate for nonlocal thin film equations, which yields essential a priori bounds for the regularity and long-time behavior of weak solutions. By developing a localized version of this estimate, we prove finite speed of propagation, showing that the support of nonnegative solutions remains compact for positive times. Furthermore, we find a sufficient condition for a waiting time phenomenon, whereby the solution remains identically zero in a region for a nontrivial time interval. These results highlight new features in the interaction between nonlocal effects and classical thin film dynamics.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19779v1",
    "categories": [
      "math.RT",
      "hep-th"
    ],
    "authors": [
      "James Drummond",
      "Ömer Gürdoğan",
      "Jian-Rong Li"
    ],
    "title": "Tropical symmetries of cluster algebras",
    "abstract": "We study tropicalisations of quasi-automorphisms of cluster algebras and show that their induced action on the g-vectors can be realized by tropicalising their action on the homogeneous $\\hat{y}$ (or $\\mathcal{X}$) variables of a chosen initial cluster. This perspective allows us to interpret the action on g-vectors as a change of coordinates in the tropical setting. Focusing on Grassmannian cluster algebras, we analyse tropicalisations of quasi-automorphisms in detail. We derive tropical analogues of the braid group action and the twist map on both g-vectors and tableaux. We introduce the notions of unstable and stable fixed points for quasi-automorphisms, which prove useful for constructing cluster monomials and non-real modules, respectively.\n  As an application, we demonstrate that the counts of prime non-real tableaux with a fixed number of columns in $\\mathrm{SSYT}(3, [9])$ and $\\mathrm{SSYT}(4, [8])$, arising from the braid group action on stable fixed points, are governed by Euler's totient function. Furthermore, we apply our findings to scattering amplitudes in physics, providing a novel interpretation of the square root associated with the four-mass box integral via stable fixed points of quasi-automorphisms of the Grassmannian cluster algebra $\\CC[\\Gr(4,8)]$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19772v1",
    "categories": [
      "math.GR",
      "math.AT",
      "math.CT"
    ],
    "authors": [
      "Philip Hackney",
      "Justin Lynd",
      "Edoardo Salati"
    ],
    "title": "Embeddable partial groups",
    "abstract": "We record a folklore theorem that says a partial group embeds in a group if and only if each word has at most one possible multiplication, regardless of choice of parenthesization. We further investigate the partial groups which are exemplars of non-embeddability. Finally we show that a partial groupoid embeds in a groupoid if and only if its reduction embeds in a group.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19751v1",
    "categories": [
      "math-ph",
      "math.AP"
    ],
    "authors": [
      "Bin Chen",
      "Yujin Guo",
      "Phan Thành Nam",
      "Dong Hao Ou Yang"
    ],
    "title": "Pseudo-relativistic fermionic systems with attractive Yukawa potential",
    "abstract": "We study the Hartree-Fock and Hartree-Fock-Bogoliubov theories for a large fermionic system with the pseudo-relativistic kinetic energy and an attractive Yukawa interaction potential. We prove that the system is stable if and only if the total mass does not excess a critical value, and investigate the existence and properties of ground states in both sub-critical and critical mass regimes.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19744v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Robin Ming Chen",
      "Alexis Vasseur",
      "Dehua Wang",
      "Cheng Yu"
    ],
    "title": "Universality in the Low Mach number limit via a convex integration framework",
    "abstract": "We study the low Mach number limit of the compressible Euler equations through the lens of convex integration. For any prescribed $L^2$ weak solution of the incompressible Euler equations, we construct a corresponding family of weak solutions to the compressible Euler equations via a refined convex integration scheme. We then prove that, as the Mach number tends to zero, this family of solutions converges strongly to the given incompressible solution. This result demonstrates that the incompressible system acts as a universal attractor in this setting: every incompressible flow can be realized as the limit of convex integration solutions to the compressible system. Our approach highlights a new form of universality for singular limits and provides a rigorous framework for understanding the incompressible limit from the perspective of weak solution theory.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19740v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Pengjun Wang",
      "Zezhong Zhang",
      "Minglei Yang",
      "Feng Bao",
      "Yanzhao Cao",
      "Guannan Zhang"
    ],
    "title": "Error estimates of a training-free diffusion model for high-dimensional sampling",
    "abstract": "Score-based diffusion models are a powerful class of generative models, but their practical use often depends on training neural networks to approximate the score function. Training-free diffusion models provide an attractive alternative by exploiting analytically tractable score functions, and have recently enabled supervised learning of efficient end-to-end generative samplers. Despite their empirical success, the training-free diffusion models lack rigorous and numerically verifiable error estimates. In this work, we develop a comprehensive error analysis for a class of training-free diffusion models used to generate labeled data for supervised learning of generative samplers. By exploiting the availability of the exact score function for Gaussian mixture models, our analysis avoids propagating score-function approximation errors through the reverse-time diffusion process and recovers classical convergence rates for ODE discretization schemes, such as first-order convergence for the Euler method. Moreover, the resulting error bounds exhibit favorable dimension dependence, scaling as $O(d)$ in the $\\ell_2$ norm and $O(\\log d)$ in the $\\ell_\\infty$ norm. Importantly, the proposed error estimates are fully numerically verifiable with respect to both time-step size and dimensionality, thereby bridging the gap between theoretical analysis and observed numerical behavior.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19691v1",
    "categories": [
      "math.AG",
      "math-ph",
      "math.RT"
    ],
    "authors": [
      "Ki Fung Chan",
      "Kwokwai Chan",
      "Chi Hong Chow",
      "Chin Hang Eddie Lam"
    ],
    "title": "Iwahori-Coulomb branches, stable envelopes, and quantum cohomology of cotangent bundles of flag varieties",
    "abstract": "We consider Iwahori-Coulomb branches $\\mathcal{A}_{G,\\mathbf{N},\\mathbf{V}}^{\\mathrm{Fl}}$, which are the affine flag analogs of the original Coulomb branches $\\mathcal{A}_{G,\\mathbf{N}}^{\\mathrm{Gr}}$ defined by Braverman, Finkelberg, and Nakajima. For any conical symplectic resolution $X$, we prove that the $\\mathcal{A}_{G,\\mathbf{N},\\mathbf{V}}^{\\mathrm{Fl}}$-action on the localized equivariant quantum cohomology of $X$, induced by shift operators, satisfies a polynomiality property in terms of stable envelopes.\n  We then study the case $X = T^*(G/P)$, the cotangent bundle of a flag variety, for which the Iwahori-Coulomb branch is isomorphic to the trigonometric double affine Hecke algebra $\\mathcal{H}_{G,\\hbar,k}$. The polynomiality property enables us to compute explicitly the above action in terms of the Demazure-Lusztig elements and stable envelopes. Applications include:\n  (1) Computation of the Iwarhori-Coulomb branch action for $G/P$ by taking the confluent limit, recovering Peterson-Lam-Shimozono's theorem.\n  (2) Construction of an explicit Namikawa-Weyl group action on the equivariant quantum cohomology of $T^*(G/P)$ that preserves the quantum product, extending a result of Li-Su-Xiong.\n  (3) Proof of a conjecture of Braverman-Finkelberg-Nakajima stating that, up to a shift of the dilation parameter, $\\mathcal{A}_{G,\\mathfrak{g}^*}^{\\mathrm{Gr}}$ is isomorphic to the spherical subalgebra of $\\mathcal{H}_{G,\\hbar,k}$.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19879v1",
    "categories": [
      "math.CO",
      "math.NT"
    ],
    "authors": [
      "Zach Hunter",
      "Cosmin Pohoata",
      "Jacques Verstraete",
      "Shengtong Zhang"
    ],
    "title": "Large point-line matchings and small Nikodym sets",
    "abstract": "For any integer $d \\geq 2$ and prime power $q$, we construct unexpectedly large induced matchings in the point-line incidence graph of $\\mathbb{F}_{q}^{d}$ by leveraging a new connection with the Furstenberg-Sárközy problem from arithmetic combinatorics. In particular, we significantly improve the previously well-known baselines when $q$ is prime, showing that $\\mathbb{F}_{q}^{2}$ contains matchings of size $q^{1.233}$ and $\\mathbb{F}_{q}^{d}$ contains matchings of size $q^{d-o_{d}(1)}$.\n  These results and their proofs have several applications. First, we also obtain new constructions for finite field Nikodym sets in dimension $d \\geq 2$, improving recent results of Tao by polynomial factors. For example, when $q$ is prime, we show the existence of Nikodym sets in $\\mathbb{F}_q^d$ of size $q^d - q^{d - o_d(1)}$. Second, we construct a new minimal blocking set in $\\mathrm{PG}(2,q)$, solving a longstanding problem in finite geometry. Third, we obtain new constructions for the minimal distance problem (in $\\mathbb{R}^{2}$ and also in higher dimensions), improving a recent result of Logunov-Zakharov.\n  We also obtain analogous results for general finite fields with large characteristics. In particular, in one of our constructions we introduce a new special set of points inside the norm hypersurface in $\\mathbb{F}_{q}^{d}$, which directly generalizes the classical Hermitian unital and which may be of independent interest for applications.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19875v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Stephen McCormick"
    ],
    "title": "Mass, staticity, and a Riemannian Penrose inequality for weighted manifolds",
    "abstract": "In this note, we show that the weighted mass of Baldauf and Ozuch can be derived as a natural geometric mass invariant following Michel, for a certain weighted curvature map. An associated weighted centre of mass definition is also derived from this. The adjoint of the linearisation of this curvature map leads to a notion of weighted static metrics, which are natural candidates for weighted mass minimisers. This weighted curvature quantity is essentially the scalar curvature of a conformally related metric that Law, Lopez and Santiago used to considerably simplify the proof of the weighted positive mass theorem.\n  We show an equivalence between static metrics and weighted static metrics via the conformal relationship, from which we show that a uniqueness theorem holds for weighted static manifolds with weighted minimal surface boundaries. Furthermore, we show that weighted manifolds satisfy a Riemannian Penrose inequality whose equality case holds precisely for these unique weighted static metrics.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19874v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Karan Rathore",
      "Mohan Mallick",
      "Ram Baran Verma"
    ],
    "title": "Lane--Emden Systems with Singular Nonlinearities for the Fully Nonlinear Elliptic Operator",
    "abstract": "Consider \\[ \\begin{cases} F(D^2 u,Du,u,x) = u^{-p}v^{-q},~\\text{in}~Ω\\\\ F(D^2 v,Dv,v,x)=u^{-r}v^{-s},~~\\text{in}~~Ω\\\\ u,v>0~~\\text{in}~~Ω\\\\ u=v=0~\\quad~\\text{on}~~\\partialΩ, \\end{cases} \\] where $Ω$ is an open connected subset of $\\mathbb{R}^{N}$ and $p,s$ are two non-negative and $q,r$ are positive real numbers. This article discuses the conditions in terms of the relations among $p,q,r$ and $s$ which lead to existence, uniqueness and non-existence of positive solutions to the system. Furthermore, we also have studied some regularity properties of solution of the system. These results are inspired by the study of Lane-Emden system of equations as in \\cite{busca2002liouville,ghergu2010lane}.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19885v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Benjamin Baily"
    ],
    "title": "Extremal F-thresholds in regular local rings",
    "abstract": "Let $(R, \\mathfrak{m})$ be a regular local ring of characteristic $p > 0$. Among all proper ideals $\\mathfrak{a}\\subseteq R$ with a fixed order of vanishing $\\text{ord}_{\\mathfrak{m}}(\\mathfrak{a})$, we classify the ideals for which the $F$-threshold $\\text{ft}^{\\mathfrak{m}}(\\mathfrak{a})$ is minimal.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19881v1",
    "categories": [
      "math.GR",
      "math.GN"
    ],
    "authors": [
      "Oleg Gutik"
    ],
    "title": "On semigroups which admit only discrete left-continuous Hausdorff topology",
    "abstract": "We give the sufficient condition when every left-continuous (right-continuous) Hausdorff topology on a semigroup $S$ is discrete. We construct a submonoid $\\mathscr{C}_{+}(a,b)$ (resp., $\\mathscr{C}_{-}(a,b)$) of the bicyclic monoid which contains a family $\\{S_α\\colon α\\in\\mathfrak{c}\\}$ of continuum many subsemigroups with the following properties: $(i)$ every left-continuous (resp., right-continuous) Hausdorff topology on $S_α$ is discrete; $(ii)$ every semigroup $S_α$ admits a non-discrete right-continuous (resp., left-continuous) Hausdorff topology which is not left-continuous (resp., right-continuous); $(iii)$ every semigroup $S_α$ isomorphically embeds into a Hausdorff compact topological semigroup. Also we construct a submonoid $\\mathscr{C}_{\\mathbb{Z}}^+$ (resp., $\\mathscr{C}_{\\mathbb{Z}}^-$) of the extended bicyclic semigroup which contains a family $\\{S_α\\colon α\\in\\mathfrak{c}\\}$ of continuum many subsemigroups with the above described properties.",
    "date": "01-28"
  },
  {
    "link": "https://arxiv.org/pdf/2601.19877v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Gunnar Birke",
      "Christian Engwer",
      "Sandra May",
      "Louis Petri",
      "Hendrik Ranocha"
    ],
    "title": "An Energy-Preserving Domain of Dependence Stabilization for the Linear Wave Equation on Cut-Cell Meshes",
    "abstract": "We present an energy-preserving (either energy-conservative or energy-dissipative) domain of dependence stabilization method for the linear wave equation on cut-cell meshes. Our scheme is based on a standard discontinuous Galerkin discretization in space and an explicit (strong stability preserving) Runge Kutta method in time. Tailored stabilization terms allow for selecting the time step length based on the size of the background cells rather than the small cut cells by propagating information across small cut cells. The stabilization terms preserve the energy stability or energy conservation property of the underlying discontinuous Galerkin space discretization. Numerical results display the high accuracy and stability properties of our scheme.",
    "date": "01-28"
  }
]